{"title": "Beyond the Horror: Cult Episode 4", "url": "https://www.youtube.com/watch?v=-U0VOU17DSU", "image": "https://i.ytimg.com/vi/-U0VOU17DSU/maxresdefault.jpg", "author": "MaryGirl Moody", "viewCount": "1178", "datePublished": "2017-09-30", "likes": "76", "dislikes": "5", "comment": ["Meadow and Harrison exolained in their first episode that they were able to rent thebhouse cheap and with no credit check because of the murders in the house.  If they were already in the neighborhood and registered in that district prior to the election, even if they moved, they would still vote there.  So its not that far fetched that they voted with everyon in their district since they were that close to the election and probably had not been able to register under a new address.  Just a thought.  :)", "If I have the timeline correct, after kai gets his cult together he probably financially helped out Harrison and meadow to buy the house for a few reasons. One being the fact that it earns him a opening to becoming the councilman in place of Mr.Chen (after they killed him). Another being the fact that he is now closer to Ally and lastly sort of a pay for Harrison and meadow joining his cult.", "During election, Harrison and Meadow were not yet in financial trouble... Kai and Harrison don't meet until after the election. When they meet, Harrison tells Kai that he its glad Kai picked him because 3 clients dropped him after the election. Harrison doesn't lose the house until 3 months later. You know this because Kai had purchased 12 sessions... Lets say he gets 1 per week. Harrison had to convince Kai to buy more sessions. This is when Kai convinces Harrison to kill this boss. Hope this helps clarify the confusion.", "I fell asleep mid-way through, argh! Lol, good stream guys, just rewatching the whole thing again... great job Jonas!", "So sorry I missed it 😭 I was at a family reunion this weekend and everyone had no cell service or Wi-Fi.  I tried so hard to be able to watch, couldn't even get 3g where I was. Scariest part is the place it was held there was a cemetery across the street and a church next to the venue that actually looked like the house in season 6."], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "VIDEO CONTAINS SPOILERS FOR American Horror Story, Season 7, Episode 4!!!\n\nBeyond the Horror: Cult, is an unofficial American Horror Story Live After Show. Hosted by MaryGirl Moody. Guests include: Maisie Andrews, Casey Soper, and Tami Sifford. We discuss and review each episode of American Horror Story Cult.\n\nPetition Link to MAKE MARY AN AMERICAN HORROR STORY WRITER: "}