{"title": "Love Letter to Deep Space Nine's Rejoined", "url": "https://www.youtube.com/watch?v=0V_nq1ABJjs", "image": "https://i.ytimg.com/vi/0V_nq1ABJjs/maxresdefault.jpg", "author": "Five by Five Takes", "viewCount": "2926", "datePublished": "2020-04-30", "likes": "284", "dislikes": "2", "comment": ["The argument that the story isn't an LGBT one because Dax was once a man is nonsensical. It makes it MORE LGBT, instead of a lesbian narrative, we have a trans lesbian narrative, something we almost never see. Rejoined is beyond important as a LGBT narrative, it's basically essential viewing.", "Deep Space 9 was such a good show.... love these groovy wlw (worms loving worms)", "The argument that it doesn't count because Torias was male, feels reminiscent to the argument that the gems in Steven Universe don't count as lesbians, because they are \"just rocks\", that since they don't have a bi-modal gender that their relationships don't count as female/female. Ignoring that as far as I know most if not all refer to themselves as female.", "One thing that the Taboo is about (made clear by how other episodes deal with identity) is that there is a question about whether these are Jadzia's feelings or Torias's.  And the episode is framed in a way that no one is quite sure.  In a way the taboo is about what's fair to Jadzia, is it fair to have her life hijacked and overwritten by Torias's regrets?", "i'm not crying you're crying"], "authorLink": "https://www.youtube.com/channel/UCC2Bw649-AJJWJDX74f85qg", "description": "Hello friends! Fox here with something I had so much fun making. It's my first video completely written, recorded, and edited by yours truly, and I'm pretty proud of it. Deep Space Nine, and Star Trek in general is important to me and I wanted to dive into this episode under the guise of \"I love this episode, let's figure out why.\" And I think it turned out alright! Thank you for watching! Look out next for Sara's newest project :) -Fox\n\nNOTE: The original upload of this video got flagged for copyright and is currently in dispute, some of the editing has been changed in this one and hopefully the original will eventually be posted.\n\nTwitter: "}