{"title": "Amy Acker - Shoot reunion panel @ Clexacon 2017", "url": "https://www.youtube.com/watch?v=0WzhJX45CFs", "image": "https://i.ytimg.com/vi/0WzhJX45CFs/maxresdefault.jpg", "author": "AmyAckerFanGuyChannel", "viewCount": "124979", "datePublished": "2017-03-12", "likes": "1,459", "dislikes": "30", "comment": ["someone asked amy : do you think root has a crush for hanna frey (Root's childhood friend)\nsarah : who's hanna frey?\namy : um, she was before your time..", "I am soooo damn sad now that i finished watching POI. I seriously fell in love with this show. The characters were phenomenal!! No other show can compare in the spectacular performances. I was so heartbroken when Root died that i literally had to remind myself that it wasn’t real. That’s how amazing the cast was. I am totally crushing on Root and Shaw. #TeamMachine", "It's interesting what Sarah said about the simulation \"It's the most Shaw could ever show\". It reminds me of an interview a couple years back where Sarah said that she honestly believed Root and Shaw never hooked up, because Shaw would have to overcome tremendous obstacles before she allowed herself to go there with Root and be vulnerable. This confirms it, I think. The simulation was showing a Shaw at the apex of her character development, only a that point would she be a little romantic and intimate with Root.", "Weird that 2 straight women with kids could almost write the scripts for them. Even in the first scene where Root was about to torture Shaw with an iron, they chewed up the scenery, and I was thinking get a room! Best TV couple ever, amazing acting. hope Nolan finds a way to keep it alive, miss POI so much", "I just got through binging on the entire series.  These two really made the show for me.  Obviously the other characters were integral in the overall success but the interplay between these two and their stand alone characters were fairly amazing."], "authorLink": "https://www.youtube.com/channel/UCJ1zyiCmd3QBRTDw5AoDpgw", "description": ""}