{"title": "WHAT IF 1x03: Every Easter Egg and Winter Soldier Connection | Fury's Big Week Full BREAKDOWN", "url": "https://www.youtube.com/watch?v=1Az1XRZDTWM", "image": "https://i.ytimg.com/vi/1Az1XRZDTWM/maxresdefault.jpg", "author": "ScreenCrush", "viewCount": "226846", "datePublished": "2021-08-25", "likes": "7,942", "dislikes": "191", "comment": ["Download and play Mobile Legends: Bang Bang using my link https://bit.ly/2VVSHk5 and use my code to get permanent Hero - Granger& Skin Megatron (Epic)! Code: MLBB2021 Log in https://m.mobilelegends.com/en/codexc... to claim!", "Now Fury will give Steve the Iron Man armor, and since he is capable of lifting Thor hammer mabe it will be \"Captain America: The Only Avenger\" episode", "See that Antman's going through Thanos' as$ joke isn't so bad at all, look what it did to hulk", "Loki threatening to reduce Earth until it is nothing but \"ash and ice\" while he's demanding the body of his brother's killer is a nice way of letting us know Loki will always love Thor somewhere deep down, no matter what.", "That Hulk scene…..my god."], "authorLink": "https://www.youtube.com/channel/UCgMJGv4cQl8-q71AyFeFmtg", "description": "Download and play Mobile Legends: Bang Bang using my link https://bit.ly/2VVSHk5 and use my code to get permanent Hero - Granger& Skin Megatron (Epic)! Code: MLBB2021 Log in https://m.mobilelegends.com/en/codexc... to claim!\n\nWhat If Episode 3 is an alternate take on “Fury’s Big Week.” This is the Avengers prelude comic that detailed the events leading up to the Avengers; established a Marvel timeline, and revealed that the events of Iron man 2, The Incredible Hulk, Thor, and Captain America: First Avenger’s ending all happened in the same week.\n\nThis episode features Hank Pym dismantling the Avengers (which probably proves that the Strongest Avenger is Scott Lang, right?). This delightful rampage through Phase One has massive repercussions, as Loki conquers Earth and Fury is forced to use his Captain Marvel pager a bit early.  \n\nIf you're new, Subscribe! → "}