{"title": "POI S5E02 SNAFU, p2 [Root, Root x Shaw]", "url": "https://www.youtube.com/watch?v=1TMgI-hVR9k", "image": "https://i.ytimg.com/vi/1TMgI-hVR9k/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "80042", "datePublished": "2016-06-21", "likes": "336", "dislikes": "8", "comment": ["One thing a lot of people seem to miss isn't that Finch is scared of his creation. He's not. He's wary, and cautious, but what terrifies him is people. People abusing his creation, people turning what should be a shield into a weapon.", "Wow man all this they went to such lengths and now the machine has turned on them because she thinks their a threat it makes perfect sense and is comically Ironic", "fun fact: everything you saw in the scene, where the machine shows us the Personal datas of the people around Finch, is actual happening in china.", "Lol Why did you hide the machine interface effects?", "Rosineide  dos  Santos Souza 100💔💔💔💔💔💔💝😍👄😘👌"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root asks The Machine to search for Shaw.\n\nEpisode summary:\nWith the Machine now fully decompressed and Root unable to go above ground until the Machine can reinstate her rotating identities, Finch decides to use Reese and Fusco to run a surveillance test. Following malfunctions in the facial recognition system, Reese and Finch steal 64 next-generation graphics-processing GPU blade servers which, once connected to the networked PlayStation 3s, Finch and Root use to reboot the Machine at full power. When the Machine shows signs that it's failing to place threats in context, Root and Finch have it run a contextual background on them, leading to it identifying them as threats, and locking them out of the system. The Machine has lost the ability to differentiate between past and present, so is forced to relive the 42 times Finch killed it and unable to determine that Root and Reese have changed. With Reese waylaid by an assassin the Machine has sent after him, Root puts herself under an anaesthetic so the Machine cannot use her cochlear implant against her, and Finch has to convince the Machine that he and the rest of the team are not a threat. Upon the Machine's first reboot, it provided 30 different numbers, most of whom were not involved in violent crimes; however, one of those numbers, Jeff Blackwell (Josh Close), an ex-con with a violent past, was dismissed as someone who was not involved in any nefarious activity, only to be recruited by Samaritan.\n\nMay 9, 2016"}