{"title": "Beyond the Horror: Cult Episode 2", "url": "https://www.youtube.com/watch?v=2X_1IoqCqe4", "image": "https://i.ytimg.com/vi/2X_1IoqCqe4/maxresdefault.jpg", "author": "MaryGirl Moody", "viewCount": "1522", "datePublished": "2017-09-12", "likes": "59", "dislikes": "3", "comment": ["Love watching y'all! Hate that I don't get to watch it until later so I can't be part of the live stream!", "Yea by no supernatural Ryan obviously means anything magical like ghosts, witches, vampires...etc. Each season is a completely different story. Yes there are connections but I feel like those are more knods from the team. Overall the great part of the show is that it can start over completely each season. So there doesn't have to be a continuation of any mythology or magic in every season. In terms of the \"possession\" with Winter I feel like it's more like brain washing. That is a huge element of a cult. You can get people to do things for you. Just like Charles Manson. This season is a political horror...a real world horror with satire towards both parties. It doesn't have to involve supernatural elements.", "Love this love the show anyone see the nod to the top hat in the bedroom.", "Just rewatched episode 2 the neighbor said he is a trainer at \"Funtime fitness\" do u  think there will be a scene where she goes there  to train and there are clowns? Or perhaps he has clown stuff and his cover up is \"oh yea that's my work gear\" lol", "Twisty was part of Ozy's night terrors. \nSeduction scene in the bathtub, reminded me of Edward Phillippe Mott & Guinness. (servant/employer mirroring!)\nSmiley faces remind me of the symbol of #ProjectMayhem from Fight Club... total cult!"], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "VIDEO CONTAINS SPOILERS FOR American Horror Story, Season 7, Episode 2!!!\n\nBeyond the Horror: Cult, is an unofficial American Horror Story Live After Show. Hosted by MaryGirl Moody. Guests include: Maisie Andrews, Casey Soper, and Tami Sifford. We discuss and review each episode of American Horror Story Cult.\n\nPetition Link to MAKE MARY AN AMERICAN HORROR STORY WRITER: "}