{"title": "POI S3E21 Beta, p1 [Shaw, Root x Shaw]", "url": "https://www.youtube.com/watch?v=3DRISK6l7ZU", "image": "https://i.ytimg.com/vi/3DRISK6l7ZU/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "49818", "datePublished": "2016-07-15", "likes": "247", "dislikes": "3", "comment": ["the Shaw character is Ground Breaking!! BRILLIANTLY PORTRAYED by Sarah Shahi!!", "The actors did a BRILLIANT JOB  with the characters!!", "Samaritan, the asi that was spoon-fed everything from everywhere, never given an opportunity to learn the basics of survival. That's why the machine ultimately destroyed it on that satellite, the machine learned the basics of survival from various angles, samaritan on the other hand had everything handed to it on a golden plate, it never had ethics and a moral code like the machine did, the machine learned about true isolation and survival of the fittest and it evolved on its own growing stronger and stronger each time unlike samaritan.", "And they Canceled this show!!  Shaw Root Fusco Reese,  and Harold!! GREAT CHARACTERS. AND A GREAT SHOW!!", "Rickys face was like 'should i act yet should i act yet WAIT WAT'"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Shaw thwarts a robbery while eating ice cream.\nRoot grabs Shaw off the street.\n\nEpisode summary:\nWith Finch having disappeared, Decima initiates their plan with Samaritan, and when unable to find Finch, they look for his closest connection and the number received is that of Finch's fiancee Grace. The Machine also provides Grace's number as a result, and Reese, Shaw and Root work to protect her while evading Decima, who use Samaritan to spy on them within the range of New York. Grace is eventually kidnapped and interviewed by Greer, who reveals his extensive knowledge of her and begins asking about her life with Finch. When he implies that Finch lied to her, Grace snaps and firmly tells Greer that Finch would never lie as Grace gave him her unbreakable trust. When the team manages to locate Decima's current HQ, Greer takes Grace and tells Reese and Shaw that they can get Grace back in exchange for giving them Finch. Finch agrees to the deal, and at Jefferson Bridge, Grace is blindfolded and brought to Reese and crew while Finch is taken by Decima. Reese later gives Grace an envelope, saying that she has been accepted for a job in Italy. Greer, meanwhile, finally meets Finch in person and sits down with him to talk.\n\nApril 29, 2014"}