{"title": "Top 9 Best SAW Characters #9 | SAW-Tober 2020", "url": "https://www.youtube.com/watch?v=3hqGQKbWpPs", "image": "https://i.ytimg.com/vi/3hqGQKbWpPs/maxresdefault.jpg", "author": "Reel Talk", "viewCount": "926", "datePublished": "2020-10-23", "likes": "66", "dislikes": "0", "comment": ["Willaim Easton is definitely one of my favourite trap victims. Dispite initially being presented as an unlikeable character, he wasn't annoying like Bobby is Saw VII, and he actually understood his flaws and what Jigsaw was trying to teach him, unlike Jeff in Saw III. He grew more and more likable over the course of the film. Its a shame that he died, he seemed to have actually learned his lesson, I wonder what he might have been like as a Jigsaw apprentice. He might have been able to prevent Hoffman from going completely insane.", "Awesome video! Saw 6 is my favorite in the franchise and William is a big reason why. Honestly he was sympathetic from the start to me because he was just doing his job and running his company efficiently. He’s well developed and saves a lot of people. It always annoys me when that brat pulls the lever on him lol 😂.", "This guy is super underrated", "I thought the whole top nine was in this and I was like “I want more videos from this guy” and now I’m happy that it’s a three minute single segment cause that’s good. But yee. I’m watching the other parts.", "This is definitely the best series I have seen and I think I will not see a better series it all started with James Wana who introduced us to this series as he should, and I cannot leave it. As for William Eston, I can say that the tests he had beat were similar to what Jeff was going through in the third part in a way. they both died but each of them from different sides. john rightly tested william. and in the end he put his life in someone else's hands, what a brutality. he would have passed the tests but he was responsible for his client's life and john took advantage of this and left his life in the hands of justice that brent and tara would administer in the name of forgiveness"], "authorLink": "https://www.youtube.com/channel/UC4GPRqEoZ4zpnTHIxcG5JyQ", "description": "SAW-Tober #9 (Top 9 Best Characters in SAW): First up on the list is William Easton from SAW VI. Why is this character so high on the list? Honestly, it has a lot to do with how SAW VI is still just as relevant as it was then as it is today. Although, there is a little bit more. Let's dive into it!\n\nJigsawRules:"}