{"title": "Person of Interest - Season 5 Teaser Trailer (Comic Con 2015)", "url": "https://www.youtube.com/watch?v=3OFfSf7ukwg", "image": "https://i.ytimg.com/vi/3OFfSf7ukwg/maxresdefault.jpg", "author": "Novus Destiny", "viewCount": "203098", "datePublished": "2015-07-14", "likes": "863", "dislikes": "23", "comment": ["I love this show because some episodes start out like they might be a \"filler\" episode like other shows do, but they always deliver with the main plot. Fucking amazing show!", "Why would they make this the last season... the last episode of season 4 made me tear up. and I never get emotional over TV shows... \"Father... I'm sorry\" Wow that shit got me... now I feel kinda empty inside knowing season 5 will be the end... They think 13 episodes can close up one of the best TV shows to come out on at least 10 years? CBS your decision will cost you many viewers. I swear it's like they haven't figured out Thierry ratings are shit because everyone watches Netflix and Hulu now. We are being punished because of that fact. All the Good shows get canceled because they don't put them on Netflix in time to see where the real viewers are. Man this made me depressed...", "20 dislikes from Samaritan team.", "This is our future.", "Out of the 4 major OTA networks CBS, NBC, ABC & FOX. CBS is the only one that seems to not cancel most new shows because episode 2 didn't do as good as episode 1, At least CBS gave POI 5 seasons the only disappointment is they cut season 5 down to only 13 episodes, here's hoping Netflix picks up POI for season 6 and beyond which would be nice because with Netflix you get the complete season released at the same time and that is how I prefer to watch soap opera type shows I like to binge watch.  "], "authorLink": "https://www.youtube.com/channel/UCm3IFcQ139HaWvvYksTaP4Q", "description": "Previous Seasons Highlights + Season 5 Sneak Peek\n\nSEASON 5 PREMIERE : May 3rd @ 10pm with an episode on Monday's and on Tuesday's + CBS officialy announced canceling the show\n\n*** NEW *** Person of Interest - Season 5 Sneak Peek (New York Comic Con) :: "}