{"title": "POI S3E20 Death Benefit, p4 [Shaw]", "url": "https://www.youtube.com/watch?v=4e8T6BXBq7g", "image": "https://i.ytimg.com/vi/4e8T6BXBq7g/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "9727", "datePublished": "2016-07-15", "likes": "76", "dislikes": "4", "comment": ["Love this whole scene where John tells Finch that they have to kill McCourt. Who sings this track? Love how it goes with this'd scene. Miss this show so much. Tuesdays are not the same", "I totally agree Tuesdays are not the same! POI was a great show! Shaw, Reese, Root , Harold. and Fuscoe were great characters! MISS THEM!!", "that scene with Shaw Reese and Harold was VERY GOOD!", "İf there is 100000 billion like button ı would like to hit..."], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Shaw is shot while Team Machine gets away from the authorities.\nShaw and Reese lose Harold.\n\nEpisode summary:\nThe new number is Congressman Roger McCourt (John Heard), a self-described dealmaker; the team is initially baffled, since he has no enemies and there seems to be no danger to his life at all. They eventually discover a connection to Decima: McCourt admits agreeing to help Decima with favorable legislation in the Congress (granting Decima access to government surveillance feeds), while Decima gives him insider stock trading tips. Reese concludes that they are meant to be the danger, as the Machine wants them to kill McCourt in order to prevent Decima killing many more people. Harold is disturbed at this conclusion, and leaves the team, not wishing to participate in an assassination. McCourt is secretly left alive, and proceeds with Decima's plan. Greer also approaches a reluctant Senator Garrison, offering him a 24-hour beta test of their machine. Garrison agrees, and Greer immediately uses Samaritan to start to track down Finch. Meanwhile, Root is travelling across the country, dealing with various relevant threats.\n\nApril 15, 2014"}