{"title": "American Horror Story 10 Double Feature - Resumen y Opinión Capítulo 1 y 2", "url": "https://www.youtube.com/watch?v=4VfI5Od4aHo", "image": "https://i.ytimg.com/vi/4VfI5Od4aHo/hqdefault.jpg", "author": "Master Movies", "viewCount": "59456", "datePublished": "2021-08-27", "likes": "3,326", "dislikes": "26", "comment": ["No se porque hay gente diciendo que esta horrible pero a mi me gusto mucho estos capítulos 💚", "Definitivamente estos 2 primeros capítulos fueron INCREÍBLES por fin he sentido el aura de ahs volver de cierta manera. La cinematografía tétrica definitivamente me recordó a Asylum. La calidad del guión se siente fresca y renovada y conocemos a los personajes de a fondo y nos hacen interesarnos por ellos. Yo creo que si todo sale bien esta podría ser una de las mejores temporadas en la historia de AHS. El cast, que puedo decir? Ver una buena mezcla del cast viejo y nuevo teniendo buenos roles sobre todo Finn y Lily que desde hace mucho no tenían roles protagónicos en la serie sus actuaciones están mejor que nunca. Pero DIOS, todos en general dan lo mejor de sí mismo. Respecto a la 2da parte, esperemos que los papeles de Kaia Gerber y esos otros muchachos solo sea en el primer capítulo de la 2da parte donde sean abducidos o asesinados por los aliens en plena carretera y luego viajemos al pasado hasta los 60's que seria en blanco y negro lo cual es un toque interesante valga decir. Hasta el momento, estoy más que encantada con esta primera parte.", "Hasta ahora los personajes de Sarah y  Macaulay son mi favoritos, y los gritos de Lily Rabe me dan cien años de vida.", "Despues de 2 años sin AHS esta temporada se ve muy prometedora 💗.", "Alguien mas sintió las vibras de \"El Resplandor\"?.Ese pueblito costero es de lo más tetrico,me encanta!Se ve muy prometedora la temporada."], "authorLink": "https://www.youtube.com/channel/UCRXtj0U0TmkZNHUOd9HvvyA", "description": "Suscribete para no perderte nada de mi contenido!\nContacto: mastermovies95@hotmail.com\nInstagram: https://www.instagram.com/mastermovie..."}