{"title": "POI S3E12 Aletheia, p3 [Shaw, Root]", "url": "https://www.youtube.com/watch?v=55T7JWMtNzw", "image": "https://i.ytimg.com/vi/55T7JWMtNzw/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "50920", "datePublished": "2016-07-07", "likes": "312", "dislikes": "6", "comment": ["Morse code starts at 4:33\n\n. . .   - - -   . - .   . - .   - . - -", "roots my favourite character, but i laughed at how she was screaming 😂😂😂", "this scene with her and Root is similar to the torture scene in Casino Royale where Le Chiffre tortures Bond while he's naked.", "Those police sure have a fast response time.", "1:50 poor root..."], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Shaw devises an escape route for Finch.\nControl continues to torture Root and gives her a stapedectomy. :(\n\nEpisode summary:\nThis continues from the previous episode where Harold, Shaw and Arthur are held captive by Control for information. Shaw is deemed to be not useful and is about to be killed, when Root comes guns blazing and gets them out of there. But Root is shot and captured by Control. Meanwhile it is revealed that Arthur had made a copy of Samaritan before it was destroyed. He stored it in a bank locker. But as they go to get it, Vigilance comes and Harold locks himself, Arthur and the bank manager in the vault. Shaw gets a bomb ready to get everyone out. Inside the vault Harold reveals to Arthur that The Machine exists and convinces him to destroy Samaritan so that it will not fall into wrong hands. Vigilance breaks through the vault and captures everyone including Shaw, but they are saved by Reese and Lionel. The Machine guides Root to escape from Control after having been tortured. She is later shown in a South East Asian restaurant. Root also calls Harold to tell him that the Samaritan drives are not destroyed because the bank manager had been murdered and replaced, and the impostor had swapped the drives. Later, the impostor is shown handing over the drives to Greer from Decima Technologies, who in turn shoots her through the heart to cover his tracks. The episode ends with Greer saying that he has great plans for Samaritan.\n\nJanuary 7, 2014"}