{"title": "THE WRETCHED Ending + Monster Explained!", "url": "https://www.youtube.com/watch?v=5F8ngoG5WjA", "image": "https://i.ytimg.com/vi/5F8ngoG5WjA/maxresdefault.jpg", "author": "Think Story", "viewCount": "187424", "datePublished": "2020-05-01", "likes": "5,095", "dislikes": "105", "comment": ["Okay, I get all this (Great video by the way) but how the hell did they explain all the dead people left behind afterwards with nobody to blame for their deaths? Maybe I'm just missing something but I can't find it, lol.", "His mother also tells him over the telephone she can't wait to see her boys", "The officer shot himself because he was trying to resist the spell but couldn’t so he shot himself. If I was a police officer and realized what I was doing to the kid I would’ve done the same thing, honestly that was the most honourable death in the movie.", "I always found monsters who can affect memory extra terrifying, and effective from a narrative perspective. Unlike other monster types it has a built in reason why people don't notice all the missing people. More over makes it easy to have a built in satisfying mystery sub plot which leads to the hero figuring out how to fight back. Affecting some ones memory feels like a profound personal violation which makes the monster fell like a major threat, but not so great that victory is unachievable. To add to the fear factor, if the hero is the only one who knows of the monster than that can have a sense of social isolation adding to the discomfort and threat caused by the monster. Add on the other power which is useful in stealth/mystery of shape shifting, and a sprinkle of body horror and we've got our self's a pretty fantastic horror monster if i do say so myself.", "It's far from flawless, but compared to some of the other horror movies of 2020 (The Turning, The Grudge, Fantasy Island, Brahms: The Boy II) it was a freaking masterpiece."], "authorLink": "https://www.youtube.com/channel/UC34Qdd5Z5KN30A8aJ2eIMPA", "description": "In this ending explained we take a look at THE WRETCHED, it's twist, and the monster!\n\nFollow me on twitter: http://twitter.com/thinkstoryYT"}