{"title": "Person of Interest - Option selected", "url": "https://www.youtube.com/watch?v=5IrYD6WT9Tg", "image": "https://i.ytimg.com/vi/5IrYD6WT9Tg/hqdefault.jpg", "author": "Acorbyse", "viewCount": "59526", "datePublished": "2015-02-19", "likes": "235", "dislikes": "10", "comment": ["SPOLIERS WARNING.\n\n I LITERALLY LOSED MY SHIT THE FIRST TIME I SAW FINCH(FAKE) DEATH. AND BOOM IT WAS JUST A STIMULATION. MOST EPIC THING I EVER SAW!!!!!!!!!!!", "The best part of the episode was when Shaw showed up and their chance of survival shot up rapidly\nI love Shaw", "This was the best episode of one of the best series I have ever watched on tv.", "No comments?!!!!!!It's taking me this long to find this myself. I started to watching Person of Interest back when Nixflix had it. Then I got hooked. This one scene is very important. Shaw is missing at this point. Everyone in the team has a purpuse. Shaw is a Doctor. Yes all of them know first ad. Shaw knows the hard core of the body. If Fusco don't think that something isn't strange, John \"said\" what dose the machine have to say? Fusco says who she talking to? That is a red flag. Poor Fusco all these years not knowing who was behind, what he was fighting for. They are always saying we walk in the dark, just amagine your walking in the dark with a three year holding the flash light. The flash light is the team. Just follow the light. Fusco is important too, he is a law officer. He is the only one who can arrest anyone and make it stick. The machine is fighting for her life too, and the worlds. the stock market goes down in the US, every one goes down. Smairetain would love that. One thing I am wondering is!! There was a few injures. Will John be the first one down and out of the team? Just a thought.    Chirp", "The best episode & the best scene."], "authorLink": "https://www.youtube.com/channel/UCGHFxWRvzM-oBVh93LujiFQ", "description": "Option selected from the machine for stabilizate the market.\nPerson Of Interest - If then else (04x11)"}