{"title": "SEASON FINALE E O QUE ACHEI DE CULT // American Horror Story Brasil Vlog 55", "url": "https://www.youtube.com/watch?v=5mx8gy1TTSI", "image": "https://i.ytimg.com/vi/5mx8gy1TTSI/hqdefault.jpg", "author": "American Horror Story Brasil", "viewCount": "13811", "datePublished": "2017-11-16", "likes": "1,385", "dislikes": "36", "comment": ["Meteu o louco falando da Ally. Ela sofreu pra cacete, foi perseguida, teve seu filho tirado de si, sua esposa a traiu, foi internada e o cacete. E foi mostrado que nessa internação ela se preparou pra se vingar, e aí que ta a surpresa, você ver ela voltando badass e chutando o culto todo. Parece até que você (e muitos outros aí) cochilaram m alguns eps.", "Exatamente,CULT deveria ter no mínimo uns 16 episódios para dar uma história mais elaborada e não esse desespero para encerar a temporada e atropelamento das personagens!", "Eu não achei a história da Ally confusa, ela começa com as fobias afloradas e tudo mais, depois de ser traida pela esposa e ser internada num hospício, ela tirou forças do útero para superar e dar a volta por cima. E obviamente deu a entender que ela nunca foi 'santa', que ela voltou pra se vingar de todos, sentiu o poder nas mãos, matou a esposa, até pq todo mundo a subestimava. Acho que só quem passa por um trauma enorme na vida sabe o que é dar a volta por cima, mas no caso dela ela optou por um lado mais obscuro. Mas achei sensacional a evolução da Ally e em contrapartida a decadência do Kai tbm foi evidente. Ao modo que a subestimada crescia, o superestimado caia. Sensacional, Cult já tem lugar garantido no meu coração! Que temporada !!!", "Acho que o \"Oz\" estava no mundo invertido,só pode,kkkkkk...", "O que faltou nessa temporada foi verossimilhança, tudo mudava tão rápido que não dava para acreditar e ficar preso na história."], "authorLink": "https://www.youtube.com/channel/UC3csl_yNKV--YULIQOL13rA", "description": "Link do vídeo com os produtos da loja: https://www.youtube.com/watch?v=mq8Q0...\n\nLINK DA LOJA: https://goo.gl/1JUEMS"}