{"title": "POI S5E11 Synecdoche, p1 [Root, TM! Root]", "url": "https://www.youtube.com/watch?v=5OmIToXBBMk", "image": "https://i.ytimg.com/vi/5OmIToXBBMk/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "66433", "datePublished": "2016-07-03", "likes": "369", "dislikes": "13", "comment": ["This right here echoes with what Root told Harold over and over again, that the Machine not only cares and loves them, but that they cannot even fathom its understandings of emotions.", "Heartbreaking to hear Root's voice.", "I love this video so much. Thank you for sharing it!", "watching someone you love die 12,483 times, and being powerless to save them. When we do conceive of and enact such wonders as the Machine,We will be sentencing them to experience emotions on a level we will never understand. Grief, love, anger, all in a billionth of a second. What comforts will we be able to provide such beings I wonder?", "Love that The Machine assumed Root's voice..."], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "John and Fusco visit Root's grave.\nTM!Root and Harold discuss Root.\n\nEpisode summary:\nReese, Shaw and Fusco travel to Washington, D.C. to protect their newest number, The President of the United States, which the Machine classifies this threat as extremely relevant—in terms of national security—but Shaw is worried about the implications behind Samaritan's neglecting to intervene. The threat becomes neutralized, but an inner-governmental privacy-activist group with a mole in the U.S.S.S. has turned the full force of the Secret Service on Reese and Shaw. The Machine has secretly enlisted Logan Pierce, Joey Durban and Harper Rose to secure a clever exit strategy, with each of whom camouflaging into various resourceful associations; when Reese and Fusco are extracted, they band together with Logan, Joey and Harper to discuss their enlistment by the Machine, what has happened and what is to come. Harold, meanwhile, is grieving over the loss of Root, and reaches a conclusion that brings him to a highly-secured government facility in San Antonio, Texas with a weaponized virus capable of destroying Samaritan but with significant collateral damage. Harold has become ready to go to any lengths, and Reese and Shaw prepare for their final battle.\n\nJune 7, 2016"}