{"title": "American Horror Story Brasil Vlog 23 // \"Be Our Guest\" (Season Finale) e O Que Eu Achei de Hotel", "url": "https://www.youtube.com/watch?v=63T1HSio7q8", "image": "https://i.ytimg.com/vi/63T1HSio7q8/maxresdefault.jpg", "author": "American Horror Story Brasil", "viewCount": "12708", "datePublished": "2016-01-17", "likes": "847", "dislikes": "19", "comment": ["Ache interessante também eles terem evitado o décimo terceiro episódio , assim como vários hotéis do mundo evitam o décimo terceiro andar.", "Condessa começou a temporada criando vampiros e terminou criando fantasmas.", "Eu achei HOTEL em si uma temporada muito boa. Só detectei uns erros técnicos, mas ok.\nGaga eu achei a performance dela boa, no começo achei ela bem estática, não mostrava desenvoltura no papel, eis que vem o 05x07 e ela da um show de interpretação, e foi melhorando cada vez mais.\nQuanto as histórias, achei todas bem desenvolvidas e fechadas, o problema que vocês acharam de uns ep's terem sido arrastados, acho que foi por conta que Ryan ano passado estava em vários projetos, e na hora de criar deve ter se perdido em meio a tanta informação.", "Eu gostei AHS Hotel. Na verdade comecei a assistir AHS depois da divulgação da 5 temporada, assisti todas até chegar na 5 e o motivo principal foi a Lady Gaga. Eu amo assistir séries e me viciei em AHS. Talvez por já ser fã de Lady Gaga, eu fiquei muito ligada nessa temporada, de forma mais detalhada, além de ter virado fã de alguns atores como Evan Petters ao longo da série. Eu particularmente achei a atuação dela maravilhosa, me supreendeu!! Não acho que ela teve pouco espaço para se desenvolver no papel. A condessa foi uma personagem bem marcante. A temporada teve seus pontos negativos sim, mas eu gostei. Pra mim a pior temporada foi freak show.", "cara, essa apologia das redes sociais foi genial!"], "authorLink": "https://www.youtube.com/channel/UC3csl_yNKV--YULIQOL13rA", "description": "Mais uma temporada chegou ao fim. Venha saber tudo o que rolou no Season Finale e o que eu achei de Hotel!\n\nPágina do Facebook: "}