{"title": "POI S5E01 B.S.O.D., p4 [Root]", "url": "https://www.youtube.com/watch?v=6kdoG76DPBE", "image": "https://i.ytimg.com/vi/6kdoG76DPBE/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "10931", "datePublished": "2016-06-21", "likes": "62", "dislikes": "0", "comment": ["Amazing how two people who admittedly know nothing about computers can talk about them with such authority; a sterling testament to their abilities as actors.", "Literal chills when that flashing line appears and the violin's bass drops", "Incredible that John had to save the machine while the two computer nerds just stand there aghast and seemingly helpless/paralyzed; they should have been prepared for what happened. Supposedly they are two very capable people, particularly when it comes to computers, but perhaps they've become a bit too dependent on the machine for direction? ", "Sooooo two of the most sound mind of computer, hacking, electronics and etc. etc went completely frozen by shock and the muscle of the team saved the day.  Kind of made sense actually."], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root, Reese, & Finch power up the Machine.\n\nEpisode summary:\nThe episode begins with an apparent epilogue to the series: the voice of Root saying, \"It's over\" and questioning whether \"we\" won or lost. In the aftermath of Samaritan's attack known as \"The Correction,\" Fusco is faced with an inquiry from Internal Affairs and the FBI, who believe he shot Dominic and Elias. After Reese, who is carrying the briefcase containing the Machine, fights off a team of Samaritan operatives, he reunites with Finch. They return to the subway hideout, where Harold tries to repair the damage done to the piezoelectric battery charging the briefcase. To his surprise, it starts decompressing on its own, resulting in a fire. Harold realizes he needs a substantially greater amount of super-computing power in order to successfully decompress the Machine. Flashbacks to 2006 show Harold apprehensive about the Machine's ever-expanding capabilities, leading him to the decision to erase the Machine's memories every night at midnight. However, after an exchange with the Machine about the nature of death, he changes his mind too late to save the Machine's memories. Once Root escapes Samaritan's operatives, she seeks refuge in the hideout of one of her former hacker/assassin associates. She realizes that he has been turned by Samaritan, but is joined by Reese to battle a team of Samaritan operatives. They steal 300 PlayStation 3s, which can be used to create enough storage for the Machine. Reese and Root bring them back to the subway and Harold downloads the Machine, while Reese keeps the systems from overheating with liquid nitrogen. When Finch asks the Machine, \"Can you see me?\", after a few seconds go by, it responds by opening an empty command prompt followed by a long string of code showing its reboot.\n\nMay 3, 2016\n\n+44"}