{"title": "American Horror Story Weekly Wednesday Live Stream", "url": "https://www.youtube.com/watch?v=6UeqSCYMxrE", "image": "https://i.ytimg.com/vi/6UeqSCYMxrE/hqdefault.jpg", "author": "MaryGirl Moody", "viewCount": "657", "datePublished": "2018-06-27", "likes": "61", "dislikes": "3", "comment": ["OMG I'm SOOOO excited for Season 9.  I really hope they get to film at the Murder House.  Also I hope Jessica Lange is IN at least ONE episode, or even 5 🙏 😁HAHAHA.  Also, I'd Love to have 12-13 episodes like back in the Golden Age of AHS also.  However, I'd rather have 10 long 70 min full quality packed episodes, then 43 min episodes full of filler and fluff likes some seasons were at times.", "I'm in New Orleans this week with my friend and his family. If they film, I'll try to let you know.", "Welcome xxx is back for theorys for the next season", "The crazy part about Delphine that it was real", "I really want season 8 to explain all of the supernatural explanations of all the seasons, especially Murder House and Coven. The season could be about occultist and or skeptics who try to figure out the various supernatural secrets in the world: Witches, Ghosts, etc. The season could follow a group of journalists and or Investigators who are on a mission to uncover supernatural cases through our American history, in American Horror Story's case: Murder House and Coven. And maybe they come across a new horror story that will follow Joan Collins, Evan Peters, Sarah Paulson's, etc new characters. So how does Murder House and Coven connect, well they also investigate The Montgomery Manor and Miss Robicheauxs Academy. The season could have a Scooby Doo, X-Files feel to it that could put the investigators into the horror stories, as they interweave the supernatural investigations and discover that each story is a piece of a puzzle to a much bigger American Horror Story."], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r...\n\nWelcome to American Horror Story Weekly Wednesday Live Stream! Host is MaryGirl Moody. \n\nJoin the Freaks of AHS on Facebook: "}