{"title": "Good Omens - Episode 5 -  \"The Doomsday Option\" - Reaction", "url": "https://www.youtube.com/watch?v=79m6ArTvTWM", "image": "https://i.ytimg.com/vi/79m6ArTvTWM/maxresdefault.jpg", "author": "My Name Is Simon", "viewCount": "5419", "datePublished": "2019-08-10", "likes": "215", "dislikes": "3", "comment": ["In the book Aziraphale \"channel hops\" for a bit when he tries to find his way back to London. I think the implication is that Demons can possess people against their will and Angels can only take over someone's body if they are channelled. In the book Aziraphale ends up stopping by a shaman who tries to channel spirits from the past and a TV preacher. I think as long as he is technically \"invited\" he can take over someone's body without falling or going against his nature. Of course so far Madame Tracy usually has played up the seances and all and, to be fair, she seems to be a bit of a fraud. In the book the lady who comes to the seance does so on the regular and so far, her deceased husband has only had to report nice things which shows that it wasn't really him because the one time he actually got to talk to her after dying was just to tell her to shut up, something he wished he had done while still alive. So while Madame Tracy usually just does a whole smoke and mirror show and pretends to channel spirits, she apparently is still sort of a medium and when she started the seance it opened a door for Aziraphale to pass through. Not necessarily something she expected but you gotta hand it to her, she takes it in stride.", "I love the music Death gets in his Biker form, this episode is just full of Rock-based flexing, from Death all the way to Crowley riding a flaming inferno to We Will Rock You and Bohemian Rhapsody\nJust Bliss", "\"Pointing guns at kids... The most American thing ever\" lmaoooo\n\n\ngreat reaction as always btw!", "I'm reading the book at the moment and I will admit that the book explains Dog a bit better - parts of it are from the hell hound's point of view, so you can understand much better why he is behaving the way he is. Can't really be helped in a visual format, I suppose. You can't show a dog's thoughts as easily on TV. I do love the modernisation and slight changes the show has done though. Experiencing the book after watching the show really highlights just how ", "A Good Omens video with a cute fluffy animal and an R2D2 mug?  Throw in a sonic screwdriver and a Scoops Troop reference, and I think this might just become reactor perfection!"], "authorLink": "https://www.youtube.com/channel/UCKmVt74gcZtqtbMzMxJrEug", "description": "Let me know what you thought of the reaction in the comments! \n\nI'd like to give a huge thanks to my Patreon Super Supporters:\n\nFrank Tremel \nTheLoneDetective\nKaren Abel\n\nWatch the full, uncut reaction by supporting me through Patreon - "}