{"title": "David Tennant & Michael Sheen surprise Good Omens Guests", "url": "https://www.youtube.com/watch?v=7hqBUVHcdCo", "image": "https://i.ytimg.com/vi/7hqBUVHcdCo/maxresdefault.jpg", "author": "HeyUGuys", "viewCount": "14989", "datePublished": "2019-05-29", "likes": "1,094", "dislikes": "1", "comment": ["After reading about the escape room I had only one thing to wonder...\n\nWhy must I live across the world?!", "The way Michael offers biscuits is totally Aziraphale❤", "\"Madness, mayhem, and things that will be good for your soul\". Oh yes, Neil, the show was quite that!", "So cool! I think I'd have a heart attack if I saw those two!", "The one dislike is from someone who’s incredibly jealous (aren’t we all?!)"], "authorLink": "https://www.youtube.com/channel/UC2jXtsIZXdy6uAjEg1zyMYg", "description": "Ahead of the new Neil Gaiman/Terry Pratchett Amazon Prime TV show Good Omens, David Tennant & Michael Sheen surprised some of their guests to the Good Omens experience in London and from the looks of it, had a lot of fun doing it! \n\nAhead of the much-anticipated premiere of Amazon Original series Good Omens, which will launch on Prime Video on 31st May, the adventurers had been given the chance to preview an escape room which is part of a five-floor immersive exhibition in Soho dedicated to the show and based on the antique bookshop of angel Aziraphale (played by Sheen).\n\nSheen was joined by co-star Tennant (who plays demon Crowley) and writer/showrunner Neil Gaiman in surprising the unsuspecting fans who had solved a series of cryptic Good Omens clues and challenges to unlock a reward room behind a secret bookcase.\n\nThe Good Omens experience and exhibition opens to the public this week, with an extra day added due to public demand. Taking over a Victorian town house in the heart of Soho, the event will immerse fans in the weird and wonderful world of Good Omens. Adapted from the fan favourite 1990 novel by Neil Gaiman and Terry Pratchett, the six-part series is an hilarious story of the world hurtling towards the apocalypse, with only the unlikely duo of an angel and a demon to stop it.\n\nThe experience will be open and free to enter from Friday 31st May until Sunday 2nd June, from 11am each day.\n\n Fans can pre-book the escape room, whilst the remainder of the exhibition is free to enter, with additional escape room slots allocated to walk-ins.\n\nThe exhibition and experience opens on 19 Greek Street, coinciding with all episodes becoming available to stream on Amazon Prime Video on Friday 31st May. Additional tickets to the escape room on Friday 31st May, which lasts 30 minutes, will be released at 7pm on Wednesday 29th May through EventBrite: "}