{"title": "🗣 #AQUARIUS 1 LOOKING BACK😱THE 2ND MAKING U AN OFFER🤐 OMG! #SEPTEMBER 1-30, 2021 #TAROT READING.", "url": "https://www.youtube.com/watch?v=7M-Twk0oufE", "image": "https://i.ytimg.com/vi/7M-Twk0oufE/hqdefault.jpg", "author": "Chrissy The Crystal Indigo", "viewCount": "29", "datePublished": "2021-09-01", "likes": "2", "dislikes": "0", "comment": [], "authorLink": "https://www.youtube.com/channel/UC2AJ6iPzod-7JhR1Ucn3KvQ", "description": "Book a Private Reading At Chrissy.thecrystalindigo@gmail.com Each video is recorded and posted to my youtube channel so that only YOU can view it. I will send you the link to the video as soon as payment is processed (CashApp) or (PayPal)\n\nEnergy Exchange Donations: (CashApp) $ChristinaKizer (PayPal) Chrissy0627@gmail.com \n\nShop: 🔮📿\n\nwww.etsy.com/shop/ChrissyCrystalindigo \n\nwww.chrissythecrystalindigo.com\n\nWish list: Apple: Magic Mouse2 in Black (space grey)  (not silver)❤️ \n\nAMAZON WISH LIST: www.amazon.com/hz/wishlist/ls/2VQ4QKV8QMT2F?ref_=wl_share\n\n\nTarot Services: \nRelationship Love Reading($30.00): A video which includes: The person of interest and who they TRULY are, their intentions towards you/ how they see you, and the likely outcome. (Are they a Karmic/ Soulmate/ Twin flame connection?). \n\nPredictive Love Reading($40.00): A video which includes: Who is your forever soulmate/ perfect match/ life partner? What are they like? Where will you meet them and when? Have you already met them? How do they see you?\n\nCareer Reading($25.00): A video which includes: Your current career path and if its the RIGHT path, How you can make more money, and a general financial outcome based on your current path. This may also include work relationships and how they are affecting your career. \n\nTwinflame Reading (45.00) A video which includes: the energy around the connection and the best way to move forward a Twinflame connection is not like a regular relationship it is a Divine Connection ‼️ \n\nAkashic Records Reading: See website \nPast Life Regression: See website \n\n\n\n\n*I also offer Reiki, Energy Healing, Hands on healing and Crystal healing please email me for more info."}