{"title": "Person of Interest | We need a purpose", "url": "https://www.youtube.com/watch?v=7xeBala4e2c", "image": "https://i.ytimg.com/vi/7xeBala4e2c/maxresdefault.jpg", "author": "Real Scorsese", "viewCount": "64196", "datePublished": "2017-06-21", "likes": "1,304", "dislikes": "14", "comment": ["How could I not see this before? Omg this is for sure the best POI vid ever made. Everything you did is amazing. All the songs you chose are perfect and the way you matched them with the quotes were the most beautiful thing I have ever seen. Congrats for this beautiful work, it is very good to see people who enjoyed this show. You made me cry a lot with that sequence 4:11. This vid just became not just one of my favorites vids from POI but also one of my favorites of all time. And thank you! You just gave me a lot of inspiration to finish my POI vids!!!", "The most underrated TV show ever. R.I.P my dear POI :(", "This was brilliantly done! You captured the core of the show. Reese's smile at the end always gets me.", "Loved your video. While the ending was really sad, it fit with John's personality and how much Finch connected him back with the world. A warriors death for a true warrior and protector.", "Just awesome. It just brings the memories back and tears to my eyes. I really loved the show."], "authorLink": "https://www.youtube.com/channel/UCi8K1-uC3NazkioWBnDk_5w", "description": "If the video shows unavailable on your smartphone, try it from a computer.\n\nThe latest video in tribute to Person of Interest is online. \n\nI'm just trying to do something amazing and fun to each video, thanks a lot to all of you for these moments of crazy !\n\n**\"Copyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"**"}