{"title": "Person of Interest || HEROES", "url": "https://www.youtube.com/watch?v=80vZAZyuaMA", "image": "https://i.ytimg.com/vi/80vZAZyuaMA/maxresdefault.jpg", "author": "Real Scorsese", "viewCount": "8312", "datePublished": "2018-11-08", "likes": "285", "dislikes": "3", "comment": ["I love, love, love this video and will share it everywhere I can. I also love that there are still fans out there creating wonderful Person Of Interest content like this video more than 2 years after POI ended. Thank you so much for creating this.", "Well done!  Well done!  I totally agree that POI was the best ever and John & Harold will always be near & dear to my heart.  Thank you so much for this beautiful video.  But please, don't make it your last!  POI lives on among old fans & new ones!", "One great tribute for this show man, you did the show justice with this beautiful video! So many parallels of their actions in the show here. I love how you made us understand that by not answering the phone calls at the end, he says goodbye to it all, like you with this show. Great video my friend!! :D", "That was awesome. I'm thrilled. Love this show. And this video once again proves that this show is grandiose", "I saw Michael liked it on Twitter. You should be proud of this video"], "authorLink": "https://www.youtube.com/channel/UCi8K1-uC3NazkioWBnDk_5w", "description": "#POIFans #PersonOfInterest #PersonofInterest #JimCaviezel #MichaelEmerson \n\nSong:\n\nZayde Wolf - HEROES\nPerson Of Interest Soundtrack - The Kills - Future Starts Slow\n\nIf the video shows unavailable on your smartphone, try it from a computer.\n\nHere is my final project. I hope you enjoy the montage which I put all my heart\n\nI wanted to pay a last tribute to the series Person of Interest, but also to finish on the legendary duo John and Harold, who for me are the best characters in the series! I would very much like you to share it with fans of the show, anywhere on social media to support me. I count on you ! And also, why not share it with the actors of the series? It would be huge! Thank you all for having followed me on the montages that I realized, I will never forget you. Believe me ! You are the best community of fans !\n\n**\"Copyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"**"}