{"title": "POI S5E08 Reassortment, p1 [Shaw, Root]", "url": "https://www.youtube.com/watch?v=9_2EI3qHaAc", "image": "https://i.ytimg.com/vi/9_2EI3qHaAc/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "44513", "datePublished": "2016-07-01", "likes": "209", "dislikes": "4", "comment": ["I love how even that Samaritan agent smirked proudly like \"well, i'll be damned... this is pretty impressive\" bc sameen's plan WAS impressive. After everything she managed to plan all that and execute everything perfectly!", "Shaw has planned her escape so long, digging the hole....", "It's a SHAME  POI is CANCELLED!!  MISS shaw and root!", "Shaw n root are perfect.", "Bom dia gostaria de ver a serei toda pra entender a origem do filme com legendas em português"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Shaw busts out.\nRoot and Harold disagree about The Machine, but also work a number.\n\nEpisode summary:\nReese and Finch become trapped in a hospital manipulated electronically by Samaritan to have initiated an outbreak of what it said to be a combination of H5N1 (avian flu) and live human flu virus—a synthesized, super-powered strain of the flu—and recruit Jeff Blackwell who is integral to their plan. This lethal virus is determined to be a re-assortment of chromosomes so sophisticated that Samaritan created it in one of five-trillion possible combinations. It appeared as though the epidemic was overkill to eliminate three targets in the hospital, but a more ominous plot was afoot. Although, since the Machine is an open system, with its help, Root was able to use its abilities to find and track a cure, saving the lives of two doctors and Fusco. Shaw executes her escape plan and finds herself in a jail in Johannesburg, South Africa. While escaping, Shaw is approached by Jeremy Lambert who taunts her by claiming that she is actually in another simulation; she shoots him, takes his keys and is last seen driving in Lambert's vehicle at night at a high rate of speed, presumably to an airport. After consulting with Elias to confirm his suspicions regarding what he knows has endangered his life but does not yet know to be Samaritan; its existence, and its war with The Machine, Fusco reaches the point where he can no longer tolerate being kept in the dark and indefinitely chooses to distance himself from the team. Jeff Blackwell and his handler, Mona, discuss the quelled epidemic and declare it a success: The CDC is requiring everyone to take a vaccine, which will result in Samaritan learning everyone's DNA.\n\nMay 24, 2016"}