{"title": "FIT4PRIVACY Podcast🎙️with Mona Caroline (Episode 41) -  Conflict of Interest and GDPR", "url": "https://www.youtube.com/watch?v=9De6Lsjn-So", "image": "https://i.ytimg.com/vi/9De6Lsjn-So/maxresdefault.jpg", "author": "fit4privacy", "viewCount": "3", "datePublished": "2021-08-24", "likes": "0", "dislikes": "0", "comment": [], "authorLink": "https://www.youtube.com/channel/UCOSMNsi4W8Vcy_12ADI_S-g", "description": "In this episode of the FIT4PRIVACY Podcast, Punit is joined by Mona Caroline for a conversation about the Conflict of Interest. This is a sensitive topic and it is often challenging to identify when a conflict of interest arises. So, the conversation is focussed on what is conflict of interest, how can it be identified, what are the challenges and how does it impact the DPO role.\nKEY CONVERSATION POINTS\nGDPR in One Word is ‘Humanity’.\nImportance Of  Conflict of Interest In Context Of GDPR\nHow Can Companies Identify Conflict Of Interest?\n What Are The Challenges In Identifying Conflict of Interest Situations?\nAs DPO, How to Identify Conflict Of Interest?\n\nABOUT THE GUEST\nMona Caroline is an international attorney advising businesses and governments worldwide through GOVER & LAW, the firm she founded, dedicated to “Integrity. Good Governance. Better Law”.\nMona is an expert in Anti-corruption, Competition/Antitrust, Human Rights, Data Protection, Good Governance and International Cooperation. She is a recognised pioneer of Compliance & Ethics by Design serving businesses, governments and innovation.\nMona further leads the Whistleblowing Center and is a founder and host of the IntegriTea Podcast. Mona brings together expertise and experience acquired in the public and private sectors since she shared her earlier at the OECD as a Policy Expert (Paris), at Unilever as Legal & Integrity Director for Europe (London), at international law firms Cleary Gottlieb (Brussels) and Wachtell Lipton (New York) as an attorney. Mona is a certified D.P.O. and a Board Member of the Altius Society at Oxford. She was awarded ‘30 Competition Women in their 30s’. \nIn academia, Mona is the co-founder of La Sorbonne Compliance and of the Masterclass in Digital Human Rights.She is a regular guest speaker around the world on innovation and regulation (e.g. Paris, Brussels, Tokyo, New York, Seoul, Sao Paulo).\nMona holds law degrees as a Fulbright scholar from Columbia University, and summa cum laude from Louvainand Ghent Law Schools. She is a member of the bar in Brussels and New York.\nABOUT THE HOST\nPunit Bhatia is one of the leading privacy experts who has worked with professionals in over 30 countries. Punit works with business and privacy leaders to create an organization culture with high privacy awareness and compliance as a business priority. Selectively, Punit is open to mentor and coach privacy professionals.\nPunit is the author of books “Be Ready for GDPR” which was rated as the best GDPR Book, “AI & Privacy – How To Find Balance”, “Intro To GDPR”, and “Be an Effective DPO”. Punit is a global speaker who has spoken at over 30 global events. Punit is the creator and host of the FIT4PRIVACY Podcast. This podcast has been featured amongst top GDPR and privacy podcasts.\nAs a person, Punit is an avid thinker and believes in thinking, believing, and acting in line with one’s value to have joy in life. He has developed the philosophy named ‘ABC for joy of life’ which passionately shares. Roger Federer is his favourite player. Punit is based out of Belgium, the heart of Europe. \nRESOURCES\nWebsites: www.fit4privacy.com, www.punitbhatia.com\nCONNECT\nInstagram "}