{"title": "What is the Most Common Objection to Christianity?", "url": "https://www.youtube.com/watch?v=9oCSTZOUWKg", "image": "https://i.ytimg.com/vi/9oCSTZOUWKg/maxresdefault.jpg", "author": "Cold-Case Christianity with J. Warner Wallace", "viewCount": "2603", "datePublished": "2021-08-30", "likes": "213", "dislikes": "7", "comment": ["I have to admit this makes me want a little more info on making the moral argument case from the standpoint of race etc...and yes we do have time to look into these things more. It always made me mad when he would say it, but my pastor use to say \"people do what they want to do\" . We often have a problem with our priorities.", "Simple answer - when man fell (and man was placed as a god over this world) everything in nature around him also descended into the fallen state. In other words, evil (including natural disasters etc) took up residence in all of God’s physical creation. This is why scripture says all creation groans in travail waiting for the manifestation of the sons of God. God’s agenda on earth had to be put on hold so the Saviour Yeshua could come and fix things for us. You say, okay so He died on the cross and fixed things why is evil still in place. Yes He fixed things but how many believe in Him to this day. This is the reason why Christians (though they experience ‘evil’ every now and then but for reasons beyond our ability to grasp) in the main believe themselves exempt from the worst that befalls those who have no faith in Christ. Pretty much like what happened in Goshen in Egypt when that land was excluded from the plagues and was not affected by the famine. Take my life for instance, I was prone to a bi-weekly attack of malaria before I accepted Christ - now I no longer have that. I was also a severe asthmatic and even without praying to be free from it asthma disappeared after I accepted Christ. I also used to experience sucubus attacks while asleep, or what I hear some call sleep paralysis. BOOM 💥!!! Now all gone. Mehn, I can’t help but implore those who haven’t tasted what I have to please waste not one hour longer. Jesus is real and if we are His, He is able to cover us under the shadow of His wings even to hide us in the safety of His tabernacle until every indignation is passed.", "My biggest objection is the notion that an all knowing, all loving, all powerful God intentionally created a universe knowing the end result would be the vast majority of his creation suffering infinite torture for ever, and ever, and ever...", "2 Corinthians 4:17, Romans 8:18", "God is responsible for everything that exists, but God is not responsible for everything that happends."], "authorLink": "https://www.youtube.com/channel/UCVFe7xhG6rl0ruoMQCJDtnw", "description": "For more information, read Person of Interest: Why Jesus Still Matters in a World that Rejects the Bible (https://amzn.to/3nDriN2) \n\nRead: Nine Steps to Presenting the Case for Christianity"}