{"title": "The Return of Misty Day Theory Video", "url": "https://www.youtube.com/watch?v=_7k7AyhxdXc", "image": "https://i.ytimg.com/vi/_7k7AyhxdXc/maxresdefault.jpg", "author": "MaryGirl Moody", "viewCount": "7161", "datePublished": "2018-08-15", "likes": "234", "dislikes": "10", "comment": ["Well she’s stuck in hell. Maybe during the apocalypse the gates of hell get opened and dead souls are able to walk freely. Something along those lines is very possible I think.", "FUN FACT PEOPLE MISSED ABOUT MISTY: Misty didn't just have the power of resurgence, he actually also had energy transference (Vitalum Vitalis). Throughout the series, we see her bringing people back from the dead with very little ease, even madison who had been dead for days (weeks?) she was able to call her soul back into the mortal coil. But when Fiona asked her to bring back Joan (or the neighbor lady), something very unusual happened. She fainted after ressurecting her. Notice that even Fiona Goode, the strongest of them all gets exhausted after performing the vitalum Vitalis, almost to the point of fainting, because that manner of resurgence is to transfer one's all life force into another person. Resurgence however, is simply kind of calling to a person's soul and leading them back to their body. So, when Misty fainted, I found it so odd, especially considering she resurrected Madison who'd been dead for weeks and was already rotted, whereas the neighbor lady had just died. And we also see Fiona roll her eyes as soon as she faints, like \"Oh, great, she performed one of the seven wonders so that's another one I have to keep my eye on for a possible kill\". I think Fiona was also trying to test her in that scene to see if it was Vitalum Vitalis or really the gift of Ressurgence that misty had, to know if she was a threat to her throne. And that eye roll. LMAO!", "Flashbacks. Also the bible talks about (essentially) the gates of hell being open for the apocalypse, which means stuck souls could be released, including Murder House ghosts considering according to Billie Dean the force that kept them all there wanted a body, and finally got one in the form of Michael...hence the return of MH cast.  Or the less popular and tired cliche but still plausible, the 2nd half of coven until now (AHS8) is one giant vision Cordelia has and she has to stop it all, i.e. Madison dying and Queenie staying at the hotel. Quantum Coven Leap lol", "Ugh she's so precious. Lily Rabe does this character so much justice. I fangirl so hard I lack the words. But Misty Day is 100% dream girl.", "I would love to see Cordelia and misty reunited :(((("], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r...\n\nImages by Danny Vera. Link to his channel: www.youtube.com/channel/UC-3a9HVa7Mba..."}