{"title": "AHS Apocalypse Episode 1 Review", "url": "https://www.youtube.com/watch?v=_hgzCP4_PCE", "image": "https://i.ytimg.com/vi/_hgzCP4_PCE/hqdefault.jpg", "author": "MaryGirl Moody", "viewCount": "24833", "datePublished": "2018-09-13", "likes": "669", "dislikes": "39", "comment": ["The \"no unauthorized copulation\" might be to avoid pregnancy. I mean, the house can't really offer the medical equipment necessary for a healthy pregnancy. They also don't have the extra food necessary to sustain a pregnant woman...... Or a baby/ toddler. Plus the pregnancy itself could kill the mother, and they can't really risk the lives of people considering that there are only a handful of people left in the world (that we know of). That's just an idea. That random rule might have also just been made up to mess with the survivors.", "I loved the episode .I think it's going to be a GOOD season! Joan Collins was hilarious", "Heres my extremely long AHS apocalypse Fan theory: we wont see much, if any of the coven in the First half of the season and it will take place in the near future and will detail the end of the world at the hands of the Antichrist Michael Langdon,  at the end of episode 5 we learn it's a premonition being had by Cordelia in the present. She gathers the rest of the Coven, resurrecting a few old members. And heads to LA, she buys the Murder House as she can sense that it is the epicenter of the Apocalypse. We see the death of Constance Langdon either by the hands of Michael or his followers. The Coven frantically works to try and kill the Antichrist before he can rise to power. But being that he's biologically half ghost their magic doesn't work on him and they take loses (bye again Madison and Myrtle), but they learn that Michael draws his powers from the trapped souls of the Murder House, so they cast a spell that allows all the trapped ones to finally be released. But while the Coven is clearing house Cordelia has another vision that we don't see, she sees the only being that can kill Micheal, his half brothers Jeffery Harmon who he killed in womb. So using the same type of spell that brought The Axeman back to life in Coven, they resurrect Jeffery in a full grown body (probably played by Evan Peters) and the brothers do battle, Michael and his Satanist followers vs Jeffery and the Coven. ", "Do you think Emily could be Lee's lost daughter, also named Emily from Roanoke? She was never said to truly be dead, and the times would match up for her to be about 17.", "Neither of them (Stu)had any radiation.They lied,it was a game they played.They couldn't serve Stu as dinner if he was contaminated."], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r...\n\nImages by Danny Vera. Link to his channel: www.youtube.com/channel/UC-3a9HVa7Mba..."}