{"title": "Black Mirror: Rachel, Jack and Ashley Too Ending Explained & Easter Eggs! Season 5 Episode 3", "url": "https://www.youtube.com/watch?v=_uoJN9_lcFk", "image": "https://i.ytimg.com/vi/_uoJN9_lcFk/maxresdefault.jpg", "author": "Think Story", "viewCount": "882502", "datePublished": "2019-06-05", "likes": "14,014", "dislikes": "520", "comment": ["Who wants Hannah Montana Explained? 😂😂", "Although this episode didn’t feel like a Black Mirror episode, I still thought it was kinda crazy how it relates to Miley’s relationship to Disney, like that’s what I liked about it lol", "Ashley: Jumps up out of coma\nRachel: Omg I'm such a huge fan", "OK but does anyone realize that this episode specifically calls out DISNEY and their exploitation of young performers?? In the end it all came together: when Ashley and the girls ride in to expose Asley's aunt (=Disney) with the MOUSE car that has MOUSE CONTROL written on it and then stepping out of the car, Asley throws her the middle finger (which was by the way one of Cyrus's signature moves after she broke away from Disney). And then they really hammered it home once again when Cyrus is performing 'Head like a hole' about her \"shitty aunt\" and when she sings \"head like a hole; black as your soul; I'd rather die than give you control\" they cut to the girls' father talking about a mouse and waving his mouse control device. Very gutsy episode, I even remember creator Charlie Brooker saying that Cyrus gave personal details about her life and that the episode is going to piss people off. Well done! Why is nobody talking about this?", "Something pretty terrifying to note is Miley Cyrus herself was hospitalised in 2014 for an “allergic reaction” the same time she was going through major depression. She even liked a fan post on instagram comparing the two."], "authorLink": "https://www.youtube.com/channel/UC34Qdd5Z5KN30A8aJ2eIMPA", "description": "Black Mirror is back with Season 5 Episode 3 \"Rachel, Jack and Ashley Too. In this video we'll be breaking down and analyzing the ending as well as its many easter eggs.\n\nEaster Egg Timestamp: "}