{"title": "POI S3E18 Allegiance, p5 [Shaw, Root]", "url": "https://www.youtube.com/watch?v=_X-Rm4gfT-0", "image": "https://i.ytimg.com/vi/_X-Rm4gfT-0/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "25951", "datePublished": "2016-07-11", "likes": "151", "dislikes": "4", "comment": ["Nowruz ❤️❤️❤️"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Shaw fires smoke bombs into a building.\nRoot borrows Bear.\n\nEpisode summary:\nThe team receives the number of Maria Martinez (Nazneen Contractor), an engineer working for the international energy company HydralCorp. They follow her and learn that she is working to clear the name of Omar Risha (Haaz Sleiman), a man from Iraq suspected of being a terrorist. Shaw, Fusco and Reese save Maria from an assassination attempt and learn from her that Omar was her translator in Iraq and saved her from a terrorist ambush during the shipment of six generators; the generators went missing and Omar learned about their disappearance, being targeted for it. Finch meets with Omar and learns that the generators were shipped elsewhere and that HydralCorp's corrupt CEO Ken Davis (Casey Biggs) is responsible. Maria and Shaw, meanwhile, discover that Davis has created a false report of Omar's terrorist accusations, and that French United Nations diplomat Rene Lapointe (Michel Gill) has the papers approving Omar's asylum in the US in his office. Maria escapes from Shaw and goes to get them, putting herself in danger. Finch sends Reese, Fusco and Omar (who Reese rescued from deportation) to break into the UN building and save Maria. They stop Greek diplomat Christos Sevon (William Abadie) from killing Maria and reunite with Omar. The episode periodically shows Root's new mission of following Decima head Greer; she takes Bear with her to spy on him, where it is revealed that Davis had the generators shipped to the US so Greer can power Samaritan; Greer has Davis killed and leaves, and Root follows him, using Bear's sense of smell to evade Greer's counter-surveillance tactics. Greer waits for her at an empty subway corridor and talks with her about his motives, offering her a position on his team. Greer's men appear and point their guns at her. Greer calls the meeting a draw and leaves, allowing her to do so as well.\n\nMarch 25, 2014"}