{"title": "Behind The Scenes American Horror Story Moments That Change Everything", "url": "https://www.youtube.com/watch?v=a8Nvnq0ZctQ", "image": "https://i.ytimg.com/vi/a8Nvnq0ZctQ/maxresdefault.jpg", "author": "Looper", "viewCount": "28791", "datePublished": "2020-12-08", "likes": "675", "dislikes": "23", "comment": ["What's your favorite season of American Horror Story?", "Cool Fact: Naomi Grossman had a hard time to get on set when she was in her character makeup and costume, they thought she wasn’t part of the show and almost got kicked out", "I really wish AHS was never ending. The content is so fresh and definitely binge worthy. Every season 1-9 has me and my wife hooked. I really enjoy what they did with 1984. Made me want to go back and experience the 80’s.. I’m a 90’s baby so I didn’t get the privilege. I wish I could be a part of this amazing show", "Apparently the the first season of AHS's Murder House was in an episode of Buffy! Pretty interesting, and a very fun Halloween episode.", "This is 🤯🤯🤯"], "authorLink": "https://www.youtube.com/channel/UCP1iRaFlS5EYjJBryFV9JPw", "description": "Thumbnail Image by Fractured FX → http://www.fracturedfx.com/\n\nAmerican Horror Story is probably the most terrifying, unsettling, brutally violent, and bloody show on TV. Here are some photos snapped on the sets of the various seasons that should make for a nice, calming visual salve after viewing even the most disturbing episodes.\n\nCinematic Satan-worshippers may be all about bringing the reign of pure evil to Earth, but they also enjoy a certain level of fanciness. In American Horror Story: Apocalypse, the wicked leaders of Outpost 3 hold a handful of survivors essentially captive, but still make sure they dress in nice clothes, drink out of nice goblets, and enjoy the occasional celebratory banquet or high-end party. It's just nice to be fancy, even after the end of the world.\n\nLeslie Grossman, along with other members of the Apocalypse cast, had apparently spent a few too many hours filming one of these party sequences. With costars Joan Collins and Evan Peters looking on in amusement, Grossman got so punch drunk and silly that she and her blonde fright wig took a faceplant on the fine china.\n\nDenis O'Hare disappears into his roles. He's clearly one of those actors who does everything he can to learn everything about a character, both inside and out. He's played many memorable parts in several American Horror Story iterations, including severely burned philanderer Larry Harvey in Murder House, mute witch school servant Spalding in Coven, and on Hotel, a transgender hotel clerk with a heartbreaking backstory named Liz Taylor. Having lived as a Kansas salesman who secretly wore women's clothing on business trips, a visit to the Hotel Cortez and a meeting with Elizabeth inspired Liz to be true to herself and take a stint working at the haunted hotel.\n\nNot only did O'Hare have to dig deep to find the motivations and executions for his complex character, he had to prepare his body, too. He endured extensive makeup to get that bald head and heavily made-up look, as well as regular facial hair trim sessions. Here he is preparing for a shooting day. \n\nObviously, recurring American Horror Story cast member and frequent Emmy nominee Sarah Paulson doesn't have two heads in real life which means the effects wizards behind American Horror Story: Freak Show had their work cut out for them. In order for Paulson to play Bette and Dot Tattler, two heads with unique personalities who shared a body, it required a lot of special effects, digital manipulation, and time.\n\nFirst, the crew took a mold of Paulson's real head and used it to build a prosthetic head that bears a striking resemblance to the actress. The head was then positioned differently, depending on if Paulson was filming her lines as Bette or Dot. Scenes took as long as 15 hours to shoot, and then the footage went to the computers to make the idea of a double Sarah Paulson seem visually convincing.\n\nOne of the most memorable and striking characters in American Horror Story will always be Pepper, who appears in both the Asylum and Freak Show seasons, first as an institutionalized patient and then as a performer in an unsettling traveling sideshow. There's been no shortage of stunning transformations among the AHS cast, but Naomi Grossman is almost completely unrecognizable when she's not in her Pepper guise. That's because becoming the character involves an elaborate physical transformation that was well-documented. \n\nIn addition to three hours in a makeup chair for every day she was needed on set, Grossman's preparation required fake teeth, a single contact lens that both distorted her vision and altered the appearance of her eye, as well as a unique hairdo. For that, Grossman had to shave off most of her hair which was step one in her precise and perfect Pepper preparations. "}