{"title": "American horror story coven - madison's monologue/ madison saves cordelia", "url": "https://www.youtube.com/watch?v=ABiRpMyH95w", "image": "https://i.ytimg.com/vi/ABiRpMyH95w/hqdefault.jpg", "author": "ONCEUPON a HORRORSTORY", "viewCount": "102311", "datePublished": "2016-10-09", "likes": "1,273", "dislikes": "4", "comment": ["She feels hollow and loneliness.", "«I am a millennial. Generation Y; born between the birth of AIDS and 9/11, give or take. They call us the global generation. We are known for our entitlement and narcissism. Some say it's because we're the first generation where every kid gets a trophy just for showing up. Others think it's because social media allows us to post when we fart or have a sandwich for all the world to see. But it seems our one defining trait is a numbness to the world. An indifference to suffering. I know I did anything I could to not feel; sex, drugs, booze. Just take away the pain. Take away my mother and my asshole father and the press and all the boys I loved who wouldn't love me back. Hell, I was gang raped and two days later I was back in class like nothing had ever happened. I mean, that must have hurt like hell, right? Most people never get over stuff like that and I was like, \"Let's go get Jamba juice!\" I would give everything I have or will ever have just to feel pain again; to hurt. Thank God for Fiona and her herb garden. One advantage of being kind of dead is that you don't have to sweat warning labels. There was this one brown liquid that I thought made my nipples tingle for a second but I think it was psychosematic because I polished off the rest of it and didn't feel shit. I tried every eye of nute and wing of fly until I found something that made me not look like Marilyn Manson anymore. And that's the rub of all this, isn't it? I can't feel shit. I can't feel anything. We think that pain is the worst feeling. It isn't. How could anything be worse than this eternal silence inside of me. I use to not eat for days or eat like crazy then stick my fingers down my throat. Now no matter how much I binge I can't fill this hole inside me. I can't take it anymore. I think I'm going batshit. I need to do something»", "This is why all those kicks and Blows misty give did nothing to her.", "I relate to this monologue too well.", "Oooooohhh, Macison did something good 😍😍😍"], "authorLink": "https://www.youtube.com/channel/UCGIQHvkZPzrna7UHtmlgoXw", "description": "American horror story coven - madison's monologue \n3x7 The Dead"}