{"title": "Beyond the Horror: 1984 Episode 1", "url": "https://www.youtube.com/watch?v=AJ1ZQBBty9s", "image": "https://i.ytimg.com/vi/AJ1ZQBBty9s/hqdefault.jpg", "author": "MaryGirl Moody", "viewCount": "3428", "datePublished": "2019-09-19", "likes": "145", "dislikes": "5", "comment": ["Oh my goodness I had so much fun pointing out all of the nods to slasher films. My friends don’t think this season will have any supernatural components, but I think there will be near the end of the season. 80s slasher films started off very grounded to me then in the sequels they started getting more creative and including supernatural elements so I’m excited to see if they do that.", "I just looked it up. The gas station guy is Don Swayze, Patrick Swayze’s older brother.", "When Margaret said something about the light that had something to do with Jesus, I'm kinda feeling maybe it's an Ailen reference? Idk I'm kinda wanting a revisit from ailens in a future season. Lol.", "Great video everyone had great insight on this episode. Somethings they said I didn't put together in tell they said it. Love it", "I think at least to me it was obvious Mr.Jingles didn't take off the hiker's ear. The hours from his escape don't make sense timeline wise and I do agree that he could have gone back to stop the murders since he did have the clippings hidden away about the opening again of the camp and Leslie's character very well could be involved but that feels almost too obvious in my opinion. I half wonder if maybe she wasn't confused about who did it and wrongly blamed the wrong person...that or they want to make obvious she is behind it all. As for Brooke there was an engagement ring and I think two other rings in her box as well as maybe bracelets or necklaces one and she does seem off...maybe too goody goody for my liking though if she is set up to final girl that could make sense. I was actually surprised how much I liked this episode when I didn't think I would."], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": ""}