{"title": "Chilling Adventures of Sabrina: A MidWinter's Tale Explained!", "url": "https://www.youtube.com/watch?v=Ajl1E21BwXc", "image": "https://i.ytimg.com/vi/Ajl1E21BwXc/maxresdefault.jpg", "author": "Think Story", "viewCount": "159658", "datePublished": "2018-12-14", "likes": "3,258", "dislikes": "123", "comment": ["\"Kryla comes in and apparently has spent the last thousand years applying eyeshadow\"  : )", "I don't think Diana ghost was Diana after the initial seance.     Most likely it was Wardwell.\n\nShe did in effect tell Sabrina to not get back together with Harvey.    And she did in effect tell Sabrina that the whole \"not safe\" thing was in effect just being worried she had no one to take care of her.    Now that she knows better she can move on.    No need to ever try to contact her again.    Pretty much right in line with Wardwell's desires.    And to top it off right after the final Diana scene they cut to Wardwell looking pretty much self-satisfied.   ( Also when did the human Diana learn how to cast spells? )", "I just wanna say from an artist standpoint... if someone ever gave me enchanted pencil crayons that the tips never wear..id be in love. lol", "Do the Putnams know the Spellmans are witches? In that convo between Hilda and Susies dad she slips in a “Pray to Satan...” and he doesn’t seem to flinch. It makes sense since their family has a long history of protecting the witches in Greendale.", "Am I the only one who thinks Miss Wardwell may have been using magic to appear as Sabrina's mother after the seance had occurred? I think she was eerily quiet during Yuletide after her monologue, where as she's normally more hands on or at least able to make sure the job of Sabrina's mother not spilling secrets was successful. During the seance, her mother said \"not safe\" before disappearing. Maybe I'm crazy. Either way, great review as always!"], "authorLink": "https://www.youtube.com/channel/UC34Qdd5Z5KN30A8aJ2eIMPA", "description": "Christmas has come early with a special holiday episode of Chilling Adventures of Sabrina! Join me as we breakdown this episode and discover the clues it may offer for part 2!\n\nFollow me on twitter: www.twitter.com/ThinkStoryYT\n\nHelp me translate this video: "}