{"title": "American Horror Story Season 10 Episode 3 Thirst Synopsis and Review", "url": "https://www.youtube.com/watch?v=Am1t1S2Bv6w", "image": "https://i.ytimg.com/vi/Am1t1S2Bv6w/hqdefault.jpg", "author": "MaryGirl Moody", "viewCount": "1816", "datePublished": "2021-09-02", "likes": "159", "dislikes": "5", "comment": ["I personally wouldn't take the pill because i think that to be a true artist you must love and feel every piece of your art, even the struggle when you don't have an inspiration, in order to aprecciate and trully be satisfied with work that you've done. So I think that taking the pill that throws a bunch of information in your head and basically dictates you what to write (plus makes you a vampire), takes that pleasure away from you. The inspiration must be felt and must come from within.", "AHS reminding me that there is nothing more evil than little girls. Ursula handling Mickey's half hearted murder attempt like it happens all the time, what a champ.", "Leslie Grossman is slaying this season!  And omg, that scene from Dennis O’Hare 😂❤️", "I have to give this a 9/10. This was the best one yet, because it really made me uncomfortable. That uncomfortable feeling is the true feeling of horror to me. I just think it’s weird that Doris was more worried about whatever disease Alma might have caught, instead of the fact that she found her eating an animal. Plus, the whole Harry attacking her cut finger. It doesn’t even phase her. I thought those things were really weird. I don’t think Doris took the pill… yet. Idk. This really brought back the creep factor to AHS. I’m really into this season, and learning about things we all have questions about? Like the gray’s teeth, clothes, the red lights, etc, as you mentioned. I would not take the pill. I know I have artistic talent, but I’m good with not being the best. I don’t think it would be worth it. I hope you’re having a good night, and I’m always excited to see your recap/reviews because I think we share similar opinions about each episode.", "What if the Chemist secret ingredient is from the Blood Virus of Hotel. Like when Scarlet injected her blood to save that little boy and therefore created all those horrible vampirish children, however maybe her pill is also infused with other ingredients that have horrible side effects. I remember the Countess saying something about not feeding on addicts."], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r...\n\nJoin the Freaks of AHS on Facebook: https://www.facebook.com/groups/TheFr..."}