{"title": "The Most Controversial AHS Moments", "url": "https://www.youtube.com/watch?v=anX7IH6RDn0", "image": "https://i.ytimg.com/vi/anX7IH6RDn0/maxresdefault.jpg", "author": "Looper", "viewCount": "265723", "datePublished": "2019-09-16", "likes": "3,540", "dislikes": "306", "comment": ["Which episodes were just too much for you?", "People triggered over a shooting on TV. Meanwhile, nothing is done to stop shooting in real life.", "The show is literally about playing on Peoples’s fears, so a school shooting scene isn’t controversial.", "It’s MEANT to be disturbing, wtf. It’s both psychological and physical horror, don’t like it, don’t watch.", "\"Because our children are watching\" yeah let your children watch AMH thats great"], "authorLink": "https://www.youtube.com/channel/UCP1iRaFlS5EYjJBryFV9JPw", "description": "American Horror Story has never shied away from tackling controversial topics. The hit FX show will do whatever it takes it torment, terrorize, and tantalize you, and needless to say, things get extreme. Here are some of the most controversial American Horror Story moments of all time.\n\nSeason one of American Horror Story is full of twisted violence that's become the show's stock in trade ... but there's one moment that's always stood out as particularly shocking. \n\nIn the episode \"Piggy Piggy,\" we see Tate Langdon — played by Evan Peters — carrying out a school shooting and gunning down 15 of his fellow students. \n\nThe on-screen massacre gave many viewers flashbacks to the horrific tragedy at Columbine High School in 1999. After the episode aired, The Atlantic's Richard Lawson wrote, \n\n\"It's more than a little tasteless in a 'Hey, this, y'know, actually happened' kind of way. Obviously everything on the show, if done in real life, is insanely terrible [...] but this particular set piece seemed so deliberately exact. There was a particular event, or events, that they were trying to directly evoke and that's just cruel.\" \n\nSet in the 1960s, the second season of American Horror Story takes us to the fictional mental health facility Briarcliff Manor, and one of its patients really outraged some viewers.\n\nMurder House's school shooting | "}