{"title": "Clearing the Rumor About Kimmee/Kimcella Cheating on Ice Poseidon With Me AND ALL OTHER RUMORS", "url": "https://www.youtube.com/watch?v=AOH5yDOk_qg", "image": "https://i.ytimg.com/vi/AOH5yDOk_qg/maxresdefault.jpg", "author": "calmsurble", "viewCount": "691", "datePublished": "2021-09-01", "likes": "23", "dislikes": "19", "comment": ["Here is THe CLips stamps and unedited audio of the clips https://youtu.be/m4M_r6kOvtU :\n1:09:04 I had this clip but I'm sure Tina and sykunno said \"Comms\". The audio played straight through sounds like my username. I think its like a 20 percent chance they actually said something.\n1:11:45 The Esfandtv Austin Qt cinderella run in while working This is the most creepy. The chances of this happening is literally1,000,000 to 1 but it happened", "Your song you can't keep me waiting is fire it needs to be played on radios.", "I heard that Butler guy knocked up Kim while she was with Ice & Ice made her give up the kid...sad.", "you're either delusional, doing a bit, or don't know when someone is pulling your leg.", "And also for the people who are in the genreal audience. yes. of course. you didn't think this. becuase you didn't see what happened offstream. this is why i made this video becuase a actual false rumor spread through to the livestreamers on twitch. so im stopping it now."], "authorLink": "https://www.youtube.com/channel/UCYZtLG3rgifepCOkY_SxrQg", "description": "*DISCLAIMER*- ( TO BE CLEAR this is a inside thing with some of the livestreamers on twitch. this happened off stream.)\nI am tired of whatever false rumor is circulating about me on Twitch from these livestreamers who know nothing about this situation involving Kimmee/Kimcella and Ice Poseidon. I am adressing literally EVERYTHING that happened during the butler stream. AND EVERYTHING afterwards that i have heard about me and I have clips of a few streamers talking about me very directly after I considered myself NOT to be a person of interest apparently I was wrong. \nTLDR, Someone misunderstood why I was alone with Ice poseidon's girlfriend. She was dumb as a rock to not consider automatic lights the garage as so was I. I didn't expect her to go to where i was sitting in the garage. They definitley took that situation and ran with it. \nAnd there are other things that i need to address with some situations that happened while i was working uber with esfandtv, qt cinderella, and the austin show.\nand then there is a clip with imjasmine that proved that there was a rumor going around about me. \n\ni dont know what else to add here I literally need to get back to working uber.\nObviously this was harming my reputation, so I needed to get this over with; settle it; and get back to work. I hope I get to finish all my projects by the end of the year."}