{"title": "POI S1E13 Root Cause [Root]", "url": "https://www.youtube.com/watch?v=aw67xWCHxqE", "image": "https://i.ytimg.com/vi/aw67xWCHxqE/hqdefault.jpg", "author": "Root & Shaw", "viewCount": "29380", "datePublished": "2016-06-21", "likes": "202", "dislikes": "2", "comment": ["That small clip of the machine @0.53 analysing the hack like a god shows how far above the machine is over regular computers. Amazing clip.", "You can always tell its root because of her nail polish", "makes me wanna sit in a hotel room with command prompt and a voice changer pretending to be a hacker", "This “Root” wasn’t played by Amy Acker; she didn’t first make her appearance on poi until ~halfway through season 1, as Caroline Turing", "Thank you so much for these clips!  :D"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Introduction of the character Root.\n\nEpisode Synopsis:\nReese and Finch are alerted to Scott Powell (Myk Watford), a dedicated family man and city construction project manager, who was laid off in the face of budget cuts advocated by Congressman Michael Delancey (Victor Slezak). They find that he has secretly applied for a weapon permit and is sending death threats to Delancey; they conclude that Powell is planning to assassinate the Congressman. However, as Reese tries to intercept Powell, Finch realizes that the evidence against him has been planted, and they are unable to stop the real assassin from killing Delancey. Powell is arrested by the FBI in the face of overwhelming evidence, forcing Reese to help him escape. With the help of Zoe Morgan (last seen in \"The Fix\"), Finch identifies Peter Matheson (Damian Young), Delancey's business partner and chief of staff, as the man who hired the assassin and a hacker to kill Delancey and frame Powell, thereby covering up Matheson's corruption. Finch acquires a recording of a conversation between Matheson and the hacker, exonerating Powell. After Matheson is found dead, the hacker, identifying herself as \"Root\", admits to Finch that she had him killed to tie up loose ends. Root acknowledges Finch, by name, as a worthy adversary.\n\nFebruary 2, 2012\n\n+57"}