{"title": "POI S5E10 The Day the World Went Away, p5 [Root, TM!Root, Root x Shaw]", "url": "https://www.youtube.com/watch?v=b5i_HZyoGak", "image": "https://i.ytimg.com/vi/b5i_HZyoGak/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "117495", "datePublished": "2016-07-02", "likes": "717", "dislikes": "19", "comment": ["When you realize Finch always had God mode and Admin access...", "It’s hard not to cry when the machine takes Root’s voice. The reminder that we’ll never hear from her again is stinging.", "Harold: Root?\nMachine: No Harold, I chose a voice.\nMe: Tears begin", "The acting was phenomenal! Root protecting Harold; Harold having a moment of hope then it gets ripped away, because The Machine chose a voice; Shaw going heartless, because the woman of her life died; Fusco holding back tears, and Reese being worried about Finch. It's all amazing, and I still shed a tear. This show is truly magnificent", "I think the look on Finch's face when he heard Root's voice and had his hope come down crashing just a second later, was the penultimate crack in the carefully controlled demeanor that Finch created and managed over the years. That was the point when he realized how much he cared for Root and that her loss would mean a large hole in his heart, a wound that would never heal, no matter how terrifying he became in his rampage for vengeance. "], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root dies.\nThe Machine decides to use Root's voice.\n\nEpisode summary: \nFinch's number comes up when his cover identity is compromised, due to a subconscious error, and Samaritan initiates a continuous dispatch of operatives on him. The team splits up in their escape, which results in Elias being killed by Samaritan agents while protecting Finch. The team rescues Finch from his potential capture, and Root explains in the car her current understanding of herself and everyone else to be \"information\" that can never truly disappear despite their deaths. Root is shot by Samaritan operative Jeff Blackwell and placed in critical condition, while the police apprehend Finch who is accused of treason. A devastated Finch provides a soliloquy on how he has chosen to abandon the principles he has long followed, and vows to kill Samaritan. The Machine calls Finch in the precinct, having taken on the voice of Root, who had died from her injuries. The Machine sets every criminal in the precinct free to allow Finch to escape; Reese and Shaw realize that Finch's number came up not because he was a victim, but rather a perpetrator against Samaritan.\n\nMay 31, 2016"}