{"title": "Top 9 Best SAW Characters #8 | SAW-Tober 2020", "url": "https://www.youtube.com/watch?v=BltmkPzkAjk", "image": "https://i.ytimg.com/vi/BltmkPzkAjk/maxresdefault.jpg", "author": "Reel Talk", "viewCount": "738", "datePublished": "2020-10-24", "likes": "61", "dislikes": "0", "comment": ["Detective Mathews my FAVORITE character!!! I loved his will to save his son NO MATTER WHAT!", "Love Eric matthews! I wish the original saw 4 script happened, Matthews deserved better than his role in Saw 4.", "Awesome video! Eric Matthews is such a charismatic and well acted character. He’s a dirty cop, but just trying to do whatever it takes to find his son which any parent would do.", "As for Eric Matthews, he was indeed a figure worthy of praise since he was drawn into John's games. The circumstances of the murder that he investigated gave him little to think, and when the stake was his son's survival, he immediately worried about his fate, in the end it was his son.Eric He was a good candidate for a player: the wife wants a divorce and the son goes out of a bandit. John took advantage of this, as if at the beginning his negotiations with Eric went according to his plan, but until and then Eric could not stand when people with whom his son was dying on the computer screens. John gave up and I ended the game. Eric was outsmarted and imprisoned by an amanda and in this legendary place with a chain leg but he had the willpower and managed to get out of it amazing. In the end, he was reused by John for his game in the fourth installment. was the hoffman dragging Eric to that cell and feeding him? Eric Matthews was definitely a very corrupt detective, he put everything on one card, his character will never be forgotten.", "love this content, even if it doesn't have that many reviews"], "authorLink": "https://www.youtube.com/channel/UC4GPRqEoZ4zpnTHIxcG5JyQ", "description": "Top 9 Best SAW Characters #8 | SAW-Tober 2020\n\nEric Matthews is the first main protagonist of the series. The one that not only helped shape the structure of the series, but also the three main antagonists. Let's discuss!\n\nJigsawRules:"}