{"title": "POI S3E15 Last Call, p2 [Shaw]", "url": "https://www.youtube.com/watch?v=bLuzd5pyHrM", "image": "https://i.ytimg.com/vi/bLuzd5pyHrM/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "37147", "datePublished": "2016-07-10", "likes": "179", "dislikes": "5", "comment": ["I saw this episode on Netflix this morning, Her little speech to Reese during the fight was great.", "When Shaw holds Reese up and then tells him \"There's no dead in team, instead of going Charles Bronson on me , let me clear way.\" That is a BIG statement by shaw, who says it beautifully, and it works! that statement means Shaw is equall to John. We'll acted and well written scene!!", "Shaw is the BEST! POI got better when Shaw was introduced!", "Why would Shaw, my favorite character, compare Finch to the other evil people. That maybe the first line I question Shaw saying to Finch. Still love shaw!", "The one thing that will definitely get you on Shaw's naughty list, is to threaten a kid."], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Shaw and Reese continue looking for \"The Voice\".\nThey also save a child.\n\nEpisode summary:\nWhen the number of Sandra (Melissa Sagemiller), a 911 operator, comes up, Harold goes undercover at the 911 call-center. Later, a child is kidnapped and the call is routed specifically to Sandra. She is ordered to delete an earlier day's 911 call logs, in return for the child's life. Meanwhile, the case overlaps with one of the murder cases with which Fusco was helping a rookie detective. It turns out that a woman was killed by her married ex-boyfriend and boss, and the family hired a cleaner to erase the final 911 call she made. When Fusco 'convinces' the family to terminate the contract, the cleaner decides to kill both the child and Sandra. Reese and Shaw save the child from kidnappers and a bomb, while Harold traps the assassin who comes after Sandra. The team is never able to find the real cleaner, who later calls Finch to threaten him. The criminal becomes known as \"The Voice\".\n\nFebruary 25, 2014"}