{"title": "AHS Actors Who Were Never The Same After Their Roles", "url": "https://www.youtube.com/watch?v=bT4Rgu_D1LE", "image": "https://i.ytimg.com/vi/bT4Rgu_D1LE/maxresdefault.jpg", "author": "Looper", "viewCount": "904726", "datePublished": "2020-01-15", "likes": "16,282", "dislikes": "317", "comment": ["Who was your favorite character on AHS?  Any season.", "I don't like AHS without Evan Peter's! Jessica Lange was a great loss,and Sara Paulson too! Oh,and Kathryn Bates. They are the glue to AHS!!", "it feels like Emma Roberts is still being type casted just as bitchy characters now", "Not even gonna lie lady Gaga acted pretty well", "Evan Peters is this generation’s Leonardo DiCaprio. What a great actor, and hubba hubba"], "authorLink": "https://www.youtube.com/channel/UCP1iRaFlS5EYjJBryFV9JPw", "description": "Watching American Horror Story is scary enough… but how does the cast feel as they bring these stories to life? AHS seems to make a permanent impact on its stars - sometimes for the better, and sometimes for the worse. Here's how the show has changed these actors' lives.\n\nIn the early years, Evan Peters was basically the face of American Horror Story. He started out playing Tate Langdon in the first season, and went on to star in seven more seasons of the creeped-out anthology show.\n\nIt seemed like Peters would always be in the cast  - but that didn't turn out to be the case. In 2019, Peters shocked fans with the announcement that he wouldn't be returning for 1984, the ninth season of AHS. \n\nPrior to Peters' announcement, the actor revealed that AHS was taking a toll on his mental health, telling GQ in 2018: \n\n\"I don't like to yell and scream. I actually hate it. I think it's disgusting and really awful [...]  Horror Story sort of demanded that of me.\"\n\nHe went on to explain:\n\n\"It's just exhausting. It's really mentally draining, and you don't want to go to those places ever in your life. And so you have to go there for the scenes, and it ends up integrating it somehow into your life.\"\n\nJessica Lange began her stint on American Horror Story in season one, portraying Constance Langdon, Tate's malignant mother. The role ushered in a whole new phase of Lange's career, winning her a second Primetime Emmy. She stuck with AHS for three more seasons, eventually returning for Apocalypse to reprise her role as Constance. Honestly, no one plays an intimidating matriarch quite like her.   Keep watching the video to see AHS actors who were never the same after their roles."}