{"title": "Beyond the Horror: Apocalypse Episode 6 Part 1", "url": "https://www.youtube.com/watch?v=BUxiCM6v-ec", "image": "https://i.ytimg.com/vi/BUxiCM6v-ec/maxresdefault.jpg", "author": "MaryGirl Moody", "viewCount": "4794", "datePublished": "2018-10-17", "likes": "147", "dislikes": "6", "comment": ["The tall albino guy shown in the deleted scene is not canon, that's why that scene was cut out. Ryan Murphy confirmed this. So the little girl was the 4th child that was canon. Since the albino kid was never actually in the official show he wasn't canon. And since all the kids had some kind of abnormality, I'm guessing she was born without eyes, which is an actual condition.", "When Moira was reunited with her mother, I teared up ♥️", "My favorite line:  \"I came to the realization I WAS PUT ON THIS EARTH TO RAISE THE MONSTERS\" - Constance/Elsa Mars", "It looks like Cordelia planted the people that ended up being at Outpost 3 .....minus Venable and Mead. I really feel like Cordelia was faking her weakness to get Mikie to get her witches together again. Now that we know Mikies the Anti for sure....I truly think Mallory is an Arch angel. Michael is the only Archangel that fits.....Michael in the Hebrew language means \"Who is like God?\" or \"Who is equal to God?\" Michael has been depicted from earliest Christian times as a commander, who holds in his right hand a spear with which he attacks Lucifer/Satan, and in his left hand a green palm branch. At the top of the spear, there is a linen ribbon with a red cross. The Archangel Michael is especially considered to be the Guardian of the Orthodox Faith and a fighter against heresies. Michael Langdon said he thought he had killed them all.....after he saw Mallory do her thing. There are 7 Archangels....maybe she's the last one. Angels are supposed to be able to inhabit mortal bodies just as demons do.", "I get a kick out of Ben still treating clients (ghosts) when he is one himself lol"], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r...\n\nVIDEO CONTAINS SPOILERS FOR American Horror Story, Season 8, Episode 6!!!\n\nmondaysRmurder channel link: "}