{"title": "I Wish I Could (and Don't) Hate Buffy Season 6", "url": "https://www.youtube.com/watch?v=bynNkPznSQU", "image": "https://i.ytimg.com/vi/bynNkPznSQU/maxresdefault.jpg", "author": "Five by Five Takes", "viewCount": "19451", "datePublished": "2020-05-07", "likes": "1,410", "dislikes": "8", "comment": ["\"Healing isn't always inspirational or poetic. Sometimes it is just forward.\"\n\nYES.", "This is why I hate when people make buffy out to be another angsty teen drama, because it's so much more than that. While the monsters may look terrible and the graphics sometimes even worse, that's never what the show was about. Despite being a world of demons and magic and dark forces, the things the gang faced were real in a way that the characters could grow from because the big bads were all just representations of real problems real people face.", "Season 6 feels the most \"adult\" of the seasons to me in a way. The idea that the world doesn't stop turning just because your life is crashing down around you, and that the only option you have is to move forward despite that speaks to me. I find it hopeful in a way. Yes every horrible thing you can think of happened, but the end is hopeful because they're still here, still fighting, still trying, and that's beautiful to me.", "Most of the season is ugly and unpleasent. That sounds and feels like a bad thing. The main villains on paper kind of suck but it makes sense. Warren was just some dude with a lack of moral compass. But the real villain was human failures and the great burdern of life itself. It feels so wrong because it was done so well.", "Kinda feel the world is in its season 6 right now"], "authorLink": "https://www.youtube.com/channel/UCC2Bw649-AJJWJDX74f85qg", "description": "My complicated and emotional feelings on a complicated and emotional season. \nHuge thank you to the friends who gave me feedback on drafts, and, as always, Fox, for continuing to inspiring me to think and write meaningfully. \n\nYou can't talk about the Season 6 hot mess without talking about Willow Rosenberg, so next on my to-do list is a video deconstructing her arc in Season 6, magic, metaphors, and addiction. Stay tuned.\n\nThank you for letting me share a piece of me. What does Buffy, season 6 or otherwise, mean to you?\n-Sara\n\nYou can watch Buffy on Hulu\nMusic by Epidemic Sound: "}