{"title": "Beyond the Horror: Apocalypse Episode 10", "url": "https://www.youtube.com/watch?v=c75Y5Ehpmuw", "image": "https://i.ytimg.com/vi/c75Y5Ehpmuw/maxresdefault.jpg", "author": "MaryGirl Moody", "viewCount": "1002", "datePublished": "2018-11-29", "likes": "38", "dislikes": "4", "comment": ["In terms of Moira's happy ending, I feel really bad that in technical cannon, she wasn't reunited with her mother, BUT I feel like it matters more that we saw it happen, whether or not it actually happened in the current Apocolyspe storyline. Also, following the Dante's Inferno/ All-of-the-characters-are-in-hell Theory and the emotionally eviscerating nature of AHS, it's not too uncharacteristic to give us this highly emotional reunion then make it so that it never happened. I think they wanted to hurt us, but it came off as sloppy and of poor taste because they were trying to meet certain expectations.", "The thing that floored me the most this season was young venable in that purple suit 😍", "Kenny \"we were supposed to get a lot of things this season.\"\nHaha I live for it!", "I'm not gonna lie a behold and Madison spin off with Queenie popping in would be bomb", "YAAAAS! It's finally here. People keep complaining that Moira didn't escape the house, and Marie didn't escape hell, and Tate+Violet never happened. It suggests at the end through Nan that some things were permanent. I believe Papa would stick to the bargain for Dinah's soul, given that he is aware that time was messed with. I believe they were going for the idea that time can be reversed to a degree, but many supernatural beings exist outside spacetime as we understand it, including some ghosts. Something that occurred to me, in the original timeline only Myrtle and Michael are left since Mallory went back in time. What do you think she did to him after Cordelia died? Best not to think about. This season was very polarized, hitting a high in 4-5-6 and hitting a low at 8-9. Not enough time to tell too much story due to a limited number of episodes. Roanoke had the same issue, I quite liked it for the macabre horror but it didn't have enough time for all the stories they wanted to tell. I wish there was a scene or scenes involving more magical combat. The only instance that really qualifies for this is when Michael fired the nails back at the witches. Cordelia vs Michael in a magic-off would have been neat."], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "LIVE VERSION ALREADY AIRED ON THE MONDAYSRMURDER CHANNEL.\n\n► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r..."}