{"title": "American Horror Story Weekly Wednesday Live Stream #29", "url": "https://www.youtube.com/watch?v=cA0l2sOkbj4", "image": "https://i.ytimg.com/vi/cA0l2sOkbj4/hqdefault.jpg", "author": "MaryGirl Moody", "viewCount": "1097", "datePublished": "2017-07-26", "likes": "85", "dislikes": "1", "comment": ["Mary I love u! Keeping em coming! Will watch no matter what! Best AHS channel!", "I'm late but I wanted to mention that I'm digging the new poster: \"Hive mind\" \n\nI don't go looking for too many spoilers before each season and really enjoy the teaser trailers and like trying to find the symbolism that will come up in the next season", "Mary there are 6 new teasers that came this week, if you go to ahscult.com or ahs7.com you can watch the new teaser thing and then you can click on 6 of the clowns which take you to 6 more teasers, after that you get a pop up on your screen telling you to look at your \"unlocked content\" and if you click on that you can take a look at official costume art for season 7!!!", "There's a lot of new actors and actresses joining the show. Out of all of them I'm excited to see what Billie Lourd & Colton Haynes characters will be like. I'm excited to see what everyone will be doing to be honest. I'm always excited to see new talent on the show in general. I really want Jamie Lee Curtis and Vera Farmiga to join at some point. Also did you see the new IT trailer they released? You should do a reaction video for it just for fun. Keep up the great work Mary glad to see your channel evolving. 👍 Glad to have a channel I can watch that's as big as a fan of AHS like I am. : ) Also the finale of Scream Queens season 2 definitely set it up for a season 3. They could've braught Grace back and everything. Also Emma Roberts despite her reputation and I'm definitely against abuse. I kinda miss her on AHS she's not a bad actress just needs to control her bipolar self lol. Do you think she will return for the crossover season though?", "I've never seen Ash vs Evil Dead. I don't have the channel. Is it on Netflix by any chance? And do you recommend it for a Horror fan?"], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "Welcome to American Horror Story Weekly Wednesday Live Streams! Host is MaryGirl Moody.\n\nPetition Link to MAKE MARY AN AMERICAN HORROR STORY WRITER: "}