{"title": "POI S4E18 Skip, p4 [Root]", "url": "https://www.youtube.com/watch?v=ca_Mqz44QPU", "image": "https://i.ytimg.com/vi/ca_Mqz44QPU/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "23140", "datePublished": "2016-08-16", "likes": "127", "dislikes": "2", "comment": ["I forgot how much I love this show. I've been watching different scenes from the different seasons and came across one near the end of the series. It's interesting to see what these characters would do or wouldn't do for the Machine and/or for each other.", "Harold: \"I don't want to see you for a while.\" \nRoot: nods her head, \"of course.\" \n\nThen in the very next episode they spend a lot of time together, and the one after that, and the one after that, and the one after that.", "I'm really sad how Root is trying to save Harold even with the risk of losing their friendship just to keep him alive. She values Harold too much that she's willing to do anything for him, I wish Harold would do the same with Root.", "Its so emotional! I'm dying!", "\"You being alive is enough\""], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Episode summary:\nThe team splits up and works on separate cases. Reese and Fusco follow a bounty hunter named Frankie Wells (Katheryn Winnick) whose number has come up. She is trying to track down the man (Ato Essandoh) that killed her brother. Harper Rose (\"Blunt\") interjects herself into the cat-and-mouse case and manages to negotiate a resolution to a gunfight standoff between Reese and several other parties. Later, Harper tells Reese that Thornhill (The Machine) has been sending her texts. Finch resumes meeting with Elizabeth Bridges, who is nearly ready to turn over a software package that contains the Trojan Horse which Finch had installed previously. He intends to activate it via a special device. Root, fearing that this will result in Finch being exposed and killed by Samaritan agents, foils the plan, at the cost of Finch and Elizabeth's growing mutual attraction. A doubly devastated Finch tells her to leave the team for a while. Early in the episode, Iris tells Reese she cannot be his therapist anymore, and assigns him to another. They give each other the cold shoulder for the rest of the episode until the end, when they meet in her office and she confesses she has fallen for him, and they kiss passionately.\n\nMarch 24, 2015"}