{"title": "AHS Apocalypse Best Fan Theories", "url": "https://www.youtube.com/watch?v=cEd1v66xLPM", "image": "https://i.ytimg.com/vi/cEd1v66xLPM/maxresdefault.jpg", "author": "MaryGirl Moody", "viewCount": "23428", "datePublished": "2018-09-10", "likes": "411", "dislikes": "23", "comment": ["I heard a theory somewhere that the first 5 episodes will be a vision that Cordelia has and the big plot twist in episode 5 is that the apocalypse hasn’t actually happened but is about to. Cordelia and her coven would then try to stop it by going to the murder house and killing Michael.", "The children from asylum reached adulthood in asylum storyline. Thomas was a prized attorney, Julia was a renowned neuro-surgeon..though I do think they will (or their offspring) may appear.", "I too am interested in ALL the children that have been left over in the end of the seasons\n Every season has them. The babies of murder house, alien babies from asylum. Baby from coven, hidden away after surviving legba, twins of Jimmy Darling. Bartholomew from hotel, little girl and ghost girl from Roanoke and Oz from Cult.", "What if when the apocalypse happens, the gates of hell open, thus reviving Misty, Madison, Myrtle, Tate, and every other spirit/witches", "Fan theory: the First half of the season will take place in the near future and will detail the end of the world at the hands of the Antichrist Michael Langdon,  at the end  of episode 5 we learn it's a premonition being had by Cordelia in the present. She gathers the rest of the Coven, resurrecting a few old members. And heads to LA, she buys the Murder House as she can sense that it is the epicenter of the Apocalypse. We see the death of Constance Langdon either by the hands of Michael or his followers. The Coven frantically works to try and kill the Antichrist before he can rise to power. But being that he's biologically half ghost their magic doesn't work on him and they take loses (bye again Madison and Myrtle), but they learn that Michael draws his powers from the trapped souls of the Murder House, so they cast a spell that allows all the trapped ones to finally be released. But while the Coven is clearing house Cordelia has another vision that we don't see, she sees the only being that can kill Micheal, his half brothers Jeffery Harmon who he killed in womb. So using the same type of spell that brought The Axeman back to life in Coven, they resurrect Jeffery in a full grown body (probably played by Evan Peters) and the brothers do battle, Michael and his Satanist followers vs Jeffery and the Coven. "], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r...\n\nImages by Danny Vera. Link to his channel: www.youtube.com/channel/UC-3a9HVa7Mba..."}