{"title": "WESTWORLD Season 3 Episode 4, Breakdown, Theories, and Details You Missed! Who Is Charlotte Revealed", "url": "https://www.youtube.com/watch?v=cFiOaXUMS_Y", "image": "https://i.ytimg.com/vi/cFiOaXUMS_Y/maxresdefault.jpg", "author": "Think Story", "viewCount": "193283", "datePublished": "2020-04-06", "likes": "4,058", "dislikes": "89", "comment": ["So they really blew their load with this mid-season reveal meaning the final episode will likely have a giant twist! Simulation within a simulation? The identity of Serac? Leave your thoughts in the comments.", "Just putting a thematic two cents in here. Delores split over four or five bodies is the perfect test of programming VS potential for growth. I'm guessing one or more of her copies are going to diverge from her originally intended path over the season. Namely Charlotte, and what could be a blossoming relationship with her new son. There were implications that hosts evolve/ humans stagnate in season 2 (i.e. humans are doomed to play out their programming without growth). This season is the petri dish for that assertion. Between Rehoboam's predictive algorithm and the Man In Black's loop, I hope this season will play with personal destinies and what dictates change and divergence.", "The multiple Dolores reveal threw me on a loop. That was really good! I seriously didn’t see that coming since everyone was thinking that Dolores took out other hosts with her to the outside world. It didn’t really occur to me that she would actually just make copies of her. Anyway, this was a pretty good episode and I love that things are starting to pick up and we’re getting a clearer picture of what’s in store for us in the next episodes.", "I immediately thought of Agent Smith when it was revealed she is EVERYONE.", "One of the Dolores is going to turn on the main one, I think Charlotte Dolores is the one that’s going to turn on the main, shes already questioning herself in the last episode"], "authorLink": "https://www.youtube.com/channel/UC34Qdd5Z5KN30A8aJ2eIMPA", "description": "In this video we breakdown, explain, review, and recap Season 3 Episode 4 \"The Mother of Exiles\" of HBO's Westworld for new theories, easter eggs, and details you missed. We'll also get into who exactly is controlling Charlotte Hale. The new season stars Aaron Paul, Evan Rachel Wood, Ed Harris and Jeffrey Wright.\n\nFollow me on twitter: "}