{"title": "American Horror Story: The Best of Evan Peters", "url": "https://www.youtube.com/watch?v=CQYQ46WA4SA", "image": "https://i.ytimg.com/vi/CQYQ46WA4SA/maxresdefault.jpg", "author": "GameSpot Universe", "viewCount": "340145", "datePublished": "2020-01-24", "likes": "8,298", "dislikes": "72", "comment": ["Which Evan Peters performance on AHS is your favorite?", "the fact that he never got awards for his performance in Cult is absolutely LUDICROUS.", "This dude is a chameleon. I hope he never quits acting.", "That finger gun to his own head, and the camera movements between him and the emotionless swat team while the sirens and his mother screaming were in the background was a MASTERFUL shot.", "even though hotel isn’t the most well liked season, his performance as march will always be my favorite"], "authorLink": "https://www.youtube.com/channel/UCRgUg0jJUgGMadGPzzmu8cw", "description": "Evan Peters has appeared in eight seasons of American Horror Story, playing iconic AHS characters like Tate Langdon, James March, and Kai Anderson. Let's break down each of his roles from Season 1 through Season 8.\n\nPeters is one of three actors to have appeared in eight seasons of AHS. He first appeared in Season 1 as Tate Langdon, one of the ghosts living in Murder House, who is also the son of Constance Langdon. He bonds with Violet, the daughter of the Harmon family, who move into the house. Tate later returns during AHS: Apocalypse (Season 8). In Season 2 - Asylum, Peters played Kit Walker, a man who was abducted by aliens then admitted to Briarcliff Manor. \n\nIn Season 3 - Coven, Peters portrayed Kyle Spencer, a college student who dies in a bus accident and is then resurrected by Madison and Zoe. Peters then played Jimmy Darling aka Lobster Boy in Season 4 - Freak Show. In Season 5 - Hotel, Peters played the charming yet sadistic James Patrick March, the original designer of the Hotel Cortez. \n\nSeason 6 - Roanoke brought us Peters' performance as Rory Monahan, the actor that played Edward Philippe Mott in the documentary \"My Roanoke Nightmare\".  Peters played one of his largest roles in Season 7 - Cult, as cult leader Kai Anderson. And finally in Season 8 - Apocalypse, Peters appeared as four different characters throughout the season - Mr. Gallant, Jeff Pfister, Tate Langdon and James March. \n\nSubscribe to GameSpot Universe! "}