{"title": "THE VAST OF NIGHT Ending Explained!", "url": "https://www.youtube.com/watch?v=CRICiygCxcQ", "image": "https://i.ytimg.com/vi/CRICiygCxcQ/maxresdefault.jpg", "author": "Think Story", "viewCount": "73202", "datePublished": "2020-05-31", "likes": "1,941", "dislikes": "132", "comment": ["The camera work and long shots are fascinating.", "I actually think I have a really cool theory if anyone wants to listen :)\nIn the end we see Fay and Everett holding each other but we don’t see Maddy (the baby), and afterwards we see many ashes on top of the recorder where they were standing. My theory, and hear me out, is that they just wanted the Maddy and incinerated Fay and Everett. The old woman’s kid heard the alien words and walked out to get taken by the “people in the sky”. Maddy was ALSO a kid who had a single mother and was probably very isolated from her tiny town. And the old woman said that was the target. But Maddy wouldn’t have been able to walk out to a spot where they could take her in. So the aliens orchestrated the all of the things that Fay and Everett did to take her in! The babysitter had seen the UFO hover near her house and called Fay to tell her. Fay then took Maddy with Everett and rode with the other couple who told them to get in, to the exact place with they wanted. You can later see that the couple is affected, and “possessed” by the alien words but not Fay and Everett. The “people in the sky” could only take in people who were “possessed” by them, so they wouldn’t want Fay and Everett. So why would they go through this whole process just so Fay and Everett could be burned to ashes? They wanted MADDY!", "Don't know about radio but Fay certainly had a career in field sports. Damn you aliens, robbed her of an Olympic medal.", "I hope they make more movies in the \"Paradox theater\" , or hell, make a whole series based on that concept, Since i feel the new TwiligthZone show was a disapointment, and this would make a better show", "If you remember, Fay said she lives with a single mom. For that woman to lose both of her children mysteriously would be devastating..."], "authorLink": "https://www.youtube.com/channel/UC34Qdd5Z5KN30A8aJ2eIMPA", "description": "In this video we take a deep dive and explain the ending to Amazon's latest sci-fi movie THE VAST OF NIGHT. We'll review, recap, and break down the ending as well as discuss the aliens.\n\nFollow me on twitter: "}