{"title": "MARVEL: Is THOR Forming a New SPACE AVENGERS? | Silver Surfer Crossover Explained | Theory", "url": "https://www.youtube.com/watch?v=Cwzp6HemulY", "image": "https://i.ytimg.com/vi/Cwzp6HemulY/maxresdefault.jpg", "author": "ScreenCrush", "viewCount": "113481", "datePublished": "2021-08-27", "likes": "4,079", "dislikes": "79", "comment": ["Who should be in the Cosmic Avengers?", "Ring ring, Ring ring. \"HELLO, this is Marvel. We would like you to be a planner for our upcoming movies and phases\". Love your dreaming and ideas. You have a great skill Ryan. Thanks", "I just hope that Chris Hemsworth wants to continue playing Thor after 10+ years! It would be a real shame if he was replaced permanently by Natalie Portman, or just killed off entirely.", "I think the the Fantastic Four should also be a part of this ensemble of intergalactic space protectors as they are a family of explorer's who are infamous for travelling throughout the cosmos and visiting new planets and dimensions, while helping others and aiding millions of worlds in the process with unimaginable generosity and were the very first to face against cosmic powerhouses like Galactus, Annihilus and even The Celestial's.", "That \"what more could I lose\" scene is really underrated. Some good writing and acting I always loved that scene"], "authorLink": "https://www.youtube.com/channel/UCgMJGv4cQl8-q71AyFeFmtg", "description": "Marvel Studios has announced more than 20 new projects for the theaters and on Disney Plus...but they still haven't revealed the next Avengers film. Maybe that's because they're actually creating spinoff movies, where we get SEVERAL Avengers team. One on Earth, one in space,  one that's magic-you get the idea. And we have the perfect guy to lead the Space Avengers: Thor. He would gather together heroes like the Captains Marvel, Silver Surfer, and whatever Guardians o4 the Galaxy you got laying around. This is something we'd LOVE to see in the Marvel Cinematic Universe.\n\nIf you're new, Subscribe! → "}