{"title": "POI S5E09 Sotto Voce, p2 [Root x Shaw]", "url": "https://www.youtube.com/watch?v=D2GqKwK5oF0", "image": "https://i.ytimg.com/vi/D2GqKwK5oF0/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "131709", "datePublished": "2016-07-02", "likes": "919", "dislikes": "16", "comment": ["7000 simulations. And not once did they predict just how fucking nuts Root is.", "My favorite is Shaw but what Root did in that scene in the park with Shaw, daring Shaw to shoot, was BRILLIANT! Root knew Shaw wouldn't pull the trigger! Root saved shaw!!", "And this is how POI ended :) Nothing after this part was real :) I'm :) not :) in :) denial :)", "The only thing the machine didn't count on, the unpredictability of Root!!! Goddamnit I loved that moment SO FUCKING MUCH!!!", "I'M NOT CRYING YOU ARE CRYING"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root and Shaw reunite after Shaw's escape.\n\nEpisode summary:\n\"The Voice\", a criminal from the past has resurfaced, and Finch turns to Elias for assistance. It is discovered that he has tracked Reese and Finch since their previous encounter in 2014. After a planned prison break of the \"Templarios\" gang, Reese and Fusco become trapped in the precinct against multiple enemies. Elias and Finch extract valuable information from an explosives associate. It is determined that \"The Voice\" is Terry Easton (Neal Huff), their number, seen from the start. Finch finally meets him on the street, abhorring his devious acts. Elias stops him from killing Finch; as he drives away, Elias kills him remotely with a car bomb. Meanwhile, Shaw finds her way back to New York, and is reunited with Root. Root is overjoyed that Shaw is back, but Shaw, afraid of risking Root's life, threatens to shoot herself, simulation or not. Root threatens suicide as well, declaring if Shaw dies, they both die; Shaw withdraws. Reese and Finch decide to explain The Machine and Samaritan to Fusco. The three meet along the East River near the Queensboro Bridge. Joined by Root and Shaw, the Team is brought back together.\n\nMay 30, 2016"}