{"title": "Madison Montgomery IS Not Dead!  AHS Apocalypse Theory Video", "url": "https://www.youtube.com/watch?v=d34LzhTGXHs", "image": "https://i.ytimg.com/vi/d34LzhTGXHs/maxresdefault.jpg", "author": "MaryGirl Moody", "viewCount": "26955", "datePublished": "2018-08-03", "likes": "610", "dislikes": "26", "comment": ["Madison is a super powerful witch, definitely more than all the others her age.  With Telekenisis, she is the only one able to flip an entire bus, easily outdoing the other girls.  Further, Myrtle Snow points out how experienced she is with it.  With Concilium, she is the only one to use this Wonder on 2 hosts at once (Zoe and Kyle in the last episode).  Her Pyrokenisis is also shown more than any other witch throughout the season.  She also performed Transmutation before all the witches.   Having shown mastery in almost all of the 7 wonders (there is even a debate about whether she can perform Divination - she grabbed a cigarette from the canister that could have been Anna Leighs when asked to find an item of Anna Leighs), i think she is easily powerful enough to resurrect herself.", "I loved The Autopsy of Jane Doe! \nGreat theory👏🏼  I just hope that Madison survives the season! she’s a great character that Ryan just can’t seem to kill off so he should just stop doing it lol", "That cigarette holder she snatched up during the last test was Anna Leigh’s.....so she really preformed all of the Seven Wonders.....js.......", "My theory is that Madison gets help from the devil himself to come back and help the antichrist. Like a soldier type thing, she'll have her powers but she won't be human more of a immaculate being", "Or maybe since Cordelia was so powerful, that she bought Zoe AND all the plants around them back to life, she also bought Madison back to life in that moment..?:0"], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r...\n\nCover Image by Danny Vera. Link to his channel: www.youtube.com/channel/UC-3a9HVa7Mba..."}