{"title": "Aziraphale/Crowley (Good Omens) - From Eden", "url": "https://www.youtube.com/watch?v=D4wNWCAFTOc", "image": "https://i.ytimg.com/vi/D4wNWCAFTOc/maxresdefault.jpg", "author": "HowlingNerdWolf", "viewCount": "54945", "datePublished": "2019-06-05", "likes": "3,248", "dislikes": "11", "comment": ["Amazing symbolism with the line “Honey, you’re familiar like my mirror years ago” considering Crowley being a fallen angel 😭😭😭", "Wow I can't believe Hozier wrote this song specifically for them", "\"I slithered here from eden just to sit outside your door\" could not be a more perfect lyric", "Honestly, the moment in which \"innocence died screaming\" overlapped with Crowley shouting in the bookshop fire made me shiver. My heart's really clenching right now, this song narrates the two of them so painfully well.", "Ok the initial speechlessness has worn off and i can finally articulate what i feel- your editing is so amazing :O the clips u chose for each line fit so perfectly im screaming!!!! I especially love the call and response of 'innocence died screaming / honey ask me, i should know', they frame aziraphales faith crumbling thru confrontations with heaven and the angels, and his realization that the Great Plan he was so dedicated to wasnt what he believed in. And the juxtaposition of crowley, jaded and without faith, appears to be an inherent difference between angels and demons, until THAT FINAL CALL AND RESPONSE :O crowley's lack of faith and his bitterness isnt just something ingrained in his demonic existence, it is the REASON for it!!!!! His innocence really did die screaming, in the exact same way that aziraphales did: he questioned the Great Plan, he questioned God, and he was punished for it. He fell because of it. Aziraphale was clinging to the remains of his hope that heaven was good and righteous, but crowley had learned that that they weren't and through that knowledge he fell from grace. Apple, anyone?"], "authorLink": "https://www.youtube.com/channel/UCvh0jJE0Ut_d2IieR0ANLsA", "description": "From Eden by Hozier\nClips from Good Omens\nI own nothing\n______________\nSort of from Crowley's POV, hence the visual focus on Aziraphale.\n\nMy first fanvid edit in literal ages, feel out of practice. I hope you enjoy it anyway."}