{"title": "Castle Rock S1E09 Explained", "url": "https://www.youtube.com/watch?v=daHousBVci0", "image": "https://i.ytimg.com/vi/daHousBVci0/maxresdefault.jpg", "author": "Think Story", "viewCount": "77812", "datePublished": "2018-09-06", "likes": "1,866", "dislikes": "22", "comment": ["I guess I got so used to Bill Skarsgard's creepy/weird roles that it felt even weirder to see him acting so... uh, normal??? It's almost like there's something wrong. I usually try not to comment only on an actor's looks because I think their work is more important, but I do have to say, he looked hella gorgeous in this episode. ", "Put your hands up if you wish you lived in an alternate timeline where there were new Castle Rock episodes everyday!", "Honestly, I think this is the most underrated show of 2018.\n\nI'm hoping you review/explain Maniac next (coming onto Netflix on the 21st).", "I wish you could review Dark, Netflix Original. It's a German series but it is so great. It is such a mindfuck, I can't even. Not too many people know about it. Some don't watch it cause it's in German but I wish you could give it a try. It is really worth it. It also contains parallel universes, time travelling in a WEIRD way. And that soundtrack though. Amazing! Most of the reviews I saw were in German or Spanish. And not a good one in English. Please consider doing it!", "It's not an alternate \"timeline\", it's another dimension. The same world with the same people with little differences. When Black Henry disappeared for 11 days, he was in the alternate dimension for over 20 years and never aged. White Henry (The Kid) rescued him. Eventually in the forest both Black & White Henry jumped to BH's home dimension. White Henry was captured in 1991 by the warden and trapped in the cage."], "authorLink": "https://www.youtube.com/channel/UC34Qdd5Z5KN30A8aJ2eIMPA", "description": "I delve into season one, episode nine of Castle Rock \"Henry Deaver\" and look at the hidden details, mysteries, easter eggs and Stephen King references. \n\nHelp me translate this video: "}