{"title": "POI S4E08 Point of Origin, p2 [Shaw]", "url": "https://www.youtube.com/watch?v=dgAXz7k7A28", "image": "https://i.ytimg.com/vi/dgAXz7k7A28/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "18844", "datePublished": "2016-08-15", "likes": "110", "dislikes": "4", "comment": [], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Episode summary:\nReese takes an instructor's position at the NYPD police academy to observe the latest number; recruit Dani Silva (Adria Arjona). The team learns that she is spying on her fellow recruits, though further analysis zaproves that Silva is not hunting them, but is instead already a cop from Internal Affairs, working undercover in the academy trying to expose a suspected mole. The mole is Silva's fellow recruit and friend, Alex Ortiz, who is acting on orders of the Brotherhood—he is being coerced by their leader, Dominic (whose identity Finch and Shaw work out while observing his sense of command) in exchange for help with his uncle's legal problems. Ortiz steals files proving Silva is a cop from Silva's handler and then murders him, framing Silva for the crime and making her a wanted fugitive. Ortiz also steals files from the academy's commandant for Dominic. Reese, Fusco and Silva go to Spanish Harlem where Ortiz is under fragile protection by a local drug cartel. The group retrieves Ortiz and escapes while Dominic has the cartel leader executed. Ortiz's confession exonerates Silva and improves Reese's standing in front of Internal Affairs. Meanwhile, Finch has scrutinized the elements of the case enough to formulate a conclusion: Dominic's target is Elias, their new number. Elsewhere, Samaritan has processed the retrieved security footage (from \"Honor Among Thieves\"), producing a somewhat blurry picture of a person (Shaw) who it is unable to identify. In response, Greer sends Martine to identify the person. When Samaritan identifies Shaw's associate in the picture (Tomas), Martine is sent to talk with Tomas' last remaining associate, who identifies Shaw's old associate Romeo as the one who recommended the person. After tracking down Romeo, Martine tortures him into giving up information on Shaw. Using the information, Martine arrives at the department store that Shaw works at. As the episode ends, the two make eye contact and recognize each other as agents of the opposing AI.\n\nNovember 18, 2014"}