{"title": "A TEMPORADA ESTÁ BOA?? Review AHS: Apocalypse Ep.2", "url": "https://www.youtube.com/watch?v=dqNdRzT_SLY", "image": "https://i.ytimg.com/vi/dqNdRzT_SLY/maxresdefault.jpg", "author": "American Horror Story Brasil", "viewCount": "11213", "datePublished": "2018-09-24", "likes": "1,967", "dislikes": "28", "comment": ["Acabei de ler todos os comentários e reparei que você só  curte os elogios e alguns comentários desnecessários como \"me nota\". Aí depois faz uns vídeos nada a ver dizendo que aceita críticas construtivas.", "Esperando fielmente a continuação de \"respondendo perguntas frequentes\" skksks\n(n sei se é esse o nome msm)", "eu estou achando a temporada muito boa, principalmente por estar sendo desenvolvida bem devagar mas sem ser monótono. as coisas estão se encaixando com calma. \n\nmano, o Michael tá MT melhor que no primeiro ep, nossa kkkkk de peso morto para o + manipulador. também acho muito bom estar colocando ele como um ser humano mesmo, pq seria MT clichê colocar sl, ele de chifres e olhos vermelhos kkkkkkkkk", "Eu estou muito animado para os próximos episódios, um por semana é sofrido aaaaaaaaa", "Nossa eu tô amando o Michael! Achei q ele tem uma super presença, tô gostando muito do ator , só o olhar dele já me dá medo kk tô adorando essa coisa meio andrógena e esse ar \"onisciente\" que ele passa. Mas também acho que o desenvolvimento tá meio devagar até agora , principalmente pela temporada ter só 10 episódios, mas o Ryan faz muito isso de fazer vários episódios mais lentos e do nada começar a ação mais frenética no final, vamos ver como vai se desenrolar né"], "authorLink": "https://www.youtube.com/channel/UC3csl_yNKV--YULIQOL13rA", "description": "Link do vídeo com os produtos da loja: https://www.youtube.com/watch?v=mq8Q0...\n\nLINK DA LOJA: https://goo.gl/1JUEMS"}