{"title": "► American Horror Story: Connecting Every Season", "url": "https://www.youtube.com/watch?v=e01Ar4qDZdY", "image": "https://i.ytimg.com/vi/e01Ar4qDZdY/maxresdefault.jpg", "author": "American Horror Story 10", "viewCount": "62136", "datePublished": "2016-12-04", "likes": "623", "dislikes": "43", "comment": ["You have no idea how many times I murdered the replay button 😂 R.I.P Replay button 😢😂", "Genius writing. Absolutely Addicting.  I've NEVER been caught up in ANY show until AHS...I can watch every episode over and over again.", "You have no idea how awesome it would be to have Season 7 bring it all together! If so, I'll be watching the previous seasons of AHS (again for like the 20th time) in a row starting from Episode 1 of Murder House to the end of Roanoke, just to catch up, again, on everything AHS and forming a theory from there! Until we know for sure that Season 7 will bring everything together, I'll just have to wait! (Not that I won't watch all 6 Seasons again in a row sometime this year!) hehe", "Plot twist: Sarah Paulson's real character has been in a coma since 1950 and awakes in 2017, and we find out that everything we've been watching have been figments of her comatose imagination, based on the real news stories of the events that have been playing on the tv in her hospital room, and she's just been imagining herself and what she would do in those situations, and each situation is based on a conflicting emotion she has from her past, which obviously we'll have to explore her backstory and why she went into a coma. And that's why Sarah Paulson has really been in every season. Maybe that's why in a few seasons it seems like her character is totally submissive to a higher figure, usually a mother, perhaps her real life mother treated her horribly. Sally could be a manifestation of her mother being an addict or her being one in result from her mother's harsh treatment, Billie Dean Howard could be a manifestation of how she wishes she had some special gift that would make her mother proud, her characters always seem aiming to please someone in their life. Perhaps the reason her character in season six could not please her husband was because the real her was having a moment where she was accepting that she might never please her mother. And the entire season is spent with her aged self now attempting to track down the survivors from the real stories and connect with them to help come to terms with her problems. Sounds kind of ridiculous, but maybe not for AHS. Perhaps the reason Jessica Lange, who was often a motherly figure to Paulson's characters, stops being present in the new seasons of AHS because her disappearance represents the real life death of her actual mother.", "well done 👏 this is great"], "authorLink": "https://www.youtube.com/channel/UClGiNHyDZPm4jEOo9UyP5Zw", "description": "It seems increasingly likely that all of the series of the super scary American Horror Story are linked. But how? Find out, as we break down the theory. \n\nDISCLAIMER: We claim no ownership of intellectual property used in this video. All footage is the property of its respective owner. It is used under Fair Use laws permitting the use of copyrighted material for the purposes of commentary and parody.\n8107 12pm"}