{"title": "Zoe Benson a descendent of Scathach? Theory Video", "url": "https://www.youtube.com/watch?v=e8030S2FcMo", "image": "https://i.ytimg.com/vi/e8030S2FcMo/maxresdefault.jpg", "author": "MaryGirl Moody", "viewCount": "69762", "datePublished": "2018-09-11", "likes": "1,909", "dislikes": "115", "comment": ["True. But what about Zoe mentioning \"Mallory\" has a bloodline that dates or can be traced back to salem", "Ryan Murphy said something about that Rubberman, Bloody Face, Twisty and  Piggyman are 4 mythological creatures in AHS. Could that mean that they are the 4 horseman of the apocalypse. \nRubberman could be conquest.\nTwisty could be death.", "Wasn’t it confirmed that Scathach was the original supreme? So she may have mated with all these people and created all of the witches in North America. So all the witches may be related on some way. But don’t quote me on this.", "Also, Zoe was abled to release the ghost of the Axe-Man from the academy with ease, similar magic Scathach possesess. Plus, another thing I noticed is that Zoe only uses her \"power\" twice in the first episode and whole season, she accidentally killed her boyfriend with it and purposely used on the frat guy in the hospital. What's was the point of giving her that ability if she was only going to use it in the first episode, shock value?", "I can't believe no one ever noticed before but she successfully performed the 7 wonders. Obviously not when everyone else tried because she dies but she does perform that one just missed her landing by playing around. The 2 she missed out on cause she was dead and out of the running she performs earlier in the season. She finds the spell she needs to bring the axe man back and brings the homeless man back to life. She did the first 5 with the rest the 5th killing her but she still performed if many times before it killed her. I could be wrong and if i am please let me know lol but this is my theory."], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r...\n\nImages by Danny Vera. Link to his channel: www.youtube.com/channel/UC-3a9HVa7Mba..."}