{"title": "POI S4E10 The Cold War, p5 [Root, Root x Shaw]", "url": "https://www.youtube.com/watch?v=eDDKJNYlWK8", "image": "https://i.ytimg.com/vi/eDDKJNYlWK8/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "73863", "datePublished": "2016-08-15", "likes": "336", "dislikes": "9", "comment": ["crazy good child actor wish we saw more of him", "A good representation of the Machine and Samaritan personified and forshadowing for the machine later. The machine (after Root's death) adopted her voice. Root is also a good representative because the machine was first created in 2002 and since technology ages fast an adult is a good representation. Both also went through struggles. ", "Forgive me if I’m being thick, but how is Samaritan controlling the boy? The Machine communicates with Root through Morse code at a frequency only she can hear - is that right? And Samaritan usually interacts with its agents through text messages or messages on screen in response to Greer’s vocal statements/questions. But how on Earth does Samaritan turn this kid into a puppet/mouthpiece like this? I just don’t get it. Is it ever explained? Can someone shed any light on this? Thanks! :-)", "I'm getting some serious Metal Gear Solid 2 vibes here.", "That's it,...i'm taking your allowance."], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Episode summary:\nSamaritan decides to bring an end to the hide-and-seek game that it has so far played with The Machine. To bring The Machine out of hiding, Samaritan showcases its strength by eliminating crime in New York City for a whole day. Elsewhere, John finds out that Samaritan has learned how to deal with irrelevant numbers and has managed to prevent a series of crimes which would otherwise be taken care of by The Machine. Samaritan's actions leave Harold and his team with a difficult choice, whether to let Samaritan do their job or play along with Samaritan's new plan. When The Machine decides not to communicate with Samaritan, Samaritan changes course, bringing New York City to a halt as it allows crime to dramatically increase. Ultimately, The Machine agrees to talk with Samaritan, and Samaritan indicates the time and place of the conversation. There, Root (acting as The Machine's voice) meets with Samaritan's representative, a young boy. After a tense exchange between the two AIs, it becomes clear that The Machine will not back down, while Samaritan is set on destroying The Machine. The episode ends with Shaw leaving the Subway to help Root and the others while Samaritan engineers a stock market crash on Wall Street. Meanwhile, a series of flashbacks show Greer's past as an MI6 agent. When Greer is assigned to kill a KGB agent, he discovers that the KGB agent is in fact also an MI6 agent and that his deputy director, Blackwood, is in fact a double agent. Overcome with anger, Greer kills Blackwood and severs his ties with MI6.\n\nDecember 16, 2014"}