{"title": "CASTLE ROCK Season 2 Episode 5 Breakdown & Annie Wilkes Origin Story Explained! \"The Laughing Place\"", "url": "https://www.youtube.com/watch?v=eJNoau1JMeU", "image": "https://i.ytimg.com/vi/eJNoau1JMeU/maxresdefault.jpg", "author": "Think Story", "viewCount": "27278", "datePublished": "2019-11-06", "likes": "809", "dislikes": "11", "comment": ["that's my daughter, ruby cruz, playing the teenaged annie. so proud of her!!!", "I think her mom’s worst influence was the good/bad, no gray area, idea. Although she certainly got bad influences from both parents, that dichotomy really breaks her when she’s confronted with how her dad is. \nObviously the suicide/murder attempt and the obsessive behavior are traumatic too but I think without the good/bad thing she’d have coped better. ", "This episode blew me away, it was so sad and messed up", "I understand why Annie felt betrayed. They came up with that phrase “The laughing place” together but her dad dedicated it to Rita. I would have been hurt by that too.", "This is the way you show a fall from grace. This was a convincing depiction of a good character going bad and becoming a killer. I wish Star Wars had been written this well and not just had Anakin as a hero who only wants to save his wife then snap their fingers and have him murder kids and kill his wife. There was no transition there and nothing to make me believe he would change so quickly. Compare that to this week's Castle Rock and how beautifully it was acted and written. She was picked on in school, had no friends and could only turn to two people, Rita and her Dad. Then, she finds out that the 2 people who she loves betrayed her and her mom... the dedication was the final straw and I totally believed every moment. Honestly, the actress who played the teen version of Annie should win an Emmy for the scene where she tries to push her dad off the banister."], "authorLink": "https://www.youtube.com/channel/UC34Qdd5Z5KN30A8aJ2eIMPA", "description": "In this video we take a deep dive and review episode 5 \"The Laughing Place\" of Hulu's Castle Rock Season 2 which also explains Annie Wilkes of \"Misery\" origin story. We'll break down, review, and recap the episode while expanding on theories and Stephen King easter eggs!\n\nFollow me on twitter: www.twitter.com/thinkstoryYT\n\nHelp me translate this video: "}