{"title": "Charlie Munger: Mental Models for the Rest of Your Life (PART 7)", "url": "https://www.youtube.com/watch?v=FIwAM1Ozxrk", "image": "https://i.ytimg.com/vi/FIwAM1Ozxrk/hqdefault.jpg", "author": "The Swedish Investor", "viewCount": "12435", "datePublished": "2021-08-31", "likes": "809", "dislikes": "6", "comment": ["This was a great series, I learned so much. Thank you for doing this 🤗", "Very interesting series, extremely insightful. Can't wait for the next one!", "Incredible effort mate, very informative series, amazing passion and very deep research. Keep doing your great job! well done!", "I doubt youtube can be any better than this series. The best ROI in my life!", "That was awesome, thanks for these weekly shows"], "authorLink": "https://www.youtube.com/channel/UCAeAB8ABXGoGMbXuYPmiu2A", "description": "Charlie Munger, the vice chairman of Berkshire Hathaway and one of the most successful investors ever, is said to have the best 30-second mind in the world. He goes from A to Z in one move. He sees the essence of everything before you can even finish the sentence.\n\nHow does he do it? Through observing reality and running it against his mental models. In this series of videos, you’ll learn some of the most important models which Charlie Munger uses, which he has talked about publicly. These mental models have helped Munger to conquer the stock market, but they are so diverse that they have applications within many other areas too. For example, they have allowed Munger to be a successful Chairman at a large hospital, and they have allowed him to overcome devastating personal losses.\n\nThe series will cover a total of 35 of Charlie’s mental models. He says he has some 100 models in his head at all times, but he also says that a few of them carry most of the freight. I think that we’ll cover the most important ones in this series, which will be divided into 7 parts, will 5 models in each one. The models will primarily be related to investing, but also to associated subjects such as economics, entrepreneurship & career. Hope you enjoy.\n\nCan’t get enough of mental models? Check out Nassim Taleb’s Incerto Series: "}