{"title": "POI S2E16 Relevance, p6 [Root x Shaw]", "url": "https://www.youtube.com/watch?v=FNDZAwihQmM", "image": "https://i.ytimg.com/vi/FNDZAwihQmM/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "86288", "datePublished": "2016-06-21", "likes": "413", "dislikes": "7", "comment": ["just wanna say thank you for uploading all these scenes of root and shaw! you don't know how great it is to see these clips all in one place :)", "Wow, Amy/Root looks so young and innocent in this episode, I mean compared to later seasons.", "3:44 omg How did I never notice Root putting her arms on Shaw’s leg.", "thank you for doing the lords work by uploading these 🙏🙏 the best", "c une serie qui a bcp d enseignements aussi bien sur les valeurs individuelles, sacrifice, gratitude, altruisme! les personnalités des personnages sont bien choisies! chacun de nous s'identifie à l 'un d'eux et le fait qu ils ont changé tout au long des saisons, montre que nous pouvons tous corriger nos erreurs !"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root and Shaw meet cute.\nSameen Shaw introduction episode.\n\nEpisode summary:\nSameen Shaw (Sarah Shahi), a government assassin, and Michael Cole (Ebon Moss-Bachrach), a computer specialist working for Special Counsel (Jay O. Sanders), neutralize a terrorist plot, acting on information from a Pentagon group called \"Research\". Cole suspects that Research may sometimes be wrong, having found out from the Social Security number belonging to an electrical engineer they had previously killed that he was hired by the US government, not by terrorists. The Machine meanwhile gives their numbers to Reese and Finch, since their lives are now in danger. Special Counsel has sent a hit team to eliminate Shaw and Cole because Cole may have obtained information on the Machine. They kill Cole. Shaw escapes with help from Reese, whom she shoots, believing him to be another assassin. (We see Reese later, and can infer he was wearing body armor, but that the shock had delayed him long enough for her to evade him.) While on the run, Shaw is captured and tied up to be interrogated by Root, who believes she may hold the key to the Machine's location. Root leaves abruptly to avoid another hit team from Special Counsel. Just as the new hit team are about to kill Shaw, Reese saves her. He brings her to meet Finch, who explains that \"Research\" does not actually exist (implying it is the Machine), and offers his aid to her. She refuses, so he offers her his card, which she looks at, but politely declines. She goes to confront Special Counsel, and surprisingly returns the flash drive with the information Cole had recovered, then kills the subordinate who had ordered her and Cole's death. Special Counsel allows her to leave, but later her old mentor (Hersh) surprises her on a crowded street, injecting her with poison. Leon Tao (disguised as a paramedic), Carter, and Fusco take charge of the apparently dead body and drive away. We learn in the next scene that Tao has, as directed by Reese, injected her with an antidote. Shaw, fully recovered after a sedative Tao had to give her, meets with Reese and Finch in a graveyard. While again refusing their aid, this time she accepts Finch's card.\n\nFebruary 21, 2013\n\n+322"}