{"title": "Générique Person Of Interest. (VF)", "url": "https://www.youtube.com/watch?v=fPcEGGekuJk", "image": "https://i.ytimg.com/vi/fPcEGGekuJk/hqdefault.jpg", "author": "angu672", "viewCount": "82750", "datePublished": "2012-09-06", "likes": "382", "dislikes": "13", "comment": ["Cette série est excellente ! Acteurs, musique, personnages, intrigues: tout est bon!\nJohn Reese: un super héros d'un nouveau genre ^^", "Série très réfléchie et très prenante, c'est énorme :D", "Je connais le générique par coeur à force de regarder les épisodes chaque mercredi :D !! C'est vraiment une super série que je conseille absolument !!", "<3 MA série préférer ! ^^", "Cette série est tout simplement énorme, pas l'habitude de voir une intrigue aussi prenante."], "authorLink": "https://www.youtube.com/channel/UCxC3d_y6S7DeGsvi7KJFFmg", "description": "John Reese, un agent de la CIA présumé mort est engagé par un mystérieux milliardaire du nom de Harold Finch. Celui-ci a conçu pour le gouvernement, par le passé, une machine capable de prédire les actes terroristes dans la ville de New York, en s'appuyant sur de nombreuses données, comme les enregistrements des caméras de surveillance et des appels téléphoniques ou les antécédents judiciaires. Cependant, la machine repère aussi crimes, actes violents et autres délits impliquant des personnes ordinaires. Les autorités ayant décidé de ne pas tenir compte de ces données, Finch s'est laissé une « fenêtre » de sortie, et reçoit chaque jour les numéros de sécurité sociale de personnes impliquées (persons of interest). C'est avec l'aide de Reese qu'il va tenter de retrouver ces personnes, et de découvrir si elles ont le rôle de victime ou de coupable dans l'affaire concernée.\nTraqués par l'inspectrice de police Joss Carter, ils s'aident d'un inspecteur véreux, Lionel Fusco, pour leur fournir des informations et garder un œil sur elle."}