{"title": "Good Omens Season 2 .. Did It REALLY Get Cancelled!?", "url": "https://www.youtube.com/watch?v=FzWRBDqVceU", "image": "https://i.ytimg.com/vi/FzWRBDqVceU/maxresdefault.jpg", "author": "Scene Focus", "viewCount": "5689", "datePublished": "2021-02-03", "likes": "129", "dislikes": "29", "comment": ["Short answer: No-one knows.\nEdit: season 2 has been confirmed by Neil Gaiman now.", "CROWley CROWley-\n\nDID YOU NOT WATCH IT???", "Skip to 9:45 if you want the answer. The first 9 minutes is just fluff for everyone who’s familiar with the show.", "I know nothing more!!!!!!\nAlso viewership Do I have to say Tumblr  or AO3 .\nI respect that he made the series for his writing partner,but we are still here.", "The unused sequel content was written in as the epilogue by Gaiman. This guy hasn't even watched the show or read the book."], "authorLink": "https://www.youtube.com/channel/UCG7HMKwdoz9Zfr9z2NC3vyA", "description": "Good Omens Season 2 .. Did It REALLY Get Cancelled!? \n\nWelcome back to Scene Focus, today on the channel we are going to be diving deep into the world of the good omens season 2. The tv show good omens is so good and it’s everything you need it to be and it is honestly a tv show worth watching and that is why a lot of fans are anticipating for the second season of the tv series and for sure you are one of those people which is exactly why you are here because you are hopeful that the good omens season 2 is finally happening. Well, you have to watch the whole video to find out! \n\nThe good omens tv show is certainly a tv show worth having many seasons and all fans would agree to that! It may not be a perfect tv show but it is very entertaining and it’s so fun and the cast and characters just complete the show which are exactly what we only need as fans and some of the cast we wanna watch again are michael sheen, david tennant, jon hamm, adria arjona, jack whitehall and many more. So if you wanna know if the good omens is renewed for season 2 or if it’s officially cancelled, you must watch this video now to find out! "}