{"title": "POI S3E16 RAM [Shaw, Root]", "url": "https://www.youtube.com/watch?v=GivvFGtUUCk", "image": "https://i.ytimg.com/vi/GivvFGtUUCk/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "37988", "datePublished": "2016-07-10", "likes": "236", "dislikes": "9", "comment": ["How lucky harold is shaw didnt decide to kill him lol.", "The best crossover ever seen haha :D", "Sledge Hammer, is that you?!", "here for Joee", "so all finch's hire was not an accident right?"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Flashback: Shaw's beginning as an ISA agent and Harold's (unknowing) introduction to her.\nPresent day: Root travels to China to retrieve a laptop.\n\nEpisode summary:\nIn 2010, Harold was working with a man called Dillinger (Neil Jackson), an ex-Blackwater mercenary who performed the same duties currently performed by Reese. Their current number is Daniel Casey (Joseph Mazzello), a hacker who tests computer security systems. They soon find out that multiple parties are attempting to eliminate Casey, including Reese and Stanton (secretly arranged by Control). Dillinger saves Casey and brings him to Harold, who realizes Casey's last job was to find a way to access the Machine. Although Casey failed, he learned enough to warrant Control and Special Counsel to want him dead and his laptop destroyed. Dillinger turns on Finch and steals the laptop from him to sell on the black market. The sale is busted by another agent of Special Counsel (revealed to be Shaw) who kills Dillinger, but fails to stop one of the buyers from escaping with the laptop. Casey is captured by Reese, who decides to let him live against his orders, providing him with safe passage to Canada. Control traces the laptop to China, and orders that Reese and Stanton are sent after the laptop and destroyed along with it. In the present day, Root finds Casey in Alaska and tells him to go to Cartagena, Colombia and seek out Jason Greenfield, her number from \"Mors Praematura\".\n\nMarch 4, 2014"}