{"title": "Good Omens 1x1 REACTION!! \"In the Beginning\"", "url": "https://www.youtube.com/watch?v=gwqX6S_CpHk", "image": "https://i.ytimg.com/vi/gwqX6S_CpHk/maxresdefault.jpg", "author": "Blind Wave", "viewCount": "84728", "datePublished": "2020-04-15", "likes": "4,194", "dislikes": "34", "comment": ["Watch next week's Reaction to Good Omens 1x2 \"The Book\" Early HERE: https://www.patreon.com/posts/36029185\nWatch the FULL LENGTH Reaction HERE: https://blindwavellc.com/good-omens-1x01-full/", "Also Crowley and Aziraphale giving a random child the weirdest possible upbringing ever makes me laugh so hard.", "Actually, David wore the contacts in EVERY SCENE, even if he had the sunglasses on. Another youtuber went through and brightened the scenes where he was wearing the sunglasses until you could see his eyes behind them, and it changes the feeling of Crowley's behavior DRASTICALLY, but in an INTERESTING way. David was absolutely putting all of his acting chops into it, even when he didn't have to! :V", "“God does not play dice with the universe; He plays an ineffable game of His own devising, which might be compared, from the perspective of any of the other players [i.e. everybody], to being involved in an obscure and complex variant of poker in a pitch-dark room, with blank cards, for infinite stakes, with a Dealer who won't tell you the rules, and who smiles all the time.” I absolutely love this Terry Pratchett quote so much, it's a perfect analogy for someone choosing which religion is correct if any, out of the hundreds that exist. The infinite stakes being the worst possible thing, undeserved eternal torture, or the best possible thing, undeserved eternal paradise.", "The list of characters at the beginning of the book refers to the other demons as fallen angels, but to Crowley as an angel who “sauntered vaguely downward.” He was just hanging out with the wrong crowd."], "authorLink": "https://www.youtube.com/channel/UCs1APU4_lj3PgZz2B4HeadA", "description": "Eric Rick Calvin and Aaron react to and discuss season 1 episode 1 of Good Omens - In the Beginning - #GoodOmens"}