{"title": "POI S3E14 Provenance, p5 [Shaw]", "url": "https://www.youtube.com/watch?v=H0dwLktQ3OI", "image": "https://i.ytimg.com/vi/H0dwLktQ3OI/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "27594", "datePublished": "2016-07-07", "likes": "157", "dislikes": "3", "comment": ["Yes Reese. Pour one out for the homie Carter.", "That last scene is one of the best in the show.  I was pleased they honoured Carter's memory in the show - I feel that when characters die in TV shows, sometimes they are just forgotten, so it was nice to see this scene.", "Being part of an honorable team that you KNOW you can trust feels great. Nothing in civilian life compares for me.", "I'll keep on saying it I love shaw!!", "The OST here in this episode plz?"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Shaw reunites Kelly with her daughter.\nTeam Machine has a drink together.\n\nEpisode summary:\nThe team's next case is that of Kelli Lin (Elaine Tan), a former silver medal-winning Olympic gymnast who is later revealed to be an antiquities thief long pursued by Interpol. Following a robbery at a museum exhibition, Shaw investigates Kelli's house and learns that her next operation is to steal a Gutenberg Bible that is being shipped out that night. Shaw is able to foil the plan but is confronted by Kelli, whose boss Cyril (Gene Farber) is an extortionist revealed to be forcing Kelli to commit robberies while her daughter is kept kidnapped. The team learns that the Bible is being kept in a heavily guarded building belonging to a company called Symmetric Security. Fusco obtains the fingerprints of a guard there while Finch uses a 3D printer to create a fake hand with the guard's fingerprints. That night at the Symmetric Security headquarters, Reese distracts the guards by setting off the alarms in the building, allowing Shaw and Kelli to use the fingerprints to access the room containing the Bible. Kelli uses her gymnastics skills to bypass the proximity detectors and steal the Bible. Finch takes Interpol agent Alain Bouchard (Henri Lubatti), the man in charge of the investigation against Kelli, and they listen in on Kelli's conversation with Cyril so Bouchard can learn the truth. Cyril refuses to free Kelli's daughter, but when he accesses the surveillance feed on her, he sees Reese take down the thugs guarding the girl. Shaw shoots Cyril in the leg before he can kill Kelli and both Kelli and Cyril are apprehended. In an interrogation room at the NYPD, Bouchard tells Kelli that her life before being a criminal was a shame and that she deserved the gold medal. He places a key on a desk, allowing her to leave. The next day, Kelli and her daughter happily reunite after Reese's rescue. That night, the team celebrates their victory and Reese honors Carter by pouring a glass for their \"missing member\".\n\nFebruary 4, 2014"}