{"title": "American Horror Story Cult Episode 5 Review", "url": "https://www.youtube.com/watch?v=Hck7-TOGr2k", "image": "https://i.ytimg.com/vi/Hck7-TOGr2k/maxresdefault.jpg", "author": "MaryGirl Moody", "viewCount": "1285", "datePublished": "2017-10-05", "likes": "60", "dislikes": "0", "comment": ["I loved all the gorey brutal scenes. Loved loved this episode! By far one of the best in all of AHS history. Definitely enjoying the show more now 👌", "BEST episode of the season. I live for AHA moment where Meadow screams, IT'S A CULT ALLY\n\n\nAlly lies still in shock", "So glad i found your page again (was with u with roanoke last year) love ur passion for details and intrest for AHS ! U the Realdeal ;)\nAlly gave ivy a vibrator-thingy (that pink thing in the tourquoise box ;)\nLove your lipstick and toothgap, where r ur specks tho? ^^ keep goin gorgeous", "Hey @Mary - did you hear about the next episode of Cult? There is apparently supposed to be a scene in it with “a mass shooting” and so they may delay the airing for it due to the recent events in Vegas. How do you feel about that?", "I appreciate you having these videos MaryGirl Moody...My favorite series was Coven, the scariest for me was Asylum...But I seriously think something is mentally WRONG with ALL of us who watch this show sometimes, especially Episode 5. I have 3 American Horror Story     T- Shirts 2 Black 1 Yellow including the one promoting Cult and I'm embarrassed to wear it in public especially after this last episode. It was a bit too slasher for me, which makes me concerned about not only my sanity, but ALL Fans of AHS!  It borders on some kind of mental weirdness. Who watches and writes this HORROR? And am looking forward to the next episode; and yet a side of me is disturbed that I find it fascinatingly unhealthy to watch. Am I going to watch next week? Well, of course and probably have a small dinner party with good wine with a few friends as we watch together. I really don't like the gore and I'm glad Louie Anderson commercials are running trying to save the reputation of clowns. Thanks again, MGMoody for this forum. What the heck is a \"Gimp\"? Anyway....(running to Google to see if it sheds light on what and why was that body hanging with hooks in it. What fking sht is that?  LOL (shaking my head in confusion as to why am I still a fan of this sic show? <sigh> My favorite character on this show is still Sarah Paulson; the woman reporter surprised me, she's becoming an incredible force. I also always enjoy Angela Bassett from past episodes; Kathy Bates is a given, and Evan Peters is so versatile....What is it about this show??? lol"], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": ""}