{"title": "Person Of Interest || We Are Strong", "url": "https://www.youtube.com/watch?v=Hie-ldy6cms", "image": "https://i.ytimg.com/vi/Hie-ldy6cms/maxresdefault.jpg", "author": "Zurik 23M", "viewCount": "97137", "datePublished": "2016-10-30", "likes": "2,701", "dislikes": "5", "comment": ["God, I miss this show. It's a crime, how they canceled it. It was so damn incredible from start to finish, one of my favorite shows ever. Fantastic tribute!", "Right now I just finished watching the last episode of this show and I am trying to find something that can help me to deal with it. Since I started watching this show I didnt expect it would end like this. I've watched many shows and I learned a lot of things with them but POI made me meet characters that I will always carry on my heart. This is the first show that makes me love all the characters.  I can say POI already changed my life and my mind, it is my new favorite show now. I'm sure I'll be watching this vid over and over because it really reminds me good moments of this wonderful show. I'll stop typing now because my keyboard is turning into a swimming pool of tears. :´(", "The most powerful and emotionally quenching series I’ve ever watched hands down. You compiled so many of the moments I was looking for in a beautifully artistic way. The series is beyond words and my actually painful waterfall of tears is my only way I could possibly begin to explain how amazing this series was. Throughout the entire series they’ve developed the story and character in such a precise and moving way. So many stories, so many laughs, so many tears. God, I had no clue what I was getting into when I first started this show. I feel so bittersweet having just finished the finale. It was such a good ending and I don’t think they could have changed any part of this and made it anymore of a masterpiece. A large part of me hoped all the characters would have their happy endings and live — and I suppose using the machines moving ideology they did just that, but another part of me knew it wouldn’t end like a fairy tale. That’s reality, and person of interest has always been a mirror of harsh truths. I suppose I’m writing this in a somber attempt to relinquish myself of the devastating realization that this is the end of their story. Honestly, knowing what I know now I can’t see myself re-watching it, not because of anything negative necessarily, but because now that I know their fate, their heroic path, I don’t think I could see any of their faces again without bawling out in tears. This story revolves around humanity, what you do in life and in death. The consequences of your actions and how they spiral to effect everyone around you. This began as a journey to save a few, and it became so much more. The way they planned the story is so ingenious. They’ve fitted lines and characters so perfectly, placing subtle statements of what is to come even from the first seasons. Even the simple action of Root coining the Machine as a “Her”, trickled on immensely in the plot. There’s too much to notice, to appreciate. It’s left me speechless and rendered me a weeping mop. I’ve fallen deeply in love with these characters, each and every one of them. In order for me to actually sleep tonight, I’ll have to pretend in my mind that they all held hands and ran into the sunset together, the machine telling them sweet nothings in their earbuds.. A message to the creators, thank you for the experience, the journey; it was a long and amazing one.", "God, I can't believe I only just saw this now. It makes me miss the show so incredibly much. Thank you for this beautiful tribute to a beautiful show.", "Root was such an amazing character, I miss her so much :c"], "authorLink": "https://www.youtube.com/channel/UCqIk_xynj7j5sLPu3me6kvw", "description": "I'm so sorry, guys.. I made this video just now, it's awful. POI deserve much more videos every day. It was an incredibly emotional final. We have lost so many favorite characters, but in the end we won. I will miss to this wonderful show. I hope you enjoy, guys!\n_______________________________________\n\nAsk me any questions on "}