{"title": "AHS: DOUBLE FEATURE Episode 1 & 2 Breakdown", "url": "https://www.youtube.com/watch?v=HKqCzipUxTc", "image": "https://i.ytimg.com/vi/HKqCzipUxTc/hqdefault.jpg", "author": "GameSpot Universe", "viewCount": "88773", "datePublished": "2021-08-27", "likes": "3,174", "dislikes": "55", "comment": ["AHS Double Feature made history. It was the first time a Karen was right.", "My favorite thing about the grocery store scene is that it’s the EXACT SAME location they shot the grocery store scene for Cult in, it’s just framed and lit differently", "Another connection to \"selling your soul for talent\" is that Paganini (the musician that Alma was trying to play) was such a good violin player that it was rumored that he sold his soul to the devil to get so talented.", "I love how the grocery store owner knew IMMEDIATELY that Harry had taken the pill (The Muse). So it's dope that some of the townspeople are in on the whole thing.", "McCauley is such a great inclusion."], "authorLink": "https://www.youtube.com/channel/UCRgUg0jJUgGMadGPzzmu8cw", "description": "American Horror Story is back! Greg and Ryan break down the first two episodes of AHS Double Feature. The start of Season 10 looks promising as the Gardners move into Provincetown in order to escape the city and get some work done. Unfortunately, things aren't what they seem to be in P-Town. \n\nWe're quickly introduced to some blood-suckers, an epic Sarah Paulson performance in Tuberculosis Karen, some very scary pale people and much more. Harry Gardner is a conflicted writer that's having trouble working on his next big project. After a bit of peer pressure, he decides to take a mysterious pill that has a whole lot of unwanted side effects. \n\nGreg and Ryan discuss the two-part opener's biggest moments and details you may have missed. Make sure you stick around every week for Episode breakdowns and more. Let us know your thoughts about the season in the comments below!\n\nSubscribe to GameSpot Universe! "}