{"title": "We NEED to Talk About Spiral: From the Book of SAW", "url": "https://www.youtube.com/watch?v=hnj8sUkWsTA", "image": "https://i.ytimg.com/vi/hnj8sUkWsTA/hqdefault.jpg", "author": "Reel Talk", "viewCount": "472", "datePublished": "2021-09-03", "likes": "46", "dislikes": "1", "comment": ["Man, Honestly I was so exited about this movie and  it kind of depressed me for a wile. These are my all time favorite movies but after watching it I started wondering if this is the end....but no I still stand strong as a saw fan. Not trying to plug my channel but you along with others  actually inspired me to start making my own videos so wanted to say thank you.  Still finding my comfort zone. Really like you're stuff and thank you again.", "I honestly think the concept is a very good idea but honestly I felt it should've been written by different writers and a different director . Honestly I liked the ending I think the cliffhanger ending was alright . They honestly reveal the killer way to early but they could still form the Jigsaw Cult we all were hoping for in spiral because of the name ( from the book of saw ) . I think if there going to make a sequel they need newer writers add cameos from previous saw movies , bring logan from Jigsaw bring back hoffman and different characters and justify the dialogue because the dialogue was bad at times . I'm hoping when spiral 2 comes out they do justice for the franchise because they can make a better sequel .", "Same opinion here . They had 2 movies to start something New but now we are Stuck.  Bring back the og timeline.  Maybe the hardcore Fans are enough to keep this franchise going. AT least in a 10 Episode series. I liked jigsaw but there are many Problems that a sequel maybe could have solved. \nKeep it up . And greetings from germany🙂", "Everyone knew who the bad guy was from the trailer alone.", "I haven’t bought this one yet and I can’t say that about any of the others. I saw it in the store today but my money stayed in my pocket. I guess once was enough."], "authorLink": "https://www.youtube.com/channel/UC4GPRqEoZ4zpnTHIxcG5JyQ", "description": "We NEED to Talk About Spiral: From the Book of SAW\n\nTwitter: https://twitter.com/ReelToRealPro"}