{"title": "Person Of Interest Season 2 Soundtrack: Tracklist + Scenes", "url": "https://www.youtube.com/watch?v=ho1P_H8ABtA", "image": "https://i.ytimg.com/vi/ho1P_H8ABtA/maxresdefault.jpg", "author": "FringeMusic107", "viewCount": "8273", "datePublished": "2014-01-16", "likes": "39", "dislikes": "2", "comment": ["I love this show. Very intriguing and every second counts. Great talent!", "I've been waiting for this a long time! I'm so excited that it is almost out!", "The first second or so of Shaw sounds like the theme as Reese is getting out of the taxi in the pilot before firing the grenade at the car. Thanks for making this. I found (without the video) a few of them were easy to pinpoint, others easy to figure out the episode but not the exact scene. Even with the video, I'm still a little lost as to what episode some of these are from.  I don't suppose that could be added to the description or something?", "Isn't \"Descent Into Deviant Behavior\" from \"Til Death\", like the title would suggest?", "When it comes out will you post a link for the tracks "], "authorLink": "https://www.youtube.com/channel/UCGU3fjBOY4CYJPgP7W-bguA", "description": "These are the scenes that fit with the tracks that will be released on the official Person Of Interest Season 2 soundtrack, based on the 30 second iTunes previews from this link: https://itunes.apple.com/gb/album/per... \nThere are four tracks missing from this video, simply because I couldn't remember which scenes they are originally from. \"The Man Who Sold The World\" includes new versions of Carter's theme and the main Machine theme. \"New Number\" and \"Descent Into Deviant Behavior\" are versions of Reese's theme that, honestly, could be from any episode. \"Luck Of The Irish\" sounds like nothing I've ever heard on the show!\nKeep in mind that Ramin Djawadi likes to release \"compilation\" tracks, with music from various scenes or episodes edited into one track. That means there could still be some bits of music not listed in this video. For example, \"God Mode\" is too long to just be from the opening scene of the season finale.\n\nFull track list:\n1. Crash Of Death ("}