{"title": "POI S5E10 The Day the World Went Away, p1 [Root x Shaw, Root]", "url": "https://www.youtube.com/watch?v=Hz0jjKOdJPk", "image": "https://i.ytimg.com/vi/Hz0jjKOdJPk/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "48216", "datePublished": "2016-07-02", "likes": "178", "dislikes": "2", "comment": ["So foreshadowing I can't... THIS was the best compilation ever EVER thank u so much! Feels like I seriously got to watch the show all over only more specified\nI have to stop watching now cuz I literally can't deal w things to come \nBut again THANK U FOR THIS IT WAS THE BEST!!", "love his sound", "Rosineide   dos  Santos Souza 100💝💝💝💝💝💝👄😍👎🔥👎👎👎"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root gives Harold a status update on Shaw.\nRoot and Harold continue to debate how The Machine should work; Harold decides to let The Machine choose her own voice.\n\nEpisode summary: \nFinch's number comes up when his cover identity is compromised, due to a subconscious error, and Samaritan initiates a continuous dispatch of operatives on him. The team splits up in their escape, which results in Elias being killed by Samaritan agents while protecting Finch. The team rescues Finch from his potential capture, and Root explains in the car her current understanding of herself and everyone else to be \"information\" that can never truly disappear despite their deaths. Root is shot by Samaritan operative Jeff Blackwell and placed in critical condition, while the police apprehend Finch who is accused of treason. A devastated Finch provides a soliloquy on how he has chosen to abandon the principles he has long followed, and vows to kill Samaritan. The Machine calls Finch in the precinct, having taken on the voice of Root, who had died from her injuries. The Machine sets every criminal in the precinct free to allow Finch to escape; Reese and Shaw realize that Finch's number came up not because he was a victim, but rather a perpetrator against Samaritan.\n\nMay 31, 2016"}