{"title": "WESTWORLD Season 3 Episode 8 Breakdown, Theories, and Details You Missed!  Twists + Post Credits", "url": "https://www.youtube.com/watch?v=I-Q0R4U4SgI", "image": "https://i.ytimg.com/vi/I-Q0R4U4SgI/maxresdefault.jpg", "author": "Think Story", "viewCount": "199704", "datePublished": "2020-05-04", "likes": "6,034", "dislikes": "96", "comment": ["I had such a blast making these videos this season! Thanks for joining me on this crazy ride and see you in 2054 for Season 4!", "\"Only a billion more years of waiting until next season\"\n\n\n\n\nI felt that", "why nobody can shoot properly in this show is beyond me.", "In E4,when Charlores was sending William to mental facility, she said to him, \"One day I'll let you destroy yourself\". Who thought this would be so literal!\n(As copy of william killed the real william)", "I think that was a nice touch at the end - what Dolores calls “her kind” are those who can make choices, which brings the whole season back into perspective.  Every one of the main characters this season had a choice to make, including Serac who chose to give up his ability to choose by obey Rehoboam (and hence, no longer himself); Dolores prime who chose to finish her mission including sacrificing herself (and nobody understood her until the end); Charlores who chose to go dark (the version of Dolores whose ability to see the beauty and hope, as she did in Hale’s family, died with their death, and with that, she goes full dark Dolores, parallels with the dark William transformation from the previous seasons) and she seems to choose to revive the hosts and take over the world (a call back to the original motives of the hosts in the 1970s movie) - she (dark Dolores in Hale) even teams up with dark William (host version) who completes his journey into full darkness by killing the actual human William and replacing him completely; Bernard who chose to follow Dolores’ guidance for him to save the world after he finally understands her; and Maeve who finally makes a choice (her whole season of self-preservation for her daughter, her family, which kept her close-minded is finally opened up after she understands what Dolores truly wanted to do and as such, she chooses to support her bigger family of those who can make choices.  "], "authorLink": "https://www.youtube.com/channel/UC34Qdd5Z5KN30A8aJ2eIMPA", "description": "In this video we breakdown, explain, review, and recap Season 3 Episode 8 \"Crisis Theory\" of HBO's Westworld for new theories, easter eggs, and details you missed. \n\nDelos Parks Website: "}