{"title": "POI S3E10 The Devil's Share, p2 [Shaw]", "url": "https://www.youtube.com/watch?v=I0QBpsqpkQs", "image": "https://i.ytimg.com/vi/I0QBpsqpkQs/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "77153", "datePublished": "2016-07-05", "likes": "498", "dislikes": "13", "comment": ["The thing about this scene that broke my heart the most was this; society wouldn't allow her to save people's lives, so she took a job that let her take them. The system failed her in such a monumental way", "3:52 This is the most emotion I have seen from Shaw even when she lost Root. The realization that another opportunity is passing her by or she is being rejected because of her \"condition\" and it's probably not the first time it's caused her to lose something, friends, relationships. She knows she's screwed up and she can't do anything about it. I feel for her because I'm kind of the same way.", "Me Imagining Shaw Eating A Energy Bar While Telling A Family That Their Dad Were  Dead Is HILARIOUS. I Can See Shaw Doing That.", "Sarah Shahi is a BRILLIANT ACTRESS!!", "I would have liked to have seen Shaw in Star Trek as a contrast with the Vulcans. Repressing/disciplining one's feelings vs simply not having them."], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Flashback: Shaw.\n\nEpisode summary:\nFlashbacks in this episode illuminate Finch's dealing with survivor's guilt, Reese's time doing wetwork, Shaw's former life as a surgeon striving for technical excellence while completely indifferent to the people she helped, and Fusco's recounting of exacting vigilante-style justice to a crook that slipped through the system (the devil's share). The race is on to get to Simmons before he can make his escape. Reese starts sliding into his old, dark ways while also sliding towards death from wounds dealt by Simmons in the last episode. Finch, Fusco, and Shaw go to an HR attorney to get information on Quinn's whereabouts so they can question him for Simmons' plan, but the Russians have killed him, shortly after Reese was able to get the information. The team turns to Root, who is able to get her knowledge from the all-seeing Machine. She joins them at the FBI safehouse and helps hold off the Russians. Reese gets Simmons' location and is just about to kill Quinn when Finch reminds him that killing Quinn now would destroy Carter's legacy of bringing him down legally, and he collapses. The team, minus Fusco who stays with Quinn until FBI backup can arrive, get Reese to medical care. Fusco finds the note that Reese dropped, and goes after Simmons. After a brutal fistfight, Fusco emotionally refuses to kill Simmons as he might have in the past but takes him into custody, citing Carter's influence for turning his life around. Finch and Shaw return to the library, and Root, despite having opportunity to flee, returns to her cell, and Finch thanks her for helping him in saving his friend Reese. Ultimately, Elias watches as Scarface murders Simmons in his hospital bed in retaliation for Carter.\n\nNovember 26, 2013"}