{"title": "POI S5E04 6,741, p4 [Shaw, Root x Shaw, S!Root]", "url": "https://www.youtube.com/watch?v=i1XmQI7AkhE", "image": "https://i.ytimg.com/vi/i1XmQI7AkhE/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "71494", "datePublished": "2016-06-21", "likes": "389", "dislikes": "2", "comment": ["1:19 Everyone’s so off character here. Notice how Reese just stands there like an NPC when he doesn’t have dialogue. Finch is extremely stoic about Shaw’s return, his voice sounding more calculating than concerned. And Root trying to fish a response from Shaw based solely on their kiss that was caught on camera.", "I don't blame Shaw for being for tempered with Harold. He would have moved Heaven and earth to find Reese!! Don't  blame her one bit!!", "Shaw calling out to Root screams internally", "I just realised that the fact that Shaw woke up in Root's apartment was a giveaway that it was a simulation. Samaritan doesn't know about the subway so it made a guess, but we knew that Root slept in there & if u think about it Root has no reason to have a fully furnished apartment considering she's always travelling", "\"Root, thet got in my head...\" the first thing Shaw said as soon as she wakes up. I mean, when did Shaw ever did that to any other people? MY GWAD SO PRECIOUS"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Shaw homecoming at the safehouse.\n\nEpisode summary:\nShaw is seen undergoing surgery by Samaritan operatives, to have an electronic microchip implanted between her ear and her brain stem. After enduring a mind-bending reeducation sequence and being taunted by Jeremy Lambert, she is able to turn the tables on him; she takes the opportunity to break out of confinement, and finds the team. Together they trick Samaritan's operatives and capture Greer. With Greer in captivity, Shaw removes a USB drive embedded inside his arm, which Finch is able to analyze, discovering it to be a kill-switch for Samaritan. Shaw had revealed to Root that she was subjected to extreme psychological torture while captive; once Greer starts to taunt her about the kill-switch and her mental state, she hallucinates heavily, loses control of reality and kills him. Shaw continues into a neurological downward spiral, causing her to kill Reese. She is about to kill Root when she confesses that Root was her only mental safe-place, and turns the gun on herself. The narrative returns to the operating room, and it's revealed that these events happened only in Shaw's mind. She has been subjected to thousands of electrochemical mind-control simulations by Samaritan, so its operatives can see if she would lead them to the Machine and its assets. This particular simulation was number 6,741.\n\nMay 16, 2016"}