{"title": "AHS 1984 Episode 6 Review & Synopsis", "url": "https://www.youtube.com/watch?v=IAsmmvpGKQw", "image": "https://i.ytimg.com/vi/IAsmmvpGKQw/hqdefault.jpg", "author": "MaryGirl Moody", "viewCount": "4686", "datePublished": "2019-10-25", "likes": "264", "dislikes": "6", "comment": ["I theorize that billy idol will guest star. He will be a clarion angel of God and he will fight Richard Ramirez for the Lord!", "Margaret's \"Ivana Trump Wannabe Hair\" was the BEST part of the episode's 80's fanfare.👍😂", "Margaret's kill better not be lame...", "Hey Mary, Jingles wife played Hayden’s sister in Season 1. \nMargaret is amazeballs & reminds me of Ivana trump and Courtney is Elton John af, lol. \nI reeeeeeally Wonder who that baby will be? \nDylan is totally playing another serial killer, imho.", "While I was hyped for episode 💯, I actually was ok with this episode as it would have had to be something spectacular to mark the occasion, but I think that would definitely have “killed” the season. Still a solid episode moving everyone forward & kudos to Brooke (there is still something that I think is going to pop up in the “final girl” episode with regard to her character) Benji, and anytime Montana opens her mouth. Love Margaret (supreme batshit crazy and those shoulder pads) Trevor (the John Holmes reference and his deadpan face as he was “blackmailing” Margaret) The Final Girl episode will be awesome. I am expecting a massacre for the ages at that music festival. Margaret will finally meet her fate or will she? If anything I am hoping that the origin of the camp will definitely explain a lot. Also, where is Jonas? I think he still holds a missing piece to this puzzle. I do like the way that they have paid special attention to this season as a fan of the slasher genre. Aside from some of the supernatural elements (not all, since technically Jason was awakened by lighting 🙄) the series has encompassed everything about the genre in the series thus far. Not everything has to make sense either (I still don’t know how /why Frita made those Benji traps at the camp.."], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "#AHS1984 Episode 6 Review & Synopsis\n\n► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r..."}