{"title": "POI S3E20 Death Benefit, p3 [Shaw]", "url": "https://www.youtube.com/watch?v=IbZzpKf1fEM", "image": "https://i.ytimg.com/vi/IbZzpKf1fEM/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "45502", "datePublished": "2016-07-15", "likes": "265", "dislikes": "13", "comment": ["This is one of the few times I choke on Finch’s rigidity. He could have stopped Samaritan more than once but this was his final opportunity. The machine wasn’t trying to stop Samaritan but save all the lives of all its victims who were the truly innocent in the same fashion it was designed, sacrifice one for many. Just because this guy was a terrorist in a stereotypical sense does not mean he wasn’t a major threat and Finch should have seen that as soon as he could not persuade the man. Finch said he sold the world for a dollar but he was wrong, he sold out the world to save his sense of self.", "The episode that shapes the rest of the story", "Great storyline and twist in the overall plot.", "This ending mindfucked me so hard once I saw Mcourt at the beginning of the next episode 🤯🤯🤯", "3:32 the way he looks back gives me goosebumps every fucking time"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Shaw, Reese, and Harold come to terms with The Machine's mission to assassinate the senator.\n\nEpisode summary:\nThe new number is Congressman Roger McCourt (John Heard), a self-described dealmaker; the team is initially baffled, since he has no enemies and there seems to be no danger to his life at all. They eventually discover a connection to Decima: McCourt admits agreeing to help Decima with favorable legislation in the Congress (granting Decima access to government surveillance feeds), while Decima gives him insider stock trading tips. Reese concludes that they are meant to be the danger, as the Machine wants them to kill McCourt in order to prevent Decima killing many more people. Harold is disturbed at this conclusion, and leaves the team, not wishing to participate in an assassination. McCourt is secretly left alive, and proceeds with Decima's plan. Greer also approaches a reluctant Senator Garrison, offering him a 24-hour beta test of their machine. Garrison agrees, and Greer immediately uses Samaritan to start to track down Finch. Meanwhile, Root is travelling across the country, dealing with various relevant threats.\n\nApril 15, 2014"}