{"title": "LOVECRAFT COUNTRY Episode 2 Breakdown, Theories, and Details You Missed!", "url": "https://www.youtube.com/watch?v=iLAyBVBxq5c", "image": "https://i.ytimg.com/vi/iLAyBVBxq5c/maxresdefault.jpg", "author": "Think Story", "viewCount": "101532", "datePublished": "2020-08-24", "likes": "3,702", "dislikes": "43", "comment": ["You and Me + 🐍🍆?", "I cried my eyes out when Uncle George died, despite the foreshadowing in episode 1. I hope there's a way he's still in the show.", "What if the abuse from Montrose toward Atticus was for another reason? I think Montrose beat Atticus, because despite swearing up and down that Atticus was His son, all of Tic's character traits were those of Montrose's brother, George. Proving what he'd always known in the back of his mind...That Tic was really George's son. It may have also been the reason he drank so much.", "This episode was a nod to white men like him has been doing for years they feel superior yet he needed Atticus to achieve what he wanted hence the part where he told atticus he was disposable yet shot the uncle and Leti to put fear in him do he would do the ritual because he knew he needed him and he was not disposable manipulating them with material things and only the one they really needed remembered what happened and ended up using his power and Turning them to stone and destroying the place like the lady he saw which he is a descendant of", "Why do I see white ppl in here saying they tired of shows about race something that didn’t directly effect you at all why are you bothered imagine watching the sundown episode and being black and actually knowing this happened to somebody down your ancestry line and this was in the 60s not so far away stop saying you tired of something imagine being black having to watch interpretations of what happened to ppl we will never know about because our history is tattered"], "authorLink": "https://www.youtube.com/channel/UC34Qdd5Z5KN30A8aJ2eIMPA", "description": "In this video we take a deep dive and breakdown episode 2 \"Whitey's on the Moon\" of HBO's latest series Lovecraft Country based off the book by Matt Ruff. Review, recap, and easter eggs! \n\nLovecraft Country Episode 1 Breakdown: "}