{"title": "Good Omens Good — Bad Theology Bad", "url": "https://www.youtube.com/watch?v=IXpitEz7mYM", "image": "https://i.ytimg.com/vi/IXpitEz7mYM/maxresdefault.jpg", "author": "Speak Life", "viewCount": "5586", "datePublished": "2019-06-24", "likes": "191", "dislikes": "22", "comment": ["In their other books, Gaiman and Pratchett both reject the idea of Death as an enemy, both of them wrote versions of Death that are beloved by fans, so it's not surprising that Good Omens is also uninterested in defeating Death.", "\"What did he say?\" \n\"Be kind to each other.\" \n\"Yep, that'll get these guys going.\"", "This is one of the most helpful looks at good omens I have come across: I have read the book and am watching the show and they are fantastically written and acted respectively. I have been working through how to respond to the viewpoint of the show and I think you have it spot on", "Very well said. This is a comedy, based on a book by two very well renowned fantasy authors. The authors don't expect anyone, christian or not, to think the way the story is portrayed is not ridiculous. This is not meant to be an exposé on religious beliefs.", "I love this video because it is exactly what i felt about this show. It’s a good show! Obviously there are some huge theological differences but like also....\nTo Christians who rant against this show, it’s written by a non-Christian, why are you expecting a sermon? 😂 I watched this with my dad whose a southern baptist pastor and we loved it! We were there for some comedy and prodding theological questions about the nature of angels and demons, not for spiritual wisdom!"], "authorLink": "https://www.youtube.com/channel/UCJjwJMzkkVyXg3BNGUMcT0g", "description": "#GoodOmens \n\nA Christian group has petitioned Netflix to pull Good Omens from its streaming service, despite the fact its actually on Amazon Prime. Here Christian minister, Glen Scrivener, responds to the controversy and its Christians themselves that are in for criticism.\n\nGood Omens portrays a ridiculous picture of heaven and hell, largely because too many Christians have proclaimed a ridiculous picture of heaven and hell. In this video we see that heaven does not fight hell to destroy the world. Heaven triumphs over hell to save the earth. THAT’s a good story.\n\nspeaklife.org.uk"}