{"title": "SHE DIES TOMORROW Ending Explained!", "url": "https://www.youtube.com/watch?v=j0ztndE2If0", "image": "https://i.ytimg.com/vi/j0ztndE2If0/maxresdefault.jpg", "author": "Think Story", "viewCount": "40085", "datePublished": "2020-08-08", "likes": "1,280", "dislikes": "43", "comment": ["If I die tomorrrow...", "I don't think the parents killed the kid, I think they stabbed Jane. If I remember correctly, the dad asks, \"Should we wake her?\" and the mom says, \"No, let it happen in her sleep.\" In the scene before that, the mom blames Jane for infecting them all and says something like, \"You know what we have to do.\" I think they went to Jane's place and stabbed her, but she just didn't die right away.", "I think the movie has a low key major focus on how we treat people. All of the people in the movie were relatively shitty people, not even Jane cared her friend until she got “infected”. I think the movie was more of a subconscious reflection on how we treat people that reach out about suicide.", "To me the anxiety isn't coming from the fear of death but rather  from having life long regrets. In each of the characters this manifests itself in different ways. For example Amy regrets the termination of a pregnancy. Her boyfriend cherishing solitude but never being able to find friends. Jane who never fully realizes her potential. We see her searching to make some important discovery, that will give her life purpose that is never forthcoming. The couple who come to the realization that their investment in their relationship has been all in vain; the regret of wasting your time with people who don't love and value you. However towards the end when Jane goes wounded into the home of those two chicks who both seem laissez faire about dying we see a release.  In my opinion there was a sense of catharsis because they both have embraced their mortality.  It is here we watch Jane go into the pool surely to bleed to death, climbing on top of a pink flamingo float. Just like the other two she has made peace with dying. To me that's why we fear death mainly because we feel that we haven't accomplished all the things in life we wanted, that we never made amends with family-friends.", "I think Jane is an artist, rather than a scientist - the samples are her subject. She talks about getting a sudden burst of inspiration before the party, she has her computer set up to take still images of the slides and her work appears on her brother's wall."], "authorLink": "https://www.youtube.com/channel/UC34Qdd5Z5KN30A8aJ2eIMPA", "description": "In this video we take a deep dive, review, recap and explain the ending to \"She Dies Tomorrow.\"\n\nFollow me on twitter: http://twitter.com/thinkstoryYT"}