{"title": "POI S4E16 Blunt [Root x Shaw, Root]", "url": "https://www.youtube.com/watch?v=JawVie4EhiI", "image": "https://i.ytimg.com/vi/JawVie4EhiI/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "40678", "datePublished": "2016-08-16", "likes": "181", "dislikes": "4", "comment": ["Thank u for all your playist, for all your videos for everything thank you so much you are amazing ❤️", "Root ❤️", "Rosineide  dos  Santos Souza 💔💔💔💔💔💔💔👄💝😍😘👌", "Ohhhhh Amy"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Episode summary:\nReese works to save the life of Harper Rose (Annie Ilonzeh), a grifter who is targeted by Dominic after she steals a large amount of money from a legalized marijuana dispensary. Her actions result in two of Dominic's men who were acting as security in a money laundering operation being targeted and killed by the Parral Cartel who were tipped off by Harper. Enraged by her actions, Dominic tracks down her boyfriend, Trey, and interrogates him for information on Harper. Reese reaches out to Dominic and offers to return the money stolen by Harper in exchange for Trey and the hit being called off on Harper, but he's not interested and demands that Harper be handed over. In a face-to-face meeting in a diner, Dominic complains that Elias seems to get a pass. Reese tells him he and Elias stay out of each other's way, and that he and Dominic could also stay out of each other's way if Dominic stops targeting innocent people. Harper then decides to visit the Estonian mafia after suggesting the plan to Reese and Finch and tells them about Dominic's money laundering operation, and lures them to Dominic's location while Reese rescues Trey. Fusco and the NYPD arrive and arrest the Parral Cartel, initially on possessing weapons illegally. Dominic and his crew are quickly released when he produces legal documents that show the guns they are using are registered to his private security company. During the bust, Dominic attempts to recruit Harper while Reese watches on. She's not interested, but he leaves the door open for her if she changes her mind. Harper then apologizes to Trey for her actions, and also immediately breaks up with him. Meanwhile, Root tries to sell an application she developed at The Machine's request, which she hopes will aid in trying to defeat Samaritan.\n\nFebruary 24, 2015"}