{"title": "POI S5E05 ShotSeeker, p2 [Root]", "url": "https://www.youtube.com/watch?v=Jgft5_d1cgg", "image": "https://i.ytimg.com/vi/Jgft5_d1cgg/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "17007", "datePublished": "2016-06-21", "likes": "77", "dislikes": "6", "comment": ["Just imagine a few months ago she didn't care if John lived or died, here she is hell-bent on finding him alive. POI did the best job at redeeming former morally corrupt characters like  Fusco, Root, and Elias, who, by the way, was one of my favorite characters right after Reese and Carter."], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root and Finch look for Reese.\n\nEpisode summary:\nReese protects an NYPD analyst named Ethan Garvin who works with a highly sophisticated acoustic surveillance system called \"ShotSeeker\", designed to detect gunshots anywhere in the city. Samaritan had Ethan's friend Krupa killed because of her research and tries to cover her murder and the existence of her work, and does so to extreme measures, including hacking ShotSeeker to engineer Garvin's death via suicide by cop, and having an operative kill Krupa's classmate and possible witness to her shooting. Meanwhile, Fusco is approached by Elias's associate and childhood friend, Bruce Moran (James LeGros) to learn who killed his longtime partner and boss. Root meets Jeff Blackwell and tries to open his eyes about the true nature of his new employer. By the end, Fusco has investigated so much about the threat on Garvin and Krupa that Samaritan labels him a \"potential obstructionist\". Root and Finch decide to make public the research from Krupa's hard drive to render Garvin no longer a threat in the eyes of Samaritan, whatever the nature of the research. Pressured by Bruce, Reese and the rest of the team decide to show him they've been hiding a still alive Elias, recovering from his wound, and apparently conscious of Samaritan's existence and danger. Elias encourages Bruce to go back to the shadows and embrace them. Finch and Root engineer a series of simulations in a Faraday cage between a small clone of the Machine and a small clone of Samaritan, but as the simulations progress, every outcome is in favor of Samaritan, going to billions of victories."}