{"title": "The Freaks of AHS review Murder House", "url": "https://www.youtube.com/watch?v=K7M8Rqzuw1M", "image": "https://i.ytimg.com/vi/K7M8Rqzuw1M/maxresdefault.jpg", "author": "MaryGirl Moody", "viewCount": "822", "datePublished": "2018-07-08", "likes": "59", "dislikes": "0", "comment": ["I don't get the hate for Murder House as well. I feel like it's a very solid story. There are far worse seasons.", "I just binged watched Murder House and absolutely loved it a second time around watching it. Mary. The scene where Billie Dean mentioned the line of Prisons and Asylums... Could that have been foreshadowing that we could potentially see a Prison theme in the future seasons? I wouldn't mind that but I really want the timeline to take place in the early 1900's.", "Murder House is what made me want to see what new seasons of AHS would be like. Evan Peters plays Tate so well, I was fascinated by his crazy. I also agree he was unforgivable", "Why do you hate Murder House so much?? (especially the guy you are talking with, sorry i don't remember his name) I think that the writing for Ben and Vivian and supposed to make them somewhat unlikeable. I feel like Tate, Violet, Chad, and Moira and the only likable characters. I agree with what you say when you said that Tate was putting on this character to pull in Violet. And that makes it even more scary. But I completely disagree with everything you say about Violet. Also with what you said in the stream about Violet seeing Moira as a young woman. I rematch Murder House recently and she saw her as an old woman. When she was talking to be about him cheating she said something like. \"...old ladies with feather dusters, I'm surprised you haven't gone after me.\" In my opinion everything about Murder House was great.", "Ben was mourning. He lost his wife, his daughter, a newborn son,.   On top of this, he stated to Tate that he had a rough childhood as well.  He was already “fragile.”"], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r...\n\nIn anticipation for the crossover, MaryGirl Moody reviews American Horror Story Murder House with special guest Casey Soper.\n\nFacebook: "}