{"title": "Did The Waking Dead Ruin Daryl Dixon?", "url": "https://www.youtube.com/watch?v=kGJ5rQF-TOE", "image": "https://i.ytimg.com/vi/kGJ5rQF-TOE/maxresdefault.jpg", "author": "Reel Talk", "viewCount": "308", "datePublished": "2021-05-04", "likes": "17", "dislikes": "0", "comment": ["Daryl met leah by a time when he was still immature/grieving/broken/lonely. \n\nTheir relationship was based on sharing similar trauma and relationships based on haring trauma never lasts that long.\n\nDaryl met Connie with the right time. He came back from the woods and stopt looking for Rick and when Alpha came at the hiltop gates to take Lydia. It was the first time that he stepped as a leader.", "He’s never been a personal favorite of mine. I’ve always thought the whole “If Darryl dies we riot” hype was ridiculous. I was pissed when he got Glenn killed and thought it was unrealistic how easily he was forgiven.", "OK guys I think I have finally figured out the 10 possible different levels of Ultra Instinct in Dragon Ball Super.......", "I think Leah is part of the reapers (skull tattoo , military dog , she was military ) they needed a conflict that’s both physical and emotional for season 11 for Darryl . I think she’s gonna be an an antogonist that redeems herself at the end but dies . Angela Kang said Leah is meant to be a mirror of Daryl very similar but they make different decisions and what is the effect of that . I think Virgil and Connie end up victims of the reapers and Daryl saves Connie etc idk haha I’m probably overthinking . I do think that Daryl and carols show is like the bridge to the rick movies they go off to find him after finding out about crm and commonwealth", "Carol and leah are too much like Daryl. They both run away, can't let the death of their kids go, don't wanna be part of the community. They are both desperately lonely and severely grief-stricken, and that is why both of these women wouldn't make a good romantic match for Daryl. \nWhen Daryl is at his darkest, he tend towards negativity and self-destruction when he encounter grief. That is why he needs someone more optimistic/sweet/cheerfull like Connie to balance him out just like Maggie and Glenn. Glenn was more optimistic and hopefull character and the same goes for Rosita and FG and for Carol and Ezekiel. "], "authorLink": "https://www.youtube.com/channel/UC4GPRqEoZ4zpnTHIxcG5JyQ", "description": "Did The Waking Dead Ruin Daryl? With the appearance of Leah in Season 10c, it would seem that Daryl's sexuality and relationship building has been blown wide open. Let's discuss!\nTwitter: https://twitter.com/ReelToRealPro"}