{"title": "POI S3E11 Lethe, p6 [Shaw]", "url": "https://www.youtube.com/watch?v=KlVRGgz3tNM", "image": "https://i.ytimg.com/vi/KlVRGgz3tNM/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "10412", "datePublished": "2016-07-06", "likes": "66", "dislikes": "1", "comment": ["Season 3 delivered some of the greatest scenes of the entire series! I remember the first time I saw this... brilliant. I love Control & Hersh.", "I still get chills when I rewatch this scene, and he turns totally lucid and explains that Dianne is dead.", "The truth fears no question. Control is perfectly wise to lay the trap. It was all a ruse.", "the machine, even when not talking to admin, is still looking out for him. cute", "2nd Comment"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Oh no! Shaw and Finch find out that the number's wife is really Control! And she wants Samaritan!\n\nEpisode summary:\nAfter Carter's death and the war with HR, Reese leaves the POI team and heads for Colorado, where his father had lived. Meanwhile, the Machine provides a new number to Harold, who at first is reluctant, but eventually accepts it on Root's insistence. The number belongs to Arthur Claypool (Saul Rubinek), Harold's close friend during his days at MIT. Claypool has been diagnosed with a brain tumor and is being monitored at the hospital. Shaw disguises herself as a doctor to get close to Arthur, who is kept under Secret Service protection as he inadvertently spills some top secret information about a project called Samaritan. Flashbacks to Harold's teenage life are shown, where the initial idea for creating the Machine emerges in response to his father's memory loss. Arthur's wife, Diane (Camryn Manheim) tells Shaw that Arthur works for the NSA, and Collier's group Vigilance tries to abduct him. Shaw, Harold, Arthur and his wife escape to a hotel, where Harold talks to Arthur to get more information about Samaritan. Arthur describes his involvement in the creation of an AI like the Machine, but mentions that the project was shutdown. Fusco finds Reese in Colorado, where he tries to persuade Reese to come home before they fight outside a bar. As Arthur talks with Finch, he remembers that he buried his wife two years earlier, and the lady pretending to be Arthur's wife Diane reveals herself as Control. Her agents, led by Hersh, barge into the room and capture Shaw, Arthur, and Harold. Control threatens to kill either Arthur or Harold—whoever does not give up the location of his respective Machine. The episode ends with the Machine analyzing threats to its assets and itself, along with Arthur's machine, Samaritan, having its status changed from \"Deactivated\" to \"Unknown\".\n\nDecember 17, 2013"}