{"title": "Good Omens Crack: Episode 4", "url": "https://www.youtube.com/watch?v=l0fjnosPUCk", "image": "https://i.ytimg.com/vi/l0fjnosPUCk/maxresdefault.jpg", "author": "Christi Hodges", "viewCount": "24566", "datePublished": "2019-07-19", "likes": "1,670", "dislikes": "11", "comment": ["The lilo and Stich part 🥰. Crowley does resemble the chaotic good of Stich 😂", "\"You babe swaddled in the cashmere blanket of ignorance, you ask too little of ME!\"", "oh... Welcome to TADFIELD!\nAll hail the glow cloud", "Crack videos gives me life, and yours are a breath of fresh air!", "I commend your music selection, you’ve got quite the spread. Everything from rock to country to classic to... bebop"], "authorLink": "https://www.youtube.com/channel/UC3EgPJ8L_1767DobPwzy_rA", "description": "HOT OFF THE PRESSES, EPISODE 4!\n\nThanks again to everyone for giving my little videos a chance in this big YouTube full of great Crack videos, I appreciate each and every view, like, and comment I get, and if I haven't gotten around to responding to your comments I'm working my way to them!\n\nI don't own anything in these except the time spent splicing clips and audio together.\n\nAs always, audio sources below:\nPlease Clap (Jeb Bush)\nBlue Oyster Cult - Burning For You\nFlight of the Bumblebee\nPolygon's Unraveled - Understanding Kingdom Hearts (And Every Other Story)\nLooney Tunes - Left Turn At Albequerque\nAustin Powers Theme \nJohn Mulaney - This Might As Well Happen\nLonely Island - Like A Boss\nMy Brother My Brother and Me - Teens on Tumblr (text posts courtesy of Tumblr users hat-engineer, go-sideblog, and ajcrowleyinvented)\nMonty Python - Monks Song\nWelcome To Night Vale - Episode 2: Glow Cloud\nJohnny Paycheck - Take This Job And Shove It\nFrank Sinatra - Fly Me To The Moon\nThe Partridge Family - I Think I Love You\nSay Anything - Alive With The Glory Of Love\nStar Wars: Return of the Jedi - Convenient\nLilo And Stitch - Send Me An Angel\nJohn Mulaney - Eat Ass, Suck a Dick, and Sell Drugs\nHocus Pocus - Come Little Children\nJohnny Bravo\nHamlet's Soliloquy (as performed by David Tennant)\nCriss Angel Mindfreak Theme\nTerminator 2 - Hasta La Vista\nFuck This Shit I’m Out\nYes - Roundabout (Jojo Ending)\n\nEpisode 5 coming up in a few days!  (True story, all of them are done except episode 7, and it's gonna be twice as long to go out with a bang!)"}