{"title": "POI S5E13 return 0, p4 [Root x Shaw]", "url": "https://www.youtube.com/watch?v=Lbg6886lRgU", "image": "https://i.ytimg.com/vi/Lbg6886lRgU/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "40698", "datePublished": "2016-06-22", "likes": "190", "dislikes": "1", "comment": ["why did they killed root. It's so sad, their whole relationship has been destroyed. I mean look at shaw, do you think that she could ever love someone like she loved root?", "If you pause at 2:25 if you look slightly under Shaw's left eye you can see light reflecting off a patch of water. Proving that Shaw did in fact shed a tear. It trickled when it cut to the shot behind her back, but the reflection of the water spot proves she shed an actual tear. 😭", "When the machine was talking to Shaw and told her it was dying, it had a \"Charlotte's Web\" vibe to it", "Why root had to die...they did all of that to make them come together have a chance to be together and then boom kill her like lexa on the 100 like that sucks big time", "Are you kidding me, neither of them thought to check him for a knife, really?  Particularly Shaw, given how she is, and especially after she was shot by him."], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Shaw meets the guy who shot Root.\nTM!Root gives Shaw a message from Root.\n\nEpisode summary:\nAfter the uploading of the Ice-9 virus, it begins to have disastrous effects globally. The Machine determines that Samaritan has uploaded a copy of itself to servers in the Federal Reserve where Finch and Reese go after it. The two reach Samaritan's servers and infect them with the Ice-9 virus, but Samaritan is able to upload a compressed version of itself to an orbiting satellite where it will be able to return to Earth unharmed by the virus. The Machine warns Finch of this along with the fact that the building Samaritan is using for the upload will be destroyed by a cruise missile. The only way to defeat Samaritan is to upload a copy of the Machine to the satellite to battle Samaritan, but the person who does it won't survive. Having been wounded in a gunfight, Finch locks Reese in the vault to save him while he sacrifices himself to destroy Samaritan. At the same time, Fusco and Shaw come under attack by Samaritan agents led by Jeff Blackwell. They are able to escape on the Machine's train, capturing Blackwell as they go. The Machine passes on a final message to Shaw from Root before she realizes Blackwell killed Root. However, Blackwell seriously injures Fusco before making an escape. As Finch waits for the moment to upload the Machine to the satellite, the Machine muses on the importance of human life with Finch who realizes he's on the wrong rooftop, having been tricked by Reese and the Machine. Reese tells Finch he plans to sacrifice himself to save Finch as he understands that saving one life can make a real difference depending on the person. The Machine tells Finch its realization about human life: everyone dies alone but if you are remembered afterwards, maybe you never die at all. Recognizing the Machine and Reese are right, Finch leaves as Reese holds off Samaritan agents, guided by the Machine in its final moments. Reese's sacrifice enables the Machine's copy to be uploaded to the satellite where the Machine destroys Samaritan once and for all. A week later, the world recovers from the Ice-9 virus and Blackwell is tracked down by Shaw who kills him in revenge for Root's murder. She meets with a recovering Fusco while the Machine's copy downloads itself from the satellite back into Finch's computer systems before contacting Shaw with a new number while Finch returns to his former fiancé.\n\nJune 21, 2016"}