{"title": "Personal Interest. Russian Movie. Detective Melodrama. English Subtitles. StarMediaEN", "url": "https://www.youtube.com/watch?v=lCDFeppP4ZQ", "image": "https://i.ytimg.com/vi/lCDFeppP4ZQ/hqdefault.jpg", "author": "StarMediaEN", "viewCount": "3788223", "datePublished": "2017-07-06", "likes": "12,759", "dislikes": "1,756", "comment": ["Well, a simple plot actually. And yet it still lovely represents the reality of life. It's touching😍", "Ótimo filme, só não posso dizer que entendi uma só palavra! Mas a história em si ,conta tudo. Gostei muito, principalmente no final!", "Estamos  no Brasil  e  falamos português. Os filmes em outra  língua  precisa  ser dublados.  🤗😎😇😤🇦🇷😁💕💖", "A few more movies like this one, and I will start to feel what Russian soul is all about.\nThank you for posting. A Slavic Canadian", "I was just looking for a movie to improve my English and then I found a great Russian movie. I really enjoyed it, thank so much for sharing it with us. Greetings from Brazil 🎥🎬🍿😍"], "authorLink": "https://www.youtube.com/channel/UCuSx-lf2ft7hPceGVNHybOw", "description": "Tatiana makes her escape from prison and seeks a hideout in a remote village of Pavlovka, in her late grandmother’s house. There she meets Maxim who has come to the village to take a break from the hectic city life. Instant chemistry sparks between them. Everything would be just fine were it not for Tatiana’s ex-boyfriend, Oleg, who comes to the village looking for her.Tatiana is forced to tell Maxim the whole truth about herself. She tells him about the robbery she committed together with Oleg and how she took all the blame on herself and then escaped from prison.Maxim assures her that he will be by her side no matter what and will help her get through all this. But things are not as simple as they seem, because Maxim isn’t who he pretends to be…\n\nType: film\nGenre: detective melodrama\nYear of production: 2015\nNumber of episodes: 90 minutes\nDirected by: Anatoliy Grigor'ev\nWritten by: Alla Zagorodnya feat Anton Streltsov\nProduction designer: Mikhail Shevchenko\nDirector of photography: Aleksandr Krushtalovuch\nMusic by: Nikita Yanoschuk\nProducers: Galina Khrapko, Vlad Ryashin\nCast: Galina Bezruk, Kirill Zhandarov, Aleksey Nagrudnuy, Viktor Kuznetsov, Irma Vitovskaya, Valeriy Bassel\n\nWatch online for free:\nPersonal Interest. StarMediaEN. Detective Melodrama. English Subtitles "}