{"title": "POI S5E03 Truth Be Told, p1 [Root]", "url": "https://www.youtube.com/watch?v=lQ2IZerjlTI", "image": "https://i.ytimg.com/vi/lQ2IZerjlTI/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "58757", "datePublished": "2016-06-21", "likes": "285", "dislikes": "12", "comment": ["Cant stop laughing on roots innocent question \" AARON ARE YOU OK?, WHAT HAPPENED😂😂😂😂", "I always had a difficult time accepting Root as a good character, or her turning good, after she was so evil in the beginning. But Reese is redeemed as well so I can't say much.", "Loved person of interest brilliant so sad they are not making anymore BEST EVER intelligent smart and the best show for a very long time.👍👍👍👍👍👍👍👍", "Funny how Finch winced when Root clocked the delivery guy. He's probably right about that guy not flirting any more with her.", "even the programmer sounds robotic"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root as a delivery driver.\n\nEpisode summary:\nIn flashbacks to 2010, Reese and his partner Kara Stanton from the CIA are told by their supervisor to investigate a soldier and kill him after confirming that he is selling information to the Taliban. In the present day, the Machine gives Finch and Reese the number of Alex Duncan (Stephen Plunkett), who turns out to be the brother of that soldier, and who has found himself in trouble with the CIA by investigating his brother's death, since doing so could expose an off-books operation, threatening the careers of the powers that be within the Agency. Reese rescues Duncan from his old boss, Terrance Beale (Keith David), the very same agent who sent Reese and Kara to kill Duncan's brother and they lie to Duncan about his brother's death; Reese leaves on good terms with Beale, who agrees to keep the fact that Reese is still alive a secret. Meanwhile, Finch and Root investigate malware that Samaritan has been using to infect the firmware of electronic devices, and, prompted by a message from the Machine, Root runs the malware on an airgapped laptop disconnected from any external sources. Reese decides he can no longer see Dr. Iris Campbell for the time being, claiming that he is unable to lead a \"normal life\", after which he receives another number from Finch.\n\nMay 10, 2016"}