{"title": "Avatar: The Last Airbender is Worth Your Time", "url": "https://www.youtube.com/watch?v=lvePx7OWwmM", "image": "https://i.ytimg.com/vi/lvePx7OWwmM/maxresdefault.jpg", "author": "Five by Five Takes", "viewCount": "15901", "datePublished": "2020-04-21", "likes": "1,533", "dislikes": "4", "comment": ["The most dissapointing thing is, when you recommend ATLA to someone and they totally dismiss it.", "You've convinced me to watch this series on Netflix and good job on the first video btw", "I was bored when I decided to watch Avatar on Netflix.\n\n I chose to ask my friends what I should watch. They told me to watch SpongeBob and Naruto. Don't get me wrong, I bet they're both great but I decided I wouldn't watch them.", "An absolutely 100% spot-on \"why you/everyone should watch A:TLA\" primer. Bravissimo!\n\n\nAmong so, so many things the show does right: Humanizing of \"villains.\" Showing that sometimes the \"good guys\" can go too far, get carried away, and fall into bad pathways. Showing the struggle over how to win a fight without compromising your dearest-held beliefs. Having fun and covering weighty topics both without laughing at or talking down to the audience.", "You have now gained my subscription, and I await  what comes next: just came from your \"Love Letter to Korrasami\" and while I still need to watch some of the other shows you have covered (want to avoid spoilers) but as soon as I get to watch those shows, and even then I might just watch them regardless. Keep up the amazing work!!"], "authorLink": "https://www.youtube.com/channel/UCC2Bw649-AJJWJDX74f85qg", "description": "Hey friends! Let's start off the channel with something we have been cooking up for years now, and was basically the inspiration to create this space to begin with. We are two people who love nothing more than storytelling and finding the beauty and meaning in it. Avatar means the world to us and has our whole lives, hopefully it does or it will mean something to you too. - Sara and Fox\n\nTwitter: "}