{"title": "Person of Interest - Redemption - Reese & Carter", "url": "https://www.youtube.com/watch?v=m2u28uqEGw0", "image": "https://i.ytimg.com/vi/m2u28uqEGw0/maxresdefault.jpg", "author": "quietfireca", "viewCount": "49720", "datePublished": "2012-05-25", "likes": "277", "dislikes": "5", "comment": ["I really miss Carter", "Great video. Loved watching Joss & John together. Broke my heart when they killed her off.\nSo hard watching the show without her, I think John is the only person sad she is gone.", "I agree this is truly beautiful, thanks for the video.  I've watched every episode and I think you described these characters perfectly.  Great job!", "THIS IS BEAUTIFUL!! This is such a perfect song for the show!\nAmazing vid!", "Beautiful! I totally captured the heart of this show!"], "authorLink": "https://www.youtube.com/channel/UCipsqsNR-iWQRlcO4XrL3Wg", "description": "Something really bad has happened to this video over time.  I've re-uploaded it on my new channel here: http://youtu.be/PVq92-iFdWM \nThe story of John Reese is shrouded in mystery and is poignant as it is revealed.  He is trying to redeem himself for past transgressions after falling to the depths of despair.\nHarold Finch has given him a path to redemption.  Carter is allowing his redemption.\nRedemption is a common thread here:  \nFusco is trying to redeem himself for straying.\nFinch is trying to save lives, almost as though he is redeeming himself for creating the machine.\nEven Carter is working on redemption for almost having Reese killed.  She now protects him and has realized that instead of a cold blooded killer \"that somewhere in you, there is a good heart.\" She keeps him grounded. He asks for her trust and she gives it.  \n\nPerson of Interest has many missing pieces and lost souls, all making for wonderful entertainment and characters that are easy to love.  \n\nSong credits are at the end of the vid.\n\n\"Copyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\""}