{"title": "American Horror Stories: Episode 4 Review", "url": "https://www.youtube.com/watch?v=m6kOcDH9GaI", "image": "https://i.ytimg.com/vi/m6kOcDH9GaI/maxresdefault.jpg", "author": "Reel Talk", "viewCount": "3043", "datePublished": "2021-07-28", "likes": "109", "dislikes": "17", "comment": ["Personally I didn't much care for the ep. The series in general so far has been a real big let down. The last 2 eps for me felt like re-runs of Are you afraid of the Dark or Goosebumps with just slightly more blood. If the kills were a little more original and interesting I might've enjoyed it more, but one dude just getting his neck twisted and another getting shot with an arrow 😑😒🥱... Last week I enjoyed the look and take on the zombie genre but that was only like 3-5 minutes of the episode. And the same thing I feel happened this week, the episode took so much time building these characters, making you really dislike them only to kill them off in rapid succession in fairly lame ways. It was cool to see Danny in the ep but again, he had just 2-3 minutes of screen time. I guess I'm a little confused with what this show is actually trying to be. But hey, fingers crossed for the next one 🤷‍♂️", "I actually really liked this episode. No, it wasn't scary or your traditional AHS story, but I love it regardless. Normally, when TV shows try and make influencers or youtubers as characters, they get it soooo wrong and it's just cingey. We're so used to it being cringey that when something like this is made, it's easy just to label it as \"cringworthy\" but for the first time EVER, I think TV has nailed exactly how influencers act. Their egoism feels realistic. It also feels dumb, but that's why it feels real. I feel like a lot of people are mistaken the second-hand embarrassment they felt for the characters during this episode as nothing but cringe. Again, I don't feel like calling this episode \"cringey\" is a valid argument.", "Reminded me of that Tales from the Crypt episode that’s been remade several times. Loved it though. Appreciate that none of the guys escaped.", "you are expecting a plan the producers didn’t have in the first place. \nHonestly I think Stories is a descendants movie. Have you noticed that so far everything is focused on young people/characters where AHS(y) are mostly adults? The creators are trying to make stir interest of younger crowds who will not sit through a long arduous season of one story by instead having short “stories” aka a new 30 min sitcom story each week. These kiddos may be the descendants (stories) of the original story characters. It is the CW version of AHS. For instance, The 3rd story puts me in the mind of the Apocalypse couple (in the past (stew/Stu) and after micheal). The first story is more obvious. This one (4) mimicked cult. Just a thought.", "Would say at the moment Drive-in is my favorite episode, Rubber woman (1) was pretty good even though I've been over Murderhouse for the longest. The naughty list was cringy but also not that bad, love the calling out YouTubers like this, and Rubber woman (2) has been my least fav, it honestly bored me. I hope and have a feeling the 5th and 6th episode is going to be the best!"], "authorLink": "https://www.youtube.com/channel/UC4GPRqEoZ4zpnTHIxcG5JyQ", "description": "American Horror Stories: Episode 4 Review \"The Naughty List\". Danny Trejo is Santa in the BEST episode of the AHS spinoff so far. American Horror Stories is proving itself to be an interesting show and one that might be able to stand alongside its mothership. Let's discuss!\nTwitter: "}