{"title": "Love Letter to Korrasami", "url": "https://www.youtube.com/watch?v=MbFKyzO-1ow", "image": "https://i.ytimg.com/vi/MbFKyzO-1ow/maxresdefault.jpg", "author": "Five by Five Takes", "viewCount": "61093", "datePublished": "2020-08-15", "likes": "6,687", "dislikes": "31", "comment": ["\"Legend of Korra walked so She-Ra could run.\"\n\nAs much as that moment, in retrospect, sort of pales in comparison to other, later moments in animation, I don't think we should ever stop appreciating just how much this show paved the way.", "“This was the Avatars love, and it looked like mine too.” Alright that broke me. Wonderful video once again. I remember that finale like it was yesterday and everything you described (other than not shipping it initially) I felt too. I’m so glad this helped open the doors for other shows like She-Ra and more. It was truly a wonderful thing to witness.", "Korrasami just felt so natural to me. It wasn’t the big romance, the main driving force for the characters. It was just two women, growing closer, trusting each other with more of themselves than they do with other people, being friends and eventually more than that. It was a story about deep connection on multiple levels which helped both of them find not only each other but also themselves. ", "Korra as a character has been through so much suffering in her world, and even in ours with the amount of hate she gets from the fans. And yet, she still kept fighting. Eventually, slowly, and amidst all the chaos, she found balance.", "“this was the avatars love, and it looked like mine too” g o d... i have nowhere near the full context for this video in a narrative sense since i still haven’t finish atla or started korra but the way you two sew love into the very essence of the videos you make and the stories you tell with them i So Important and i’m so glad i get to listen to and watch the artistry you compile your thoughts with GOD"], "authorLink": "https://www.youtube.com/channel/UCC2Bw649-AJJWJDX74f85qg", "description": "hey friends! this has been in the works for a while now, and we really hope it speaks to you in the same way it does us. without korrasami, shows like she ra, dragon prince, and a lot more couldn't be doing it the way they do. thank you so much to everyone who's subscribed and said the most kind amazing words on the last two she ra videos!! we can't express the excitement and humbleness it makes us feel. stay kind.\n-sara & fox\n\nrecorded by: sara\nedited by: fox\nwritten by: sara & fox\nchannel twitter: "}