{"title": "American Horror Story Double Feature Trailer Thoughts!", "url": "https://www.youtube.com/watch?v=McYfg2cbyGk", "image": "https://i.ytimg.com/vi/McYfg2cbyGk/maxresdefault.jpg", "author": "Reel Talk", "viewCount": "1245", "datePublished": "2021-08-20", "likes": "72", "dislikes": "2", "comment": ["It's the writing that was the problem in Apocalypse and 1984 not the budget we all hate the ending of Apocalypse because we didn't get the epic show down as we wanted . I see that each Double feature episodes are written by Ryan and Brad for this season which is a good idea because they focusing on the show . I feel that Ryan and Brad haven't got the time to focus on Ahs as they have a lot of tv shows like 9-11 franchise and Pose and Ryan Netflix shows . But double feature does look fantastic I'm hoping it's going to be a good season", "Exited for this season because we have never really have monster on the show we've have more supernatural being like witches vampires ghost demons and the antichrist not real monsters now we are getting shark creatures or sirens and aliens hope to see werewolves in the future", "Ahstories has made me nervous about this season. Ahstories lowered the quality and love for murder house for me. I'm worried about the writing and hope it's nothing like ahstories. They really need to return to form this season. Bring back the horror and dread of seasons 1-2 but the camp and comedy of season 3( because we all know the creators want  to add comedy and camp to every season).The creators always pull me in every season with great concepts but poor execution. Every season has great moments that make them fun but for double feature to be successful they really need and editing,  strong focus on plot, great character archs. Which ahstories didn't have. I really hope ahstories wasn't trying to show off their new writing team. I so want double feature to be good and the trailers and concepts look great but every season always does. So cautiously optimistic.", "I have a feeling they are going to do Mccolley Colken like how they did Ariana in scream queens", "Excellent as always"], "authorLink": "https://www.youtube.com/channel/UC4GPRqEoZ4zpnTHIxcG5JyQ", "description": "American Horror Story Double Feature Trailer Thoughts! Seriously, after American Horror Stories, I think I'm more ready for this season than ever.\n\nCheckout Dallas' Breakdown:"}