{"title": "Castle Rock S1E04 Explained", "url": "https://www.youtube.com/watch?v=MomwVi1QIjk", "image": "https://i.ytimg.com/vi/MomwVi1QIjk/maxresdefault.jpg", "author": "Think Story", "viewCount": "49336", "datePublished": "2018-08-02", "likes": "1,425", "dislikes": "24", "comment": ["Here's another theory. When the skinhead presumably touched The Kid, his body became riddled with cancer. When Zelweski fist bumped the Kid, he later went on a rampage. If the next two people who touch his skin die of malnutrition or just drops dead, I think The Kid may be an aspect of The Four Horseman. With the first death representing plaque/tumors and the second war/death by violence.", "That ending was so unexpected and disturbing. I am so amazed how you find all the hidden Easter eggs and clues. The planning behind each episode and placement of these hidden Easter eggs goes beyond my imagination. This show is Emmy worthy", "Great video again. I wish Zalewski would've stayed around a little longer I really liked his character.\n\nIm hoping we get a scene where the kid touches Henry.. i wonder what would happen then..", "I think there’s a strong connection between The Kid and his touch bringing about evil or doom. Remember in the previous episode when he tells his cell mate not to touch him and the next morning, his cell mate is found dead of metastatic cancer? Presumably, he touched The Kid and was met with death, much like Zalewski goes on a rampage and winds up dead following the fist bump. My theory is that touching The Kid causes destruction, suicide, and catastrophe. Also, the song choice in this episode is important. The first song played is “Clap Hands” by Tom Waits and the song playing during Zalewski’s rampage is “Crying” by Roy Orbison which features the lyrics, “with the touch of your hand, you left me crying” and “you held my hand so tight.” There’s a message being conveyed.", "I really like your commentary on each episode. It’s direct and to the point without a ton of fluff. I’m a huge King fan and you caught a ton of Easter eggs I missed. Well done!"], "authorLink": "https://www.youtube.com/channel/UC34Qdd5Z5KN30A8aJ2eIMPA", "description": "I delve into season one, episode four of Castle Rock \"The Box\" and look at the hidden details, mysteries, easter eggs and Stephen King references. \n\nHelp me translate this video: "}