{"title": "POI S5E11 Synecdoche, p7 [Shaw, Root x Shaw, TM!Root]", "url": "https://www.youtube.com/watch?v=n-IDDWP8EQk", "image": "https://i.ytimg.com/vi/n-IDDWP8EQk/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "106225", "datePublished": "2016-07-03", "likes": "452", "dislikes": "20", "comment": ["Root 1.0 - sociopath in search of the machine\nRoot 2.0 - weird but likable sociopath working with the machine\nRoot 3.0 - lovable and dear friend using the machine to protect “her family”\nRoot 4.0 - Root is the machine turned sociopath, protecting her family that still loves and misses her", "Shaw is SUPER COOL!! She absolutely defies fear!! That's my Shaw! my favorite character!!!", "The script writers needed to come up with more indepth stories, as the characters are so AWESOME", "Every time I see Root die in episode 10 IT HURTS!", "the fact that shaw still haven’t accepted the passing of root"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Shaw and Reese save the President.\nTM!Root helps Finch get the virus.\n\nEpisode summary:\nReese, Shaw and Fusco travel to Washington, D.C. to protect their newest number, The President of the United States, which the Machine classifies this threat as extremely relevant—in terms of national security—but Shaw is worried about the implications behind Samaritan's neglecting to intervene. The threat becomes neutralized, but an inner-governmental privacy-activist group with a mole in the U.S.S.S. has turned the full force of the Secret Service on Reese and Shaw. The Machine has secretly enlisted Logan Pierce, Joey Durban and Harper Rose to secure a clever exit strategy, with each of whom camouflaging into various resourceful associations; when Reese and Fusco are extracted, they band together with Logan, Joey and Harper to discuss their enlistment by the Machine, what has happened and what is to come. Harold, meanwhile, is grieving over the loss of Root, and reaches a conclusion that brings him to a highly-secured government facility in San Antonio, Texas with a weaponized virus capable of destroying Samaritan but with significant collateral damage. Harold has become ready to go to any lengths, and Reese and Shaw prepare for their final battle.\n\nJune 7, 2016"}