{"title": "Good Omens On Vinyl Box Set Trailer", "url": "https://www.youtube.com/watch?v=n3RwoioeIaU", "image": "https://i.ytimg.com/vi/n3RwoioeIaU/maxresdefault.jpg", "author": "DemonMusicGroup", "viewCount": "1905", "datePublished": "2019-06-05", "likes": "38", "dislikes": "2", "comment": ["I absolutely love David Tennant as Crowley, but Peter’s voice will always be the true voice of Crowley for me. Something about his dark tone just really fits how I picture the character. Can’t wait for this vinyl version!’"], "authorLink": "https://www.youtube.com/channel/UCi5R5mrzXx4EK7FjUs7h4oA", "description": "Good Omens (BBC Radio 4) now on vinyl! http://smarturl.it/good_omens_vinylThe unique four 180g heavyweight heaven and hell split black and white vinyl — includes a laser-etched Side B — are presented in illustrated wallets inside a rigid, bound 16 page book, with exclusive sleeve notes written by Neil Gaiman and Dirk Maggs. \n\n“He is Nigh.”“He is? Already? How??”When Aziraphale (Angel and part-time rare book dealer) and Crowley (an Angel who didn’t so much Fall as Saunter Vaguely Downwards) learn that the Antichrist has been born on present day Earth, they agree to work together to prevent the End of Days. Eleven years later, all bets are off when innocent Adam Young discovers he has the power to bring about Armageddon. As the stage is set for a showdown between the forces of Good and Evil, the prophecies of Agnes Nutter, Witch may yet come true…For the first time ever on vinyl, Good Omens is adapted and co-directed for BBC Radio 4 by the award-winning Dirk Maggs (The Hitchhiker’s Guide to the Galaxy; Neverwhere; Stardust; Anansi Boys; The X-Files; Alien; Batman; Superman). It is based on the novel by Neil Gaiman and Terry Pratchett, now the basis for a major Amazon Prime TV series premiering in Summer 2019.Starring Mark Heap as Aziraphale and Peter Serafinowicz as Crowley, with Josie Lawrence as Agnes Nutter, Colin Morgan as Newton Pulsifier and Charlotte Richie as Anathema Device, the cast also includes Phil Davis, Harry Lloyd, Paterson Joseph, Rachael Stirling, Jim Norton, Nicholas Briggs, Neil Maskell, Steve Toussaint, Simon Jones, Julia Deakin, Mitch Benn, Louise Brealey, Mark Benton and many more including cameo appearances by Neil Gaiman and Terry Pratchett."}