{"title": "POI S5E13 return 0, p7 [Root x Shaw, TM!Root]", "url": "https://www.youtube.com/watch?v=N5hdjNLr7jM", "image": "https://i.ytimg.com/vi/N5hdjNLr7jM/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "44810", "datePublished": "2016-06-22", "likes": "276", "dislikes": "3", "comment": ["This has to be the most if not #1 emotional, painful, yet hopeful ending I've ever seen to a show. They wrapped it all up so beautifully. I think every single second of this episode was amazing. I can't believe they weren't nominated for an Emmy.", "it's been 4 years but still i want to believe that when Shaw was on the phone and at the same time The Machine said that it might not be an end, She meant that Root is somewhere here and somehow she managed to make  it out alive. there's just no other explanation for Shaw's grin at the very end.  she can't smile that hard just because a new number came. maybe it was all about Root. anyway, we'll never know it exactly", "I love the idea that even though Root is gone Shaw still has a small part of her, through the machine.", "Many years passed. I rewatch this legend again. I'm crying again. Because it is the most powerful and wonderful serial ever.  I can't exist without Root. She is the best. ...such Shaw, Harold, John, Fuscko and Carter. \nThank you, Person of Interest.", "Powerful yet painfull ending 😭"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Shaw + Bear\nMaybe this is just the beginning?\n\nEpisode summary:\nAfter the uploading of the Ice-9 virus, it begins to have disastrous effects globally. The Machine determines that Samaritan has uploaded a copy of itself to servers in the Federal Reserve where Finch and Reese go after it. The two reach Samaritan's servers and infect them with the Ice-9 virus, but Samaritan is able to upload a compressed version of itself to an orbiting satellite where it will be able to return to Earth unharmed by the virus. The Machine warns Finch of this along with the fact that the building Samaritan is using for the upload will be destroyed by a cruise missile. The only way to defeat Samaritan is to upload a copy of the Machine to the satellite to battle Samaritan, but the person who does it won't survive. Having been wounded in a gunfight, Finch locks Reese in the vault to save him while he sacrifices himself to destroy Samaritan. At the same time, Fusco and Shaw come under attack by Samaritan agents led by Jeff Blackwell. They are able to escape on the Machine's train, capturing Blackwell as they go. The Machine passes on a final message to Shaw from Root before she realizes Blackwell killed Root. However, Blackwell seriously injures Fusco before making an escape. As Finch waits for the moment to upload the Machine to the satellite, the Machine muses on the importance of human life with Finch who realizes he's on the wrong rooftop, having been tricked by Reese and the Machine. Reese tells Finch he plans to sacrifice himself to save Finch as he understands that saving one life can make a real difference depending on the person. The Machine tells Finch its realization about human life: everyone dies alone but if you are remembered afterwards, maybe you never die at all. Recognizing the Machine and Reese are right, Finch leaves as Reese holds off Samaritan agents, guided by the Machine in its final moments. Reese's sacrifice enables the Machine's copy to be uploaded to the satellite where the Machine destroys Samaritan once and for all. A week later, the world recovers from the Ice-9 virus and Blackwell is tracked down by Shaw who kills him in revenge for Root's murder. She meets with a recovering Fusco while the Machine's copy downloads itself from the satellite back into Finch's computer systems before contacting Shaw with a new number while Finch returns to his former fiancé.\n\nJune 21, 2016"}