{"title": "POI S5E10 The Day the World Went Away, p4 [Root]", "url": "https://www.youtube.com/watch?v=n97iaM3qFTs", "image": "https://i.ytimg.com/vi/n97iaM3qFTs/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "45484", "datePublished": "2016-07-02", "likes": "328", "dislikes": "9", "comment": ["Having a deep conversation about life. Then the guys with very large guns shows up. \n\nRoot: Hold my Gun while I get ready to take care of this...", "Everyone: that gun doesn't work like that\n\nMe: that car wouldn't flip and/or explode line that. That was some real Fast and Furious level physics there", "That same rifle is also in The Division. Awesome weapon. A does a lot of damage.", "True badass :)", "\"And a hair scrunchie thing.\""], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root shoots a giant gun from the roof of her car.\n\nEpisode summary: \nFinch's number comes up when his cover identity is compromised, due to a subconscious error, and Samaritan initiates a continuous dispatch of operatives on him. The team splits up in their escape, which results in Elias being killed by Samaritan agents while protecting Finch. The team rescues Finch from his potential capture, and Root explains in the car her current understanding of herself and everyone else to be \"information\" that can never truly disappear despite their deaths. Root is shot by Samaritan operative Jeff Blackwell and placed in critical condition, while the police apprehend Finch who is accused of treason. A devastated Finch provides a soliloquy on how he has chosen to abandon the principles he has long followed, and vows to kill Samaritan. The Machine calls Finch in the precinct, having taken on the voice of Root, who had died from her injuries. The Machine sets every criminal in the precinct free to allow Finch to escape; Reese and Shaw realize that Finch's number came up not because he was a victim, but rather a perpetrator against Samaritan.\n\nMay 31, 2016"}