{"title": "Ruby & Scarlett's Ending | American Horror Stories - Episode 7: \"Game Over\" (HQ Clip)", "url": "https://www.youtube.com/watch?v=nd3e2J38s54", "image": "https://i.ytimg.com/vi/nd3e2J38s54/maxresdefault.jpg", "author": "AHS Crave", "viewCount": "170541", "datePublished": "2021-08-19", "likes": "1,739", "dislikes": "45", "comment": ["Since the ending is ambiguous, I am just pretending that all of ahstories is just a badly written fanfic, and never happened", "compared to the rest of the series, kaias acting was decent in this one", "I could watch an entire season dedicated to Ruby and scarlet they are perfection ❤️🥰", "I heard that Murder House might be making a come back in AHS. It would be nice to see the all the old characters return and finally get a happy ending and to be put to rest. I think that could be a nice ending, but I also think how they left Murder house in apocalypse was perfect, too bad they had to change the timeline.", "The ending could mean either two things: The 3 murder house episodes from this spin off are just part of the game storyline Michelle or the mom invented and murder house is still untouched as it is since we left it from the apocalypse storyline OR all these 3 murder house episodes did happen and the ending scene with Michelle and his son is Michelle's heaven where everything worked out for her and she did move on as a ghost and the murder house is indeed burned down now and the ghosts could either have moved on or they are all just free now to be anywhere and may appear now to other seasons or spin offs even tho the lesbian ghost gf said she's the only one who stayed but we cannot rely on her being sure. And this episode is written by Ryan Murphy and Brad and I think its a brilliant way to put some last closure to murder house. Finally."], "authorLink": "https://www.youtube.com/channel/UC0xpCvB57MXDhrVOryp1z3g", "description": "Ruby & Scarlett's love story blossoms in \"Game Over,\" the seventh episode of American Horror Stories (the official AHS/American Horror Story spin-off)... or does it?"}