{"title": "POI S4E01 Panopticon, p1 [Root x Shaw, Shaw]", "url": "https://www.youtube.com/watch?v=NgXXEFVIEGg", "image": "https://i.ytimg.com/vi/NgXXEFVIEGg/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "75177", "datePublished": "2016-07-31", "likes": "434", "dislikes": "5", "comment": ["And that's my friends it's what I call chemistry.", "Shaw: \"I can stab you with my Stiletto!\" LOL", "0:32.\nDamm, Root! Only you could make drinking a milkshake so sexy! And that leg crossing was everything! So hot! 🔥🔥🔥🔥🔥🔥🔥", "\"Love the new look\".  \n\nNot sure how her \"look\" has changed.  She's still in all black.  Root has more of a new look than Shaw.", "I love shaw!"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root visits Shaw at her new department store cosmetics job.\nShaw and Reese are itching to work new numbers.\n\nEpisode summary:\nFollowing the rise of Samaritan, the team members have adopted cover lives: Finch is a visiting college professor, Reese is an NYPD narcotics detective, and Shaw works at the cosmetics counter of a department store. Out of the blue, The Machine gives Reese a new number for Ali Hasan (Navid Negahban), who has developed a covert communications network using old VHF television antennas laced throughout the five boroughs of New York, making it invisible to Samaritan. When one of Hasan's clients, a gang known as \"The Brotherhood\" forces Hasan to set up a network for them, Hasan plants a bomb in a burner cell phone he gives to one of the leaders, but Reese prevents the bombing. In response to the bombing, Hasan's son Ben is kidnapped by The Brotherhood, leading Reese to hire Elias and give him the largest heroin drug supply on the East Coast in exchange for helping to keep his NYPD cover clean and saving Hasan's son. Meanwhile, Samaritan agent Martine Rousseau (Cara Buono) arrives in New York to find anyone in the city that may be a threat to Samaritan's security. Harold and John meet in the park, where Harold gives him one of the phones which uses the invisible network Hasan had built, Hasan having decided to move his family elsewhere and start over. The Machine also sends a coded message to Harold through his cover's dissertation which leads him to a new underground hideout off of Decima's radar, using a forgotten Interborough Rapid Transit Company station. Reese is transferred to the 8th Precinct Homicide task force following his career drug bust and is assigned as Fusco's new partner, sitting at Carter's old desk. Shaw is recruited to be the wheelman for a gang.\n\nSeptember 23, 2014"}