{"title": "Person of Interest Guide - S1E1 - Pilot", "url": "https://www.youtube.com/watch?v=nkVFG9ejF5o", "image": "https://i.ytimg.com/vi/nkVFG9ejF5o/maxresdefault.jpg", "author": "Five by Five Takes", "viewCount": "2913", "datePublished": "2021-03-16", "likes": "336", "dislikes": "1", "comment": ["I love how this almost feels like a book club, and I'm so here for it. You convinced me to watch the show and I'm in the second half of season 2 and loving it. I'm relieved to find the characters grow to be far more interesting than they were in this first episode. (I'm also delighted Fusco is my favorite because I never would have called it)", "I was wondering if you'd ever get around to this (I found you on the previous POI video a few weeks ago) and it looks like this will be a very fruitful subscription.", "I am psyched you are doing this series. I have thoroughly enjoyed all of your videos so far, and I'm rrly glad to see one of my favorite YouTubers giving this show the coverage and the respect it deserves. I will be here for all of these.", "So excited for this! POI is such an underappreciated gem. I'll admit I started watching it only because I came across some Shoot gifs on Tumblr, but it turned out to be one of my all time favourites. The deeply flawed/tortured characters you can't help rooting for, the consistently rising stakes, the crushing moral conundrums, the inescapable clutches of malignantly corrupted structures of power, the awareness of the tangled webs of cause and effect (and all the shades of gray between black and white) and the disconnect between intention and impact, but most of all, the deep, deep humanity of this show make it SO damn good.", "oh hell yeah I’ve been so ready for this I’ve been waiting for this baby, I’m so hyped bc while I’m a fan of mystery/crime shows , but I’m really picky about what procedurals I latch onto. Bones has enough humor to balance out the more serious stuff, but I’m so excited bc how you’ve explained it makes it feel right up my alley."], "authorLink": "https://www.youtube.com/channel/UCC2Bw649-AJJWJDX74f85qg", "description": "in which \"a man in a suit\" is the most detailed depiction of jim caveziel possible\n\nopening by @altjessie\nall music by david wohl\nthanks to esteemed tiktoker caitlin reilly for the compilation of dead gf trope\n\n\nmy twitter "}