{"title": "Kevin Can F Himself Season 1 Review", "url": "https://www.youtube.com/watch?v=nMaxb40sOhc", "image": "https://i.ytimg.com/vi/nMaxb40sOhc/hqdefault.jpg", "author": "Reel Talk", "viewCount": "2031", "datePublished": "2021-08-03", "likes": "46", "dislikes": "16", "comment": ["I actually like that we've jumped to the time-to-kill-the-husband storyline rather than see all of Kevin's horribleness leading up to it. I think we're familiar with this guy that we as the audience can fill in the gaps the writers left. I think the way they've weaved in Kevin's abuse is a good way of keeping the show moving. IMO, Kevin isn't just an obnoxious self absorbed guy like Doug Heffernan-King of Queens. Kevin is a manipulative liar and emotionally abusive. He spent their savings without telling Allison; he called the police on her because she wouldn't answer her phone; he inserted himself in Patty's relationship, he went to her OBGYN to do God only knows. We can literally see Allyson suffocating and although I think divorce is a better option, I can see why she hates him so much that she would want to kill him. Allyson is an anti-hero and I am rooting for her because I want her to be free. However, I know as a viewer that killing her husband will not give her the freedom she think it will. I enjoyed seeing your perspective and I liked the video.", "This review is so weird. Because, I loved the show, while kind having the opposite attitude on so many fronts. Because the Sitcom sections don’t work on their own for me, they only served the dramatic purpose of helping Kevin feel even more absurd and obnoxious, as the world is suddenly forced to revolve around him and distort whenever he or his idiot friends are around. I couldn’t help but darkly root for Alison to kill him. It’s her “breaking bad” that gave the show its compelling hook. I binged the show because I wanted to see if she could pull it off or get away with it. And it is interesting how the final episode makes it seem like in her own way, she’s become as self-centered and manipulative as Kevin, and like Kevin, she is so laser focused on her schemes that she doesn’t see how her agendas affect the people in her life", "I think the show is really saying more about power of casual misogyny.   Kevin is rewarded fro being an idiot and his action are never realistically questioned.   He shot someone with an illegally obtained firearm and the police just let him go. Kevin has Batman level plot armor.   Alison calls him out on his stupidity and she the villain.  As long as Kevin exist she will be the villain. Thats why in this crazy world  leaving him is not enough. He has to die for her to be something other than the villain.", "While the show did have merits being a clever satire full of sitcom tropes, I think what makes it great is actually how it sheds light on the insidiousness of domestic violence/abuse (we see signs of controlling behaviour throughout the season but they are subtle enough to laugh off). I liked that for most of the show the two parts didn't really come together, and then in the end Neil is sort of dragged into Allison's reality, it would be interesting to see him as a bridge between the two realities in season 2", "Kevin can’t become more sympathetic because he’s a narcissist. The purpose of the show is to shine a light on how some people live life without consequences & how sitcoms have used that premise (in the male character lead) as comedy. The person doing this review doesn’t see the consequences or reality of Kevin’s abusive behaviour. Which is fascinating because that is the point the show is making…that we’ve become numb to this type of behaviour & sitcoms have normalised it."], "authorLink": "https://www.youtube.com/channel/UC4GPRqEoZ4zpnTHIxcG5JyQ", "description": "Kevin Can F Himself is one of the most interesting shows to come out in 2021, but it isn't perfect. Unfortunately, its most interesting concept is one of its biggest weaknesses. Nevertheless, I think it is definitely worth the watch.\nTwitter: "}