{"title": "The Freaks of AHS review Asylum", "url": "https://www.youtube.com/watch?v=No2AjCc6gDE", "image": "https://i.ytimg.com/vi/No2AjCc6gDE/maxresdefault.jpg", "author": "MaryGirl Moody", "viewCount": "627", "datePublished": "2018-07-15", "likes": "55", "dislikes": "2", "comment": ["I thought the possession aspect was the best part of this season bc Sister Mary Eunice was such sweet person at first and it was heart wrenching to see her become taken over and the end of her. It was just compelling and the exorcism in episode 2 was terrifying and for me personally made this the scariest season for me bc I don’t f around with demons. Heck to the naw", "Awesome season !. Out of all the seasons, for me, this is still my big number 1 !!", "This is my favourite season loved all the various aspects of it, but the ending had heart", "The demon that possessed Jed Potter and Sister Mary Eunice displayed witch based abilities like Telekinesis, Mind Control and Clairvoyance, same with the Aliens as they were abled bring back Grace from the dead and mentally change Pepper, which allowed her to have intelligence and to speak properly. Even though season 8 is primarily a     Murder House/Coven crossover, I think they need to crossover to Asylum as well since the seasons supernatural aspects are in common with Murder House and Coven. The Angel of Death and The Demon both are metaphysical beings like Ghosts, meaning they could be a sub-species of a type of Spirit. In Coven, Papa Legba has similarities to The Angel of Death, in which they both have something to do with, well...death. Also, in Coven when Fiona finds out about Kyle and he kills her dog, she magically fixes him to be more conscious and intelligent very similar to how the Aliens changed Pepper. The supernatural elements of all the seasons(- Cult) are the same. Ghosts, Aliens, Demons(The Devil and Addiction Demon), Angels(Shachath, the angel of Death)Zombies(Dr.Arden's Experiments, Marie Laveus Army, and Kyle)Witches, Deities(Papa Legba), and Immortals(Vampires, Marie Laveau, and Delphine Lalaurie).", "You mentioned Ann Frank and at the ending of her story line you find out that she is just a crazy girl...Her husband comes and gets her at Braircliff and explains that she was just an obsessed person...you even see a flashback on where the Husband walks in on her and she is tattooing the numbers on her forearm..."], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r...\n\nIn anticipation for the crossover, MaryGirl Moody reviews American Horror Story Asylum with Casey Soper, Maisie Andrews, and Tami Sifford.\n\nFacebook: "}