{"title": "Four reasons Good Omens by Terry Pratchett and Neil Gaiman is the apocalypse books we need right now", "url": "https://www.youtube.com/watch?v=nrTsaP_uHzk", "image": "https://i.ytimg.com/vi/nrTsaP_uHzk/maxresdefault.jpg", "author": "Bookborn", "viewCount": "1067", "datePublished": "2020-08-19", "likes": "76", "dislikes": "1", "comment": ["The \"Good Omens\" show was just straight up fantastic! I loved it! I have one or two other books ahead of this book, but I do own it, and I plan on reading it before the 2020 year is out.", "Loved the book and series. Neil Gaimon and Terry Pratchett seem to be an odd couple but the balance each other. Gaimon can be too dark sometines and Pratchett too silly.\n\nKeep up the good work. Lot's of variety in subject matter.", "I was lucky enough to have discovered 'Good Omens' before it started feeling like a mini-apocalypse came to Earth in real life, but it's been admittedly cathartic to reread these past couple of months. It's a great and funny read on its own, but the book will also always have a special place in my heart for being my gateway to Pratchett's work. It's funny to think that it's Gaiman's darker sensibilities that led me to the 'lighter' Pratchett, but I'd like to think that they'd both appreciate it given their friendship.", "I'm so happy I came across this video. I own the book but haven't gotten around to it. Love all your reasons!", "The book allows you to get the in jokes with the series. Still get emotional seeing Sir Terry’s hat on the stand in the bookshop!"], "authorLink": "https://www.youtube.com/channel/UCRfzPJWEHvpak4D4L8HD9hQ", "description": "Look, we all wish we could do a \"do-over\" on 2020. It hasn't exactly been anyone's \"year\".  So when I finally picked up Good Omens by Terry Pratchett and Neil Gaiman, a book that's long been on my to-read list, I was worried it would be the exact wrong book to read during these pandemic/murder-hornet times. Good news is: I was wrong! Also...sorry my camera decided to not focus on me for at least half this video. \n\nCheck out what I'm reading right now: "}