{"title": "Good Omens | Comparing the Book and Show", "url": "https://www.youtube.com/watch?v=nvOWEyxYopo", "image": "https://i.ytimg.com/vi/nvOWEyxYopo/maxresdefault.jpg", "author": "Books and Woolly Socks", "viewCount": "1438", "datePublished": "2019-06-23", "likes": "93", "dislikes": "0", "comment": ["I can't believe you almost have no views. Halfway through the video I noticed ''35'' views and I was shocked! You described it entertainingly and in a very down to earth way I love it! (And it's also about Good Omens I just CAN'T escape it oh god)", "I still need to make myself finish the book, I just read show fanfiction instead 😂 great comparison tho <3", "Hi, found your video because I wanted to see someone compare the two. You did a great job at it, loved the video. As you said, migh be controversial but I also liked the show a bit better. I usually read the book first but this time I decided to see the show first and well, I fell in love with it. My friend (the one who got me in GO) i had similar experience.  My cousin did the opposite and she also prefers the show. All three of us are usually strong defenders of \"the book is (usually) better\". ", "I listened to the audio book but fell asleep a few times, and i listened to the mini series in excerpts of reaction channels. I agree that the jumping around is too much and annoying. Also, the book spends longs and lengthy passages on little progress in the plot and lots and lots of side characters, less on the two main characters. I found the book too lengthy in many parts and that is why i kept falling asleep, from what i gathered from the reaction videos, the main cuts to fit the book into the mini series are indeed cutting out such lengthy and to me boring passages, so they improved it for me. Also i agree that the long opening detailing the friendship through the ages is a great plus for the series and a sad lack in the book, the same applies to the ending bit in which both main characters face punishment by their superiors. I wish it had been in the book, too. The four additional bikers of the apocalypse were left out in the series although they were part of the book, but that is not a big deal for me. I liked their idea of inventing their own names of modern nuissances as minor and complementary plagues to the ones of the main riders. Altogether, for both book and miniseries, the main idea is great and the characters and friendship of the two main characters are great, even better developed in the series than in the book, and the remaining characters and stories around them are not necessary for me and could have been done aways with if it were for me. With both, i have trouble with anachronisms and things that do not make sense. The book is set in the 1990s i think, the miniseries features smart phones. So they partly updated the time for the miniseries but not comlpletely. For example, searching for adam, the obvious thing to do would check for people with the same birthday, which in the age of smart phones would be an internetsearch. Even before the advent of the smartphone, birth had to be registered with the authorities, not with the hospital, so obviously there would be registers, they do not even mention them at all. Also, in both book and miniseries, they waste time at the rebuilt hospital instead of asking the actually important questions to the former none of the surnames of the families or anything she knew about them like if people giving birth there came from around the region. Moreover, if the forces of heaven and hell actually prepare to fight against each other, the forces of heaven would be fitted with holy water sprinklers or hoses, those of hell with hellfire flame throwers, not both of them with swords that cannot have any effect on their enemies. Furthermore, how come the angel loses his body when stepping into the portal but the body is not left. If he disincorporates, the body should be left behind on the floor of the bookshop, that would also make more sense with crowley showing up at the bookshop. A left behind body burning would be better evidence to make him conclude they killed his friend. A burning shop without a body is not convincing for me. Also, if it was a body, it could not conceivably have vanished. And the witchfinder s concludsion that he exorcised a demon also makes less sense with a disappearing body than with a body left spiritless.", "Hello there, I just discovered your channel. I appreciated your review very much and I must say thank you for being so much passionate and witty about your review. \nI agree with your point of view and I must say I quite enjoyed the book too. It is one of my favourite indeed. Although the tv adaptation is so very much interesting too. I will be a new follower of your, surely. :)"], "authorLink": "https://www.youtube.com/channel/UCXF4qsWWO2LPFcZbycd7UOg", "description": "I watched the show and FELL IN LOVE so obviously I had to read the book and the result is this video!\n\nGoodreads: "}