{"title": "American Horror Story Season 10 Episode 2 Pale Synopsis and Review", "url": "https://www.youtube.com/watch?v=Nwdkkl95bf4", "image": "https://i.ytimg.com/vi/Nwdkkl95bf4/hqdefault.jpg", "author": "MaryGirl Moody", "viewCount": "3340", "datePublished": "2021-08-28", "likes": "188", "dislikes": "0", "comment": ["I already like and care for Karen so much in just 2 episodes. I really hope she have a happy ending after all.\nAlso, she reminds me a lot of Hypodermic Sally. Even the name. I feel like they would've been best friends if they ever meet each other.", "I loved the Deftones song, Change as Harry went to go officially change his teeth. It was absolutely perfect for that scene.", "On my 7th watch, just noticed Evan says something like this to Finn about the pills: \n“I had a friend who writes for television. You know his name. Disgustingly prolific, silly rich, couldn’t write a thank-you note without somebody handing him a trophy. And I thought, ‘How is he doing it?’ all I knew was that he spends his winters here and when he returned to the city he had a stack of material as long as my Johnson. He invited me out here one winter, and handed me one of those Tragic magic little black pills.”", "I love this season. I predict Doris will eventually take the pill and turn into one of those creepy white things, sadly.\n\nBTW so happy Frances Conroy and Evan Peters are back. I thought Frances Conroy was done with doing the show full-time.", "I think the whole Lyme plot is because Doris has either had Lyme or some sort of long term illness due to Lyme. She is pregnant so it’s hard to pin point her symptoms but she doesn’t think when she gets sick is because of pregnancy. I’m also wondering if these “vampires” are more tick than vampire."], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r...\n\nJoin the Freaks of AHS on Facebook: https://www.facebook.com/groups/TheFr..."}