{"title": "POI S3E05 Razgovor [Разговор], p4 [Shaw]", "url": "https://www.youtube.com/watch?v=Nxnez-DC9ss", "image": "https://i.ytimg.com/vi/Nxnez-DC9ss/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "14877", "datePublished": "2016-07-03", "likes": "111", "dislikes": "3", "comment": ["Damn, the perks of being a sociopath. I mean, I wish I could be like Shaw, and not get scared, or sad, or lonely.", "Shaw's damn lucky they didn't kill her.  But in her defense, I actually blame Harold for what transpired, because in the earlier scene she wanted to go and take a couple guys out, and she probably could have considering how they were going the other way so she had the advantage, but Finch told her not to, he second-guessed her actions and instincts in the field and it was that which probably set in motion the events that led to their capture. Harold needs to trust Shaw and Reese to do their jobs in the field making the judgment calls they see fit as the best course of action.  Harold does a fine job getting background information and coordinating things, but Shaw and Reese need to be able to do their job in the field without his interference.  But then again, Shaw probably realized Finch was right and relented.", "Attention to detail: Shaw's pale.", "i love arm", "Unfortunately, I don't think I've ever seen this full episode, and I think I probably know the answer, but does Shaw actually go to see the doctor?"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Flashback: Shaw backstory.\nGenrika is taken and Shaw escapes from a car trunk.\n\nEpisode summary:\nIn a series of flashbacks to Shaw's childhood it is revealed she was in a car with her father when he was killed in a wreck, but that she showed a shocking lack of emotion over it. In the present, after Shaw saves another number, Finch begins expressing concern about Shaw's callous treatment of them. Their next number turns out to be a little Russian immigrant girl named Genrika Zhirova (Danielle Kotch), Gen for short, who is deeply interested in espionage and is living with an older cousin in a run-down apartment. Shaw ends up watching after Gen when men come to attack her, and the two start to bond. Shaw explains that she never feels emotions the way most people do. The team learns that Gen had been bugging the phones in her apartment building and overheard information she should not. Some of the mobsters she recorded manage to abduct Gen. Meanwhile, Carter is continuing her investigation of HR and is following Terney when she runs into Reese, who was unwittingly tracking Terney's phone to find out who was going after Gen. Elsewhere, Carter has been asked to meet her partner Laskey at a bar, where he confronts her about her work with Reese. The episode ends with Root arriving at Shaw's loft and abducting her.\n\nOctober 22, 2013"}