{"title": "Will SPIRAL: FROM THE BOOK OF SAW Go To Streaming?", "url": "https://www.youtube.com/watch?v=OOSS8N9BTbs", "image": "https://i.ytimg.com/vi/OOSS8N9BTbs/maxresdefault.jpg", "author": "Reel Talk", "viewCount": "1640", "datePublished": "2021-03-20", "likes": "72", "dislikes": "3", "comment": ["I hope it will come out on streaming I won't handle any more delays. SO HYPED to see this.", "The last film I saw in the theatre was “The Call”, the thriller with Tobin Bell and Lin Shaye, it was a fine experience. I think “Spiral” would definitely be a big deal as a theatre release because horror is a wonderful way to deal with all of those complicated feelings during last year and this year. The streaming thing could also work because I’ll be getting whichever platform it releases on if it goes that route and I think many fans will join me in that sentiment 😁 We shall see. I’m excited either way and I’ve been promoting the film to people whenever I get a chance 😎 Thanks for the great video as always!", "I don't think Spiral will be going to streaming, at least not until they decide to delay it again. But, in the current conditions for cinema, could do well. It's a big enough movie to draw people in (especially with SLJ and Chris Rock) but not to big where it will only lose money. The only issue is with that budget, if it cost them $40 million to make then it will likely need to make $80 million in the box office just to break even. If it had to go to a streaming service I imagine it would go to Netflix, Shudder is definitely a better fit but Netflix has a wider audience and has been generally kind to horror movie fans.", "I was waiting for this particular content as I’m a huge fan of the Saw franchise. Thanks for sharing the contents and your own thinking ..", "Bruh I really hope that sprail can be just as good as the frost three or four depending."], "authorLink": "https://www.youtube.com/channel/UC4GPRqEoZ4zpnTHIxcG5JyQ", "description": "Will Spiral go to a streaming service? I'm not entirely sure that would be financially beneficial for everyone involved. Still, it is hard to believe that everything will be back to normal by May 2020. Let's discuss!\nTwitter: "}