{"title": "American Horror Story Weekly Wednesday Live Stream", "url": "https://www.youtube.com/watch?v=ouq5i710pFM", "image": "https://i.ytimg.com/vi/ouq5i710pFM/maxresdefault.jpg", "author": "MaryGirl Moody", "viewCount": "679", "datePublished": "2019-07-17", "likes": "65", "dislikes": "5", "comment": ["I think this season will DEFINITELY be like a Friday the 13th kind of theme, even the leaks gave it away", "O.M.G thank u thank u ... THANK U mother supreme for speaking the truth about how AHS is gonna be fine without Sarah and  Evan. cast members have been coming in out of different seasons for the entire series that’s a big part of what keeps the show fresh & exciting, Evan not being in this season is not going to affect my watching experience at all & I’m also fine with Sarah being a guest star this time around too plus both have played small roles in the past, Sarah was only in like three episodes of MH & Sally was definitely a side character in hotel. Evan practically just guest stared in Roanoke and last season he was in it  consistently but definitely not as a huge leading role so I really think the shifting cast is one of the many beauties of AHS tbh🖤", "I would also love a connection to Roanoke or Cult.", "Talking about Scream season 3.. I’ve started it and don’t get your hopes up lol. It doesn’t have anything to do with the first 2 season, new cast, new storyline, new masked killer, all the characters are unlikeable except for Keke Palmer’s character😩 I’m gonna stick it out and continue watching but it’s nowhere near as good as the first 2 seasons.", "The teaser looks like a test screening for a campy version of a Friday the 13th movie. A similar theme to Roanoake but real murders occur when filming"], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "Welcome to American Horror Story Weekly Wednesday Live Stream! Host is MaryGirl Moody.\n\n► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r..."}