{"title": "POI S2E22 God Mode, p3 [Root, Root x Shaw]", "url": "https://www.youtube.com/watch?v=p7u4DtJqNuo", "image": "https://i.ytimg.com/vi/p7u4DtJqNuo/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "68855", "datePublished": "2016-06-21", "likes": "264", "dislikes": "6", "comment": ["It is so frustrating how underrated this show was. It makes me angry.", "Lawrence: She was killed last year.\nRoot: Such a tragedy.\nLMAO", "Root is really lucky in this episode, it could have all ended for her right here.  It's hard to believe the gov't shooter didn't take her out, he had just shot Szilard proving he could shoot to kill, had clear orders from Hersh to \"... take the woman\", and Root was a sitting duck there kneeling over Szilard talking to him.", "I loved the don't you touch him it shows how much she cares for Finch", "Sarah Shahi made Shaw into a Ground breaking character!! I was Amazed at how BRILLIANTLY!! Sarah Shahi portrayed Shaw!!"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root and Finch search for The Machine.\nShaw and Reese work some numbers.\n\nEpisode summary:\nThe Machine relays quick warnings to Reese (with Sameen Shaw) and Root (with Finch), saving both duos from a number of potential threats. Both parties race to find the Machine, however Reese is slowed as the Machine directs him to rescue people from the irrelevant list. Root and Finch arrive at the Hanford nuclear facility where the Machine is kept, followed shortly by Reese and Shaw. When they find that the Machine has moved itself to prevent tampering by Decima, Root prepares to shoot Finch, but Shaw shoots and injures Root first. Armed government men, led by Special Counsel and Hersh, enter the room. Finch explains that he planted a hidden code inside the Machine that would grant it freedom to protect itself if it was at risk—the very freedom that Root had hoped for—and the Machine will decide for itself if it will continue to call either the Government or himself with new numbers. Special Counsel offers Finch total autonomy if he helps find the Machine or builds a new one, but Finch refuses saying that they killed his friend Nathan Ingram after making the same offer. \n\nMay 9, 2013\n\n+191"}