{"title": "Would a Spiral (SAW) Sequel Even Work?", "url": "https://www.youtube.com/watch?v=PqMlOg55l84", "image": "https://i.ytimg.com/vi/PqMlOg55l84/maxresdefault.jpg", "author": "Reel Talk", "viewCount": "1494", "datePublished": "2021-06-23", "likes": "108", "dislikes": "10", "comment": ["My main complaint with Spiral was William’s motivation to copy Jigsaw, it needs to be more than him saying “Jigsaw had the right idea”. I‘m glad Spiral is it’s own thing and it isn’t as beholden to the previous film, but right now, Will’s character only feels like he is making traps because he is in Saw film, not because he has any real motive. I know the writes toyed with the idea of having a scene where young Will met John Kramer. I feel showing something like that could be used in a sequel to connect him to the main series and make his motive more clear. Even bringing back the Jigsaw Rules website could be an interesting explanation. ", "Thanks for the deep dive! I loved the conversation. I'd be interested in a Spiral 2 that picks up where Spiral left off. Zeke gets blamed for everything and is locked up. But while he's in custody, the traps continue which leads to his release and a hunt for William except twist the new traps are being set by a different killer (not William). I'd also enjoy the prequel you talked about or even a true main line sequel. I just want more Saw! LOL", "As fun as many of the sequels are, saw should have ended with the third movie. John Kramer’s and Amanda’s motivations for being jigsaws were interesting. All the other jigsaw accomplices are just too unbelievable. We’re supposed to believe Jigsaw had 4-5 accomplices all at the same time?", "So I've been thinking about saw X recently and I have thought of some cool ideas that could be incorporated into the film. I hope you guys enjoy my idea on the plot for the next movie! (This is just a rough idea, just my thoughts and ideas of what id do with the story)\n\nThe film could be a sequel to both jigsaw and spiral, that has Logan and William, as the 2 main characters that go head to head with each other and also teaming up with each other to clean the streets of corrupt cops and to avoid being caught by people who know of them or suspect them", "I read that the delivery part series for the John Wick spin off is gonna be 3 90 minute episodes... If they did that for the Saw franchise I would then be interested in that. That gives it more leeway story wise."], "authorLink": "https://www.youtube.com/channel/UC4GPRqEoZ4zpnTHIxcG5JyQ", "description": "If you saw my review of the new Spiral: From the Book of SAW, you know that I wasn't the biggest fan of the movie. I have found myself coming around more and more upon additional viewings; still, I'm not entirely sure there is enough there to make a compelling sequel. Am I wrong? Let's discuss!\nTwitter: "}