{"title": "Person of Interest opening intros [1-5] +", "url": "https://www.youtube.com/watch?v=PrC8AKgYG1M", "image": "https://i.ytimg.com/vi/PrC8AKgYG1M/maxresdefault.jpg", "author": "guessWho66666fy", "viewCount": "10005", "datePublished": "2016-07-10", "likes": "123", "dislikes": "2", "comment": ["I have 4 letters for you: O-M-F-G\n\nThis the BEST sequence of PoI intros anywhere on YouTube...  congratulations, you are #1 in my book!!", "P.S.  sorry for the double-post, but I wanted to say Thank You for listing the episodes in your Description... so many YouTube videos have very lame descriptions, but you put forth that EXTRA EFFORT to give us relevant detail... so, yeah, +1 :)", "Came here looking for one intro in particular and its the only one not here 😂\n\nIts somewhere in season 2, I wanna say ep21 but I think I'm wrong. The virus had just infected the machine and its all glitched out. Its spooky and I love it"], "authorLink": "https://www.youtube.com/channel/UCLHXgL0fYJ6XIr5J4SUgsnA", "description": "ALL OF THEM*\nok, this time I present to you all* the variations of Person Of Interest intros.\nPerson of Interest opening intros from all seasons. As a bonus I added version with Root and one another with disturbance.\nIf you think I added something twice - I didn't. After Joss death they cut her out from the intro, so that make 2 slightly different intros, same goes with season 1 and 5 - when Fusco finally learned about The Machine, he turnes yellow :)))\n\nSo here is the list:\nSeason 1 - normal\nSeason 1 - with Fusco\nSeason 2 - normal\nSeason 3 - normal\nSeason 3 - without Joss :( different placing for characters\nSeason 3 - interference with Root's voice\nSeason 4 - normal\nSeason 4 - interference with Control's voice\nSeason 5 - normal\nSeason 5 - Fisco box turned yellow :)\n\n* as Rex Lii pointed out, I didn't put the 2x21 begining, because in my opinion it wasn't an intro, just a short indication of it and it was brutally cut short because of the virus and The Shit That About To Go Down"}