{"title": "Every Breath You Take Police Surveillance Society Person of Interest STEREO HiQ JARichardsFilm 1080p", "url": "https://www.youtube.com/watch?v=pzd1IGQQsHg", "image": "https://i.ytimg.com/vi/pzd1IGQQsHg/maxresdefault.jpg", "author": "jarichards99utube", "viewCount": "1885", "datePublished": "2020-03-15", "likes": "52", "dislikes": "1", "comment": ["I love Person Of Interest! I have all five seasons on DVD! Amy Acker (aka Root) is my favorite actress!", "God, Ja, this video is  perfectly beautiful ! Thank you so much !\n 😊 More!\n God bless 🌷", "Hi ja, I hope all is good with you in light of recent events. Store shelves in McMinnville, Oregon are the most bare I have seen them in 30 years, unprecedented. This is surely the video you said was coming, a sad commentary on the world today and one's lack of privacy. Walk into a Walmart, they have facial recognition technology at the door. On a lighter note, just a few more days of Winter, had a last dab of snow on Saturday the 14th. All the best, C.", "Good work on that video !!! CHeers !!!", "Love this song bye police the only one i like by them every breath you take:)<3"], "authorLink": "https://www.youtube.com/channel/UCghjE9y9ruiQ2ubLQiGZv3Q", "description": "Every breath - Every move - Every bond - Every step...\nEvery word - Every game ... Every day - Every night...\n               \"The Surveillance Society\"\n * The LYRICS  to this song, written in 1983, take on NEW MEANING \n   in our Modern Surveillance Society.  \n* Is this the \"AI\" Threat of the Near Future...?\n\nFor other Music Videos - do a YOUTUBE SEARCH for - JARichardsFilm HiQ FULL PLAYLIST or SEARCH for - JARichardsFilm HiQ + (artist name)\n\n\"Copyright Disclaimer Under Section 107 of the Copyright Act 1976, \nallowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\" \n\n* Music: \"Every Breath You Take\" - The Police\n\nI DO NOT OWN ANY OF THIS MATERIAL\nNO COPYRIGHT infringement is intended.\n\nThis video IS NOT to be used for ANY commercial or financial purposes."}