{"title": "POI S5E07 QSO, p1 [Root]", "url": "https://www.youtube.com/watch?v=Q3iHk-nsX2o", "image": "https://i.ytimg.com/vi/Q3iHk-nsX2o/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "9682", "datePublished": "2016-07-01", "likes": "52", "dislikes": "2", "comment": ["“Busy day directing traffic into a river Cocoa Puffs?”"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root as a traffic cop. \n\nEpisode summary:\nWhile Fusco and Bear recover in a hospital from their near-demolition, Root visits him and hands him an exit strategy consisting of ID's and documents made by the Machine. Root is then sent on a series of whimsical, ominously productive tertiary missions by the Machine after it had discovered that Samaritan has been using the radiowave frequencies of station AM 520 to communicate with its operatives via a sophisticated code, which most people believe to be feedback noise from the radio waves. Upon realizing that this is why the Machine sent her there, Root uses Samaritan's own equipment to send a message to Shaw to give her hope. Reese is as helpful as he can possibly be without stepping into the AI-based argument between Finch and Root. Finch does not necessarily agree with the Machine not forcing the radio host to quit to save his life from Samaritan, but Root believes the Machine maintains its belief that humans have free will and it protects them from Samaritan so that they do not lose that free will. After Fusco finishes his recovery in the hospital, he is visited by Finch, who refuses to waver from his stance that keeping Fusco in the dark keeps him safe. Fusco points out that it is not working since he ended up in the ER, hands his encrypted-from-Samaritan phone back to Finch, fed up with being in the dark, and says he's done. Shaw is escorted by Lambert on a field trip outside and told to kill an innocent woman; believing that she is actually just in another simulation, Shaw does so and is later shocked when told that it wasn't a simulation. Unwilling to remain a guinea pig, Shaw is about to kill herself when she receives the message from Root, regains hope and allows herself to be disarmed. Later, Shaw stealthily makes preparations to escape.\n\nMay 24, 2016"}