{"title": "Beyond the Horror: 1984 Episode 3", "url": "https://www.youtube.com/watch?v=q7f_Ql3cfDk", "image": "https://i.ytimg.com/vi/q7f_Ql3cfDk/hqdefault.jpg", "author": "MaryGirl Moody", "viewCount": "3065", "datePublished": "2019-10-03", "likes": "127", "dislikes": "5", "comment": ["Everyone's feedback from this season on my little fan group (\"American Horror Story Hub\", on Facebook.), was positive, this week! Last week they were ready to quit the show...🙄 they say that at the beginning of the show every year, since Jessica left! 😂😂😂 I read it was Ten episodes this season... This last episode was a roller coaster! I love that he's hooked us this early in the season! It's just surreal enough to keep me watching! & I don't have to look away, like Roanoke & Cult! 😱 🙄😁😁 I think Ryan & Brad might make everybody happy this season! ..............Very Happy! 😊", "There’s still footage of Ray in the spiked pit with Jingles at the top so I think we’re going to be seeing him again. Also when the NightStalker first broke into the cabin and went after Ray, he had blood on his jacket out of nowhere right before he was attacked. I think when you die there you stay there or there’s time travel or past lives or something because there is still footage of Ray from a commercial that we haven’t seen yet.", "Pretty sure the second half of this season will see a jump to that ghost research team coming to the camp.", "Mallorys parents saw her floating (I think it's been awhile) in her sleep and thought she was a devil worshipper. If Brooke was related the character persona would make sense given her now experiences with satanic cult folks which will prob become more intimate this season", "I wanna know what Donna/Rita was going to do had everyone stayed together and made it to the parking lot. \nDid she think she could take on all of them? \nWas it just luck that only Brooke made it there with her, or something else? "], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": ""}