{"title": "Person of Interest || Morality", "url": "https://www.youtube.com/watch?v=Q8eOFleq-mg", "image": "https://i.ytimg.com/vi/Q8eOFleq-mg/hqdefault.jpg", "author": "Lucia Balalová", "viewCount": "9454", "datePublished": "2015-06-05", "likes": "178", "dislikes": "2", "comment": ["Nice video. I love this show. The Machine and Samaritan have their characteristic features just like two different people. And I think they should make a lot of Samaritan centric episodes with more Greer scenes in season 5. Season 4 was so much about relationships and most of the episodes were really boring. I mean you may not like them but the show becomes more mysterious and exciting when they get involved.", "This is such a brilliant video. I love how incorporated are the different questions that arise from the show, the different aspects considered. From the little ones, such as the quick clip of Root blindly walking on the edge, to the plot-driving ones as the one second that was replayed on the show to the clips like the one about the burden that the machine holds, which makes us question just how much emotion can the machine have, which not only drive the plot but also give meaning to the themes in the series. It's a perfect blend and editing, thank you for creating it!", "love it.....the essence of Harold Finch captured so beautifully! ♥", "I watched this video over and over again and every time i found it perfect. I linked this to all my friend because I find it shameful that a so wonderful video has so low views.", "Thx and FYI it is the best POI fan vid this year!!"], "authorLink": "https://www.youtube.com/channel/UCXUnXnS9Yf6rftQDEo-OKDA", "description": "\"Morality in a machine.\"\n\nPerson of Interest is one of the most unique and amazing series currently on television. This clip is dedicated to its brilliance and philosophy. Don't forget to vote for it and let's hope that season 5 will have more than 13 episodes.\n\nHighest quality: 1080p\nProgram: Movie Maker"}