{"title": "POI S5E10 The Day the World Went Away, p2 [Root x Shaw]", "url": "https://www.youtube.com/watch?v=qg5s4KQlhZs", "image": "https://i.ytimg.com/vi/qg5s4KQlhZs/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "64467", "datePublished": "2016-07-02", "likes": "378", "dislikes": "11", "comment": ["Considering how calm Lionel is, this isn't the first time he's paid an unexpected visit and been faced by five guns.", "This is actually one of the most romantic scene in the whole show. Harry recognizes his romantic mistake, Root&Shaw's moment and... Fusco loves all of them! :-)", "“You’ll feel better once we shoot some people”.  God this show had amazing writing.", "Thank you for posting all of their scenes. Miss them. <3", "I just wish Root and Shaw could’ve had 1 more kiss before their end…holding hands was adorable even though short"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root and Shaw prepare to shoot stuff and then hold hands.\n\nEpisode summary: \nFinch's number comes up when his cover identity is compromised, due to a subconscious error, and Samaritan initiates a continuous dispatch of operatives on him. The team splits up in their escape, which results in Elias being killed by Samaritan agents while protecting Finch. The team rescues Finch from his potential capture, and Root explains in the car her current understanding of herself and everyone else to be \"information\" that can never truly disappear despite their deaths. Root is shot by Samaritan operative Jeff Blackwell and placed in critical condition, while the police apprehend Finch who is accused of treason. A devastated Finch provides a soliloquy on how he has chosen to abandon the principles he has long followed, and vows to kill Samaritan. The Machine calls Finch in the precinct, having taken on the voice of Root, who had died from her injuries. The Machine sets every criminal in the precinct free to allow Finch to escape; Reese and Shaw realize that Finch's number came up not because he was a victim, but rather a perpetrator against Samaritan.\n\nMay 31, 2016"}