{"title": "POI S4E12 Control-Alt-Delete, p2 [Root x Shaw]", "url": "https://www.youtube.com/watch?v=QmOa3ooh39I", "image": "https://i.ytimg.com/vi/QmOa3ooh39I/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "42811", "datePublished": "2016-08-16", "likes": "175", "dislikes": "4", "comment": ["Root loves always did love that tazor", "Having just watched the scene with Control torturing Root, this is incredibly frustrating. Root needs to be able to torture Control until she gets bored.", "I expected more from control."], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Episode summary:\nDuring a mission to eliminate four suspected terrorists in Detroit, ISA operatives (including Brooks and Grice from \"Honor Among Thieves\") eliminate three while the fourth, Yasin Said, escapes with his laptop. When Control requests access to the laptop's contents, Samaritan denies the request. After an exchange with one of Samaritan's operatives, the operative instantly shuts down the government's access to Samaritan, forcing a discussion between the operative, Control, Senator Garrison, and Greer, which results in access being returned. Suspicious of Samaritan's actions, Control orders Brooks and Grice to make recovering the laptop their highest priority. When Brooks and Grice do obtain the laptop, Said escapes and the laptop self-destructs. An analysis of Said's backpack (which he left with the laptop) shows that Said is planning to hop a train to Canada, prompting Control to head to Detroit to intercept him. However, Reese and Root (who have been hunting for Shaw since her disappearance at the stock exchange) ambush and kidnap her. Root tortures Control for information on Shaw, but Control denies having knowledge regarding Shaw's predicament. When Harold speaks to her, he realizes that Control herself has been kept out of Samaritan's plans and tries to convince her to accept this fact, but to no avail. With no help from Control, Harold and the rest of the team are left to fight off a group of ISA operatives who have arrived to rescue her. During a skirmish, Harold successfully uploads a worm to one of the ISA cellphones, and finds some information suggesting that Shaw may be being held in upstate New York. Control, after being rescued, tracks Yasin to Canada. He reveals that he won the Nautilus puzzle (from \"Nautilus\") and he wrote some software for an anonymous corporation. Control kills Yasin, but her actions leave a hint of doubt in her mind whether Yasin and his friends were in fact framed as terrorists. Meanwhile, the young boy acting as Samaritan's representative approaches the White House Chief of Staff (Michael Gaston) and informs him that it was he who caused the stock market crash. The Chief of Staff initially dismisses the boy, but later reconsiders when the boy demonstrates his ability by altering the portfolio information of the chief of staff. Through the boy, Samaritan presents its demand for a meeting with the President. The episode ends with Root and Reese driving north, and Control visiting the New York Stock Exchange to investigate the site of the shootout between Harold's team and the Samaritan operatives.\n\nJanuary 13, 2015"}