{"title": "Person of Interest - We would need... a supercomputer ! (05x01)", "url": "https://www.youtube.com/watch?v=QMRg1WNgT2Q", "image": "https://i.ytimg.com/vi/QMRg1WNgT2Q/maxresdefault.jpg", "author": "POI - Best Of", "viewCount": "14547", "datePublished": "2016-07-05", "likes": "114", "dislikes": "2", "comment": ["I find it sad that even though Finch realized that he should have given the machine a chance, he still goes back and forth with this over the next 10 episodes.", "On rewatch, it seems the Machine was always steering Team Machine towards the people and ingredients needed to fight Samaritan because the Machine knew that Harold would NOT execute a U.S. Senator (Roger McCourt) to stop the advance of Samaritan. For example, the Machine steered Harold towards Caleb Phipps (compression algorithm).  Frankly, I believe the Machine was testing Harold's ethical consistency and his moral character by presenting \"the opportunity\" to execute Senator McCourt, knowing that would STOP Samaritan.  It was a lesson to the Machine...is the willful taking of an innocent life okay to prevent a greater harm.  The Machine learned from Harold's decision that it was NOT. And therein lies the great difference between Samaritan and the Machine. That tunnel full of bodies (of innocent people including a graduate student) that Fusco discovers is proof that Samaritan had ZERO compunction about killing innocents to achieve its goals.  The great filter to which Greer kept  referring was just that...not unlike Captain America Winter Soldier with the Helicarriers under Hydra's control (Alexander Pierce) would select up to 20 million targets.  This would be the great filter that Greer was referencing! The Machine has too high a regard for human life, thanks to its imprinting on Harold and emulating his value for human life.", "This makes me nostalgic", "That Cell CPU baby.", "I think they just found the most inconvenient way to make a supercomputer. \n\nBut I still like the show (:"], "authorLink": "https://www.youtube.com/channel/UCauPw3dshgz4QknvsD1Vbqg", "description": "- Extract from season 5 episode 1\n\n♥ Here is the new Facebook page to follow all the latest news of the channel : "}