{"title": "REAL HORROR STORY OF Anneliese Michel IN HINDI (Knowledge Ganga)", "url": "https://www.youtube.com/watch?v=qMTvSmDRKMA", "image": "https://i.ytimg.com/vi/qMTvSmDRKMA/hqdefault.jpg", "author": "KNOWLEDGE GANGA", "viewCount": "752718", "datePublished": "2018-04-26", "likes": "12,631", "dislikes": "1,333", "comment": ["Bhagvan uuski aatma ko shanti de l pray for his mother and father 😢😢😢😢😢😢😭😭😭😭😭😭😭😱😱😱😱🙏🙏🙏🙏🙏🙏🙏🙏🙏", "Allah sabki hifazat kare 🥺", "It's very much painful to hear that a girl living a happy life with her Family got suddenly worst day by day. 😟😟😞😓I wish  if her family would have been more stronger in prayer than this should not have happened", "\"Bhoot pisch nikat naa away mahavir jab naam sunvy \"", "Bhagwan sabko aisi blao  se bachaye \nJay bajrangbali, 🙏🙏🙏"], "authorLink": "https://www.youtube.com/channel/UC--pTQaSmY4l072pegIv_MA", "description": "Anna Elisabeth \"Anneliese\" Michel was a German woman who underwent Catholic exorcism rites during the year before her death. She was diagnosed with epileptic psychosis and had a history of psychiatric treatment, which was overall not effective.\nWhen Michel was sixteen, she experienced a seizure and was diagnosed with psychosis caused by temporal lobe epilepsy. She soon had depression and was treated at a psychiatric hospital. By the time she was twenty, she had become intolerant of various religious objects and began to hear voices. Her condition worsened despite medication, and she became suicidal, also displaying other symptoms, for which she took medication as well. After taking psychiatric medications for five years failed to improve her symptoms, Michel and her family became convinced. \nPlease watch videos till end..\n\nWebside _-   "}