{"title": "POI S4E21 Asylum, p2 [Root, Root x Shaw]", "url": "https://www.youtube.com/watch?v=qq7xZu-xB90", "image": "https://i.ytimg.com/vi/qq7xZu-xB90/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "49740", "datePublished": "2016-08-18", "likes": "216", "dislikes": "3", "comment": [], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root and Harold follow The Machine's lead to Shaw.\nRoot poses as a doctor and admits Harold to the facility.\n\nEpisode summary:\nReese and Fusco race to find the next number, Carl Elias. They reach his hideout in a bank in Manhattan, and the two warn Elias that The Brotherhood is coming to capture and interrogate him. In the meantime, Dominic and his Brotherhood arrive and capture Elias, Reese and Fusco. It turns out that Dominic is being aided by Harper, who now works for him. The Brotherhood tortures Elias for his intel, and Reese and Fusco for information on Harold and his whereabouts and activities. Dominic's group knows that Harold is tapped into the city's camera systems in some way, which would be helpful for them in their efforts to run the city. Elias, using mind games, provokes Dominic to kill his right-hand man, Link, during the torture session, to avenge the death of Anthony. Meanwhile in Washington, D.C., Control has captured and is interrogating a female Samaritan handler posing as a teacher, after having killed her partner, wanting to know Samaritan's strategies. Root receives a call from Shaw for help. Surprised, she and Finch follow The Machine's instructions to try to find Shaw, eventually driving to what appears to be a mental hospital, but which is also Samaritan's and Greer's base, having previously intercepted a communication of Samaritan that it is focusing on finding the location of The Machine. Samaritan's operatives capture Finch and Root as they are infiltrating the facility, and they give a choice to The Machine: to reveal its location, or get both Root and Finch killed. Root, after having earlier been confined to a bed, kills Martine by breaking her neck. The Machine intercepts by cutting power supply to the asylum and exchanging its location for the freedom of Finch and Root. Greer agrees and releases them, and takes a group to go in search for The Machine's location. As they're leaving, Root tells Finch to reach that location before Samaritan in order to save The Machine. Shaw is last seen being driven away in van.\n\nApril 28, 2015"}