{"title": "Has Filming Already Begun on AHS Season 10??", "url": "https://www.youtube.com/watch?v=R1Uhn9pYisY", "image": "https://i.ytimg.com/vi/R1Uhn9pYisY/maxresdefault.jpg", "author": "MaryGirl Moody", "viewCount": "1250", "datePublished": "2020-03-05", "likes": "119", "dislikes": "2", "comment": ["I'm ecstatic Sarah and Evan are coming back! Macaulay Culkin should be a very interesting and pretty awesome addition as well. Most of the male cast, aside from like a select few, all have basically the same features... Jackson, Wittrock, Quinto, Eichner, Bentley, Bomer, Fiennes, Criss, etc. All have dark hair, dark thick eyebrows, strong and chiseled chins... Think it's funny how Gaga's character in Hotel made a reference to that being what she was going for with all her boy toys. Anyway, got off topic. I just hope that when they do finally come to a finish that they bring back all the O.G. ppl. I know that'll be a huge cast if they do that and keep the newer ones as well but I would be okay if they booted them off for it to get the first ones back. JS. Even if the last of the last season sucks that'll make it all worth it. I just hope that it leaves on a good, memorable note. I also hope they get their mojo back. I love me some AHS but most can agree it's lost something as seasons went on. Whoever wrote the season finale for \"Six Feet Under\" should either collab with Murphy/Falchuk or just entirely write the ending of the last season. That way we know we won't end up with a GOT/HIMYM/Lost type of ending. Sorry, I apologize what I said didn't really have much to do with your video. Just wanted to air a few opinions with some fellow AHS lovers.", "Asylum was never at the top of my seasons, while I recognize it was a great season. But ever since people speculated the moon teaser could mean the return of the. Aliens I have been hoping hardcore that’s right!", "Hopefully since they start filming this season this early, hopefully we'll get more than 10 episodes. I want the original 13 episodes back like early previous seasons.", "I would love to see more episodes!!!!", "Angelica said it on one of her Instagram live videos towards the end before she ended it she had someone else on her live (like an added person, like how you would with Skype) and while saying goodbye she said she had to go back soon cuz they’re gonna start filming AHS in March. I hope she’s not joking us!!😅"], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r...\n\nJoin the Freaks of AHS on Facebook: https://www.facebook.com/groups/TheFr..."}