{"title": "POI S3E12 Aletheia, p5 [Root, Root x Shaw]", "url": "https://www.youtube.com/watch?v=R_tpRNOjMvU", "image": "https://i.ytimg.com/vi/R_tpRNOjMvU/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "63828", "datePublished": "2016-07-07", "likes": "328", "dislikes": "2", "comment": ["Root speaking as the Machine gave me chills.", "That line—“to save you”—encapsulates perfectly just how wrong Control and the others were about the Machine. She asks “save me from what?” and completely misses the point doing so. The Machine wants to save humanity, all of humanity, all the time. But Control and her lot are so wrapped up in their own tiny slice of the bigger picture that they think an artificial superintelligence cares about them any more than anyone else.", "Two things: 1. Amy Acker in that scene is just phenomenal. 2. Screw Harold and his hubris.", "Control thought that she was in a post-Jack Bauer spy thriller. In this scene she realizes that she's living in a post-Matrix cyberpunk-scifi world.", "Isnt she the best ? LOL"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "The Machine speaks through Root to threaten Control.\nRoot calls Finch from Japan and thanks Shaw for looking for her.\n\nEpisode summary:\nThis continues from the previous episode where Harold, Shaw and Arthur are held captive by Control for information. Shaw is deemed to be not useful and is about to be killed, when Root comes guns blazing and gets them out of there. But Root is shot and captured by Control. Meanwhile it is revealed that Arthur had made a copy of Samaritan before it was destroyed. He stored it in a bank locker. But as they go to get it, Vigilance comes and Harold locks himself, Arthur and the bank manager in the vault. Shaw gets a bomb ready to get everyone out. Inside the vault Harold reveals to Arthur that The Machine exists and convinces him to destroy Samaritan so that it will not fall into wrong hands. Vigilance breaks through the vault and captures everyone including Shaw, but they are saved by Reese and Lionel. The Machine guides Root to escape from Control after having been tortured. She is later shown in a South East Asian restaurant. Root also calls Harold to tell him that the Samaritan drives are not destroyed because the bank manager had been murdered and replaced, and the impostor had swapped the drives. Later, the impostor is shown handing over the drives to Greer from Decima Technologies, who in turn shoots her through the heart to cover his tracks. The episode ends with Greer saying that he has great plans for Samaritan.\n\nJanuary 7, 2014"}