{"title": "[Person Of Interest] Reese and Finch ~ Superman", "url": "https://www.youtube.com/watch?v=REf0KwJbXN8", "image": "https://i.ytimg.com/vi/REf0KwJbXN8/maxresdefault.jpg", "author": "cardiffgiant02", "viewCount": "15698", "datePublished": "2012-11-11", "likes": "193", "dislikes": "0", "comment": ["I love love love love this! Everything, editing, coloring, voiceovers. And not to mention, a great show!", "Yes, it should. After all, we have to learn how Reese became such a badass ;P. It's an innovative take on bromance and one that I'm completely digging. Plus, the story has become incredibly layered with the machine (and Bear) intruding to create the strangest foursome ever :D", "Awesome job - the best television show on network TV today, and the most intriguing, well written set of characters.  Thank you for sharing this with us.", "Awww, my favourite pair of guys!  Beautifully done!", "Great video! Great subject! My favorite subject! POI especially Reese and Finch (and of course, Bear!) :) Thanks for this! "], "authorLink": "https://www.youtube.com/channel/UC0rmFUz0MA2jBGcbp8bsH1g", "description": "respect the universe, watch in HD.\n\nMy first full length POI video! Feedback would be very much appreciated :)\n\nMy original idea for this fandom was to make an action type video but I really love each of these characters and their back-stories (what we know of them so far) and so decided to do a little character study instead. I wanted to show the relationship between Reese and Finch also because it's my favourite thing about the show. They're each others only person/friend in the world basically, they are completely different and yet exactly the same, you can see how Reese needs Finch just as much as Finch needs Reese. It's a perfect balance and a wonderfully fresh dynamic and keeps growing with every episode. If you haven't seen this show, you really should. Personally I've been hooked since the pilot.\n\nMusic: Superman (originally by Five For Fighting) cover by Boyce Avenue\nFandom: Person of Interest (John Reese/Harold Finch)\nSoftware: Sony Vegas Pro 10.0\nColouring: made by me\n\nVOICEOVERS:\n\nFinch: \"I know you've spent the last couple of months trying to drink yourself to death\"\nFinch: \"I think you and I can help one another\"\nReese: \"What do I need?\"\nFinch: \"You need a purpose\"\n\nFinch: \"You were too late for her. You were half way around the world when she was killed\"\nFinch: \"You couldn't have saved this woman, but you could have if you had known in time and that's the other thing I'm offering you, a chance to be there in time\"\n\nFinch: \"Simply being near me was putting her life in danger\"\nReese: \"I'm sorry\"\nFinch: \"I was lucky, I had for years of... happiness\"\n\nDISCLAIMER: I don't own any of the rights to the content used in this video, nor do I stand to profit from it. Finch has all the money..."}