{"title": "POI S4E06 Pretenders, p3 [Shaw]", "url": "https://www.youtube.com/watch?v=retr28lLMhA", "image": "https://i.ytimg.com/vi/retr28lLMhA/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "38981", "datePublished": "2016-08-07", "likes": "189", "dislikes": "5", "comment": ["Okay, walter  clearly represents the members of the fandom. Asking about Reese's voice and saying how cool he is XD", "Holy shit. A round like this? Doesn't need to shred through body armor; it just punches through it. Besides, that looks more like a grenade round or even IFV gun shell...", "Another question:  Where the heck was Root during this episode?  With Harold's absence, they certainly could have used her assistance.", "This is one of my favourite episodes.  I love the first scene in this video - they are just superheroes without costumes!", "I love this episode"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Episode summary:\nFollowing the apparent suicide of truck driver Abel Mindler, Finch and his team receive the number that belongs to Walter Dang (Erik Jensen), a worker at an insurance company and Abel's sister's coworker. In the absence of Finch (who has to travel to Hong Kong to present a paper at a conference), Shaw and Reese look into Walter's life. As their investigation proceeds, it is revealed that Walter, posing as a detective, is trying to find out who killed Abel. Walter gets dragged into a gang war that erupts between Elias and the unknown adversaries who want Walter dead. It is later shown that Abel, without his knowledge, was smuggling high explosive weapons to the same gang in New York. Walter is abducted by the gang that wants to know the location of the truck which Abel drove and then ditched, once he realized what he was smuggling. With Reese, Fusco and Shaw hot on the heels of Walter, they discover the place where Walter is held. In the ensuing gunfight between Reese, Fusco and the gang, Elias joins in and helps them. In the end, Elias meets with Dominic, the boss of The Brotherhood and it is shown that Dominic was the real mastermind behind the smuggled guns as he wanted to shift the balance of power in the city from Elias. Their conversation hints at a possible war about to start between the two factions in the near future. Meanwhile, at the conference, Finch meets Elizabeth Bridges (Jessica Hecht), the owner of a small tech company, and the two bond over a shared interest in mathematics as they travel from the conference to a hotel. On the way, the two are mugged, and their bags stolen. After discovering the restaurant at which the thief works, Finch and Bridges travel to the restaurant where Finch incapacitates the mugger with an umbrella. As the conference ends, Finch and Bridges part ways, and Finch meets with and pays the mugger, revealing that he staged the event to place software on Bridges's laptop. As Bridges leaves the conference, she calls a potential investor, who is revealed to be a Samaritan operative. Following a conversation between the operative and Greer, Samaritan's acquisition of various companies around the world is revealed (as is its interest in Bridges' company).\n\nOctober 28, 2014"}