{"title": "AHS Season 10 and Stories Posters Revealed!!", "url": "https://www.youtube.com/watch?v=rNK2qkIDC1I", "image": "https://i.ytimg.com/vi/rNK2qkIDC1I/hqdefault.jpg", "author": "MaryGirl Moody", "viewCount": "3485", "datePublished": "2020-11-13", "likes": "128", "dislikes": "3", "comment": ["Maybe Cody Fren will play a mermaid he has the beauty for it", "I think it’ll take place in the 70s because of the the little hint in 1984, I think that it’ll take place in a small town on the coast, The guy from home alone (sorry I can’t spell his name) as an old lighthouse keeper that has had an interaction with some sort of sea monster. I think that our queen Sarah Paulson and Evan Peters will be some sorta reporters like the lady in 1984, They’ll be trying to uncover the mysteries and the legends in the small seaside town—that’s all I ran out of brain juice. Ily😍", "I think it is going to revolve around the Mayflower. He tagged provincetown, massachussetts, which is notorious for being the location of where the pilgrims settled. This sets it up perfectly for the addition of sirens since they are on a boat. I also think it will majorly connect with Roanoke and may switch to past and present, with the present focusing incorporating a lighthouse maybe. But i really think its going to revolve around the mayflower.", "ready for new season and ready for ur reviews once this party starts", "I have been waiting for the old gods to show up in AHS ever since Scathach mentioned them, perfect timing for this as Lovecraft is experiencing a resurgence in popularity (please tell me you’ve seen Nic Cage in The Color Out of Space it is wackadoodle Gagey goodness.)\nLove you Mary, so happy to see you well & able to be making videos again!"], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r...\n\nAHS Season 10 and Stories Posters Revealed!! \n\nLinks mentioned in video:\n-National Suicide Hotline: 800-273-8255 website:"}