{"title": "POI S5E06 A More Perfect Union, p2 [Root, Shaw]", "url": "https://www.youtube.com/watch?v=RtS7hAoMyrE", "image": "https://i.ytimg.com/vi/RtS7hAoMyrE/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "67899", "datePublished": "2016-06-24", "likes": "294", "dislikes": "15", "comment": ["\"He's my service dog.. I have crippling anxiety.. \" Oh Root ❤", "is no one gonna comment on how both john and root just looked at each other (talking to each other telepathy that they shouldn't miss harold singing) looooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooool", "I love Root, how she always shows up with the most interesting stories, but honestly, while I get that this clip isn't completely in context, meaning it's not seamless from part 1 of the episode to this, her schtick is kinda getting a bit old to me.", "4:25 Reese’s eyes 😂", "“Marmaduke” LOL"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root and Bear.\nShaw remains unconvinced.\n\nEpisode summary:\nThe Machine's latest nine digits belong to a marriage license, sending Reese and Finch to a wedding to prevent what appears to be a black-and-white case of disapproval of the Groom by the father of the Bride, however the situation proves to be more complex. Samaritan has now begun to track Fusco, having previously labeled him a \"potential obstructionist\", and he refuses to give up. Right before heading to the wedding to serve as back-up and \"Finch's +1\", Root assigns the Machine's next number to Fusco, then allows him to borrow Bear for assistance. Greer is becoming desperate after discovering that Shaw's simulations have failed to lead Samaritan to the Machine and its assets. (She has now endured 7,053 simulations and has turned the gun on herself every time.) In an act of what appears to be desperation or brainwashing, Greer takes Shaw on a \"field trip\", trying to bend her moral compass in favor of Samaritan. Fusco's investigation leads him back to Bruce Moran, who seems to be caught up in a Samaritan-engineered interference with a demolition project. In another attempt to persuade Shaw that Samaritan's mission is noble, she is led to meet Gabriel, Samaritan's analog interface, who gives an ominous, apocalyptic depiction of what Samaritan is capable of, as the narrative returns to Greer and Shaw in the biometric simulation room, revealing the events not to have been a simulation, but a manipulation of Shaw's thoughts and neurological activity. Fusco and Bear arrive at the eventual demolition site and Fusco finds many of the missing persons he has been investigating, including Krupa and a dead Bruce Moran, only to be caught in the middle of the demolition operation itself.\n\nMay 23, 2016"}