{"title": "Person of Interest || Who would care", "url": "https://www.youtube.com/watch?v=RVDBlQHfj7U", "image": "https://i.ytimg.com/vi/RVDBlQHfj7U/maxresdefault.jpg", "author": "SnowFalls3", "viewCount": "46035", "datePublished": "2016-07-04", "likes": "1,272", "dislikes": "4", "comment": ["I also have to add AMY AKER!! what a transformation her character made in about 1 11/2   years!!!. She and shaw were BRILLIANT!! together!! I'll miss her!!", "Aw, wow, this was great! So damn creative! I love the idea of a tribute for the fallen, but the automatic association is sadness and angst. And though this vid had plenty of it, you made it anything but hopeless or miserable. Very creatively done, very unexpected sequences and order of shots, and great choice of voiceovers. Thanks for this, it was lovely to watch!", "The BEST SHOW on TV is GONE!!  CBS can SHOVE IT!!!!", "Named my cats Root & Shaw!! Badassery at its finest!!", "root and shaw is my life"], "authorLink": "https://www.youtube.com/channel/UCKs-C7ErWHx8QLKyRiindGQ", "description": "!!!Watch in 1080p!!!\n\n!SPOILERS FOR THE WHOLE SERIES!\n\n→ Every life matters. You taught me that. The numbers, our identities, they all mean something. It all adds up to something. All of this matters. We all matter.\n\nThis is my tribute to the show. It's a shame I only got to know it when it was already ending, but as they say better to have loved and lost than never to have loved at all. \n\nThank you, to everyone who made this show. For giving us these stories and characters, for bringing them to life. They won't be forgotten. \n \n\nI have so many more things I want to say... but maybe I already said them with this video.\n\nSophie.\n\n\nAll info at the end of the vid!\n\n-----------------------------------------------------------------------\nCopyright Disclaimer \nUnder Section 107 of the Copyright Act 1976, allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use."}