{"title": "POI S4E07 Honor Among Thieves, p3 [Shaw, Root]", "url": "https://www.youtube.com/watch?v=S6L-s72A77Q", "image": "https://i.ytimg.com/vi/S6L-s72A77Q/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "25612", "datePublished": "2016-08-15", "likes": "139", "dislikes": "6", "comment": ["I love the fact that Shaw won't put up with any crap even coming from Reese! She is very defiant!", "I really enjoy watching these POI clips, but can barely make out what Reese and Shaw are saying. Why do they have to whisper like commentators at a chess match? Finch and Fusco certainly don't.", "Shaw has a crush on Tomas 😂😂😂"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Episode summary:\nThe latest number is Tomas Koroa. At first, Tomas's life appears clean, but when he robs a jewelry store in under ten seconds, Finch and Shaw discover he is an international thief. As Shaw has just walked out of her old job as a wheelman, Tomas has piqued her interest. She enlists the help of Fusco and Reese to join his gang by getting one of his members arrested on a drug charge. Shaw, now on Tomas's team, helps them rob a safe, which unbeknownst to her and Tomas and the others, contains a deadly virus called Marburg, or \"MARV\". The other gang members were already aware and were paid off to betray Tomas and kill him. The attempt fails, however, the vials are stolen. Shaw offers to help Tomas, who wants to make things right and admits that he would never have accepted the job if he had known what he was stealing. After tracking the whereabouts of the virus, which is housed in a secure storage facility, Shaw realizes a couple of government operatives are doing the same thing—she identifies one of them as her former apprentice. Finch, now aware that the whole operation has become 'relevant', contemplates that he and his team resign from pursuing it any further, but he later changes his mind. In the meantime, Shaw and Tomas attempt to break into the storage facility to steal the vials, but they are confronted by a former teammate of Tomas, who was presumed dead, but was behind the theft of the virus in the first place. In the ensuing gunfight between Shaw, Tomas, his rivals, and the government operatives, Shaw manages to escape with Tomas and the vials, but then she gets caught by her former apprentice. Surprisingly, the operative lets them go when he sees the vials. As the government operatives move on to another mission, Shaw's apprentice deletes the CCTV video that shows him letting Shaw escape. In the end, Samaritan retrieves the damaged video, and starts repairing it, with its screen focused on Shaw's blurred face. Meanwhile, Root and Finch, at The Machine's prompting, investigate software engineer Jared Wilkins, founder of a new nonprofit called OTPS and recipient of a $12 million grant from Governor Dawson (who last appeared in \"Prophets\" and is being assisted by Greer and Samaritan). With Root disguised as Wilkins' son's nanny, Root and Finch discover that OTPS stands for One Tablet Per Student, an effort to give every New York student a 3D-printed tablet to assist in their education. Believing the tablets to be powered by Samaritan software, Root and Finch infiltrate Wilkins' facility and plant a virus which overheats the 3D-printers inside and ultimately destroys the building. As they leave the scene, Finch reveals to Root that the tablets' code was benign and not malicious. In doing so, he questions Root if the path they are on to fight Samaritan is indeed the right one and how much wrong they are willing to do to achieve it.\n\nNovember 11, 2014"}