{"title": "POI S4E03 Wingman, p1 [Shaw]", "url": "https://www.youtube.com/watch?v=SdP5kmIqbqU", "image": "https://i.ytimg.com/vi/SdP5kmIqbqU/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "66122", "datePublished": "2016-08-03", "likes": "348", "dislikes": "16", "comment": ["For someone who is not supposed to feel emotion Shaw was having so much fun at Lionel's expense with this one. :)", "Anyone besides me notice that throughout all of the seasons and episodes that none of the agents told Finch as things started into the unrecoverable tailspin it was his fault because...considering he is supposed to be the smartest guy in the room he hasn't a lick of commonsense.", "It being hot outside seemed reasonable for Shaw.", "I can relate to Fuskco.", "John . It was hot out . Me but shaw is inside ;)"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Shaw plays with Bear.\nShaw watches Lionel meet his dating coach.\n\nEpisode summary:\nThe Machine's next number is Andre Cooper (Ryan O'Nan), a \"wingman\"—a professional \"social liaison\" who helps other men find dates. Fusco goes under cover and works with Cooper. It develops that Cooper had worked with members of a mob and is going to testify in a murder trial. Eventually, Fusco and Cooper are taken captive by some mob members and are locked into a shipping container with the expectation that the brutal heat in the city will kill them from heatstroke. Reese, Shaw and Bear come to their rescue and are able to bring the mob gang into their precinct headquarters. Precinct Captain Moreno (Monique Gabriela Curnen), who had been critical of Fusco and Reese earlier, congratulates them on their good work, while wondering about the signature technique of hitting the knees. Later, Fusco enjoys a date with an attractive woman he had met at one of Cooper's parties. Meanwhile, Root recruits Finch to assist her in a mysterious mission. Pretending to be a famed underworld scavenger (Finch) and his assistant (Root), they purchase a black-market AT4 anti-tank weapon. Afterward, they are led to another black-market exchange with a Latvian mob, where they attempt to sell the launcher. At the last second, Finch breaks character, triggering a standoff that Root resolves by shooting the mobsters in the knees and tipping off the police. In the end, Root and Harold survey the now-abandoned mob hideout and discover duffel bags full of money and weaponry—a chance for the team to provide ongoing funding for their work.\n\nOctober 7, 2014"}