{"title": "American Horror Story Apocalypse Trailer and Breakdown", "url": "https://www.youtube.com/watch?v=sF06jntUAms", "image": "https://i.ytimg.com/vi/sF06jntUAms/hqdefault.jpg", "author": "MaryGirl Moody", "viewCount": "10652", "datePublished": "2018-08-06", "likes": "319", "dislikes": "12", "comment": ["I saw it as the incinerator being a nod to Arden & Eunice in Asylum, how they were burned together. And the man & woman could be them as well. The woman’s dress color was actually red (if you look very closely) just like Eunice’s, and Arden was a doctor and the man was wearing a surgical mask. If I’m completely wrong, my second guess is that his mask shows he’s not a doctor, but someone trying to avoid an illness. So maybe an illness is at root here ?", "Here is hoping for Myrtle Snow and her incomparable fashions. #Balenciaga!!!", "I read an article about season 8 earlier today and this is what it said: “As executive producer Alexis Martin Woodall said at the show’s recent Television Critics Association panel, “The story begins with the end of the world, and then our world begins.” Which could give more context about the hour glass. Also, it may not be a major storyline in this season but definitely a subplot, but I feel like the Coven will come to LA to look for Queenie and end up in The Hotel Cortez where they contact her spirit and draw it out like they did to Axe Man in season 3. That would be so dope!", "We stayed in the murderhouse. We escaped the asylum. We protected the coven. We attended the freakshow. We checked in the hotel. We had the roanoke nightmare. We joined the cult....and now....we await for the apocalypse.", "Maybe misty is reborn evil bc misty burnt 1st then died in hell with the hourglass. Just a thought"], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r...\n\nLink to trailer: https://www.instagram.com/p/BmJbLHYBP..."}