{"title": "Sarah Paulson as TB Karen (Episode 1/2 Scenes - AHS: Double Feature) (HQ)", "url": "https://www.youtube.com/watch?v=Sk08dQdnoQo", "image": "https://i.ytimg.com/vi/Sk08dQdnoQo/maxresdefault.jpg", "author": "AHS Crave", "viewCount": "6179", "datePublished": "2021-08-28", "likes": "201", "dislikes": "1", "comment": ["Sarah Paulson is the greatest actress of this generation", "red tide is amazing so far and i love the characters, but i’m sad it’s so short. i hope death valley is good too but after seeing kaia gerber in the trailer i can’t help but worry a little", "I saw the first two episodes of \"AHS: Double Feature\" the other morning, and I was so happy to see Sarah and Evan back on the show.  It wasn't the same without them in \"1984\".  Seeing them back was completely satisfying!  And I believe that Tuberculosis Karen will be yet another iconic AHS character by Sarah Paulson.  I can see it now.", "i have a feeling by the end the pill is going to run out and all those who took it are going to end up with nothing and tb karen is actually going to be a famous artist on her own", "Queen of coughing and rotting teeth 😍😍😍"], "authorLink": "https://www.youtube.com/channel/UC0xpCvB57MXDhrVOryp1z3g", "description": "All scenes of Sarah Paulson as TB \"Tuberculosis\" Karen from \"American Horror Story: Double Feature: Red Tide,\" which also stars Evan Peters as Austin Sommers, Lily Rabe as Doris Gardener, Finn Wittrock as Harry Gardener, Ryan Kiera Armstrong as Alma Gardener, Frances Conroy as Sarah \"Belle Noir\" Cunningham, Billie Lourd as Leslie \"Lark\" Feldman, Leslie Grossman as Ursula, Adina Porter as Chief Burelson, Angelica Ross as The Chemist, Macaulay Culkin as Mickey, and Denis O'Hare as Holden. Episode 1, \"Cape Fear,\" is written by Ryan Murphy & Brad Falchuk, directed by John J. Gray. Episode 2, \"Pale,\" is written by Brad Falchuk & Ryan Murphy, directed by Loni Peristere. All rights belong to FX Networks and 20th Century FOX."}