{"title": "Person of Interest is Worth Your Time", "url": "https://www.youtube.com/watch?v=T5GR7FhHzbc", "image": "https://i.ytimg.com/vi/T5GR7FhHzbc/maxresdefault.jpg", "author": "Five by Five Takes", "viewCount": "9244", "datePublished": "2020-11-13", "likes": "899", "dislikes": "9", "comment": ["Person of Interest is a work of art, it's right up there with The Expanse, Babylon5 and, as you said, Buffy. The background storyline will take you places inside yourself that you didn't know existed. Like the other shows I mentioned, you have to watch at least 1-2 seasons for the show to catch you, but once it does you will never be the same again.  Many people give up on shows after 5 eps, which is sad. All the great shows need an investment in your time to get the reward.", "Fusco is lowkey one of the best characters.", "\"There is nothing more human than our ability to chose.\"\nHow is it you manage to come up with quotes that can be as meaningful as the show you're discussing?   I remember in one of your She-ra videos you said; “Often, the worst part isn’t just sitting in our own darkness but feeling like we’re doomed to be the only ones who can see it.”  That's straight up one of the deepest and most powerful lines I've heard period.", "\"if you can hear this, you're alone. The only thing left of me is the sound of my voice. I don't know if any of made it, did we win, or did we lose? But either way, it's over. So let me tell you about POI...\"", "POI is one of my favorite shows, I’m so excited it’s one of yours too. I stopped watching it during it’s first season because it was too much like the other CBS procedurals, but I heard some good things about it during its second season and hopped back on. It is the rare show that gets better each season. It gets more complex without becoming convoluted. I’ve rewatched it on Netflix and the second watch is even better."], "authorLink": "https://www.youtube.com/channel/UCC2Bw649-AJJWJDX74f85qg", "description": "this show is is part comedy part existential crisis, part taraji henson/sarah shahi/amy acker appreciation. i love it so much\ni wanted to show off more of the music but it got claimed so i didnt but the point still stands\n\nmy twitter "}