{"title": "American Horror Stories Plot Speculation", "url": "https://www.youtube.com/watch?v=THo1erufHIQ", "image": "https://i.ytimg.com/vi/THo1erufHIQ/maxresdefault.jpg", "author": "Reel Talk", "viewCount": "447", "datePublished": "2020-10-07", "likes": "30", "dislikes": "0", "comment": ["Honestly, just give my godamm Michael Langfon spin off episode of what the hell he was doing in the Sanctuary and I'll be happy for the eternity 😁", "There was a Dr. Who story where an alien's ship exploded and its consciousness was split between various period of time. Except each piece was fully aware of what the other pieces were experiencing. What if AHS did the same thing. A spaceship from the future experiences some incident and the crew are disbursed into several periods of time. The difference is none of them have memories of who they are, or what has happened to them. They only have memories of their current place in the time stream. This would explain why Fionna Good looks like Elsa Mars and so on. Now, imagine the spin-off series having someone from the future trying to send clues to the cast to try and make them establish some sort of connection between the split parts. For instance: Send the sheet music of Fionna Good's favorite songs to Elsa Mars.", "I still want an Emma Robert and billy porter spinoff. It would be a tear jerker", "All I’m hoping for is more witch stories", "I’m a tiny bit torn on which I would want to see more:/ while I’d love to see more grounded stories that are heavily based on true events, I wouldn’t ever turn down something that could broaden the AHS universe and give us some truly fun content with things both familiar and new. Whatever the outcome, I’ll be happy to see American Horror Stories when it can be made and come out no matter how they handle it."], "authorLink": "https://www.youtube.com/channel/UC4GPRqEoZ4zpnTHIxcG5JyQ", "description": "American Horror Stories Plot Speculation!\n\nSo, I was thinking, what if the American Horror Story Spin-off (American Horror Stories) is an episodic anthology series that deals with various real life American horror stories with a twist. Let's discuss!\nTwitter: "}