{"title": "POI S4E11 If-Then-Else, p2 [Root x Shaw, Root]", "url": "https://www.youtube.com/watch?v=U2FmvwglS1Y", "image": "https://i.ytimg.com/vi/U2FmvwglS1Y/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "46975", "datePublished": "2016-08-15", "likes": "174", "dislikes": "2", "comment": ["\"Don't anybody move or I'll blow this train sky high!\" and people start scrambling for the exits! LOL. So would I.  By the time Mr. Amateur Bomber decides what next to do, he'd have to settle for a nearly empty car.  Like almost everybody else, I'd rather take my chances 4 or 5 cars away if I can because if it's not a mega blast, the odds of surviving injuries are a lot better than being close up if/when it goes off or the same happening on a plane in flight.", "comming back to POI after a while because i went on a frizzz", "Rosineide  dos  Santos Souza 100💘💘💘💘💘💘💘😘😍🔥🌹👌"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Episode summary:\nFollowing the stock market crash that occurred in the previous episode, Finch, Reese, Fusco, and Root go to install software at the stock exchange that will stabilize the market. However, they are almost immediately intercepted by Samaritan operatives, who corner them in a room. Out of options, the team turns to The Machine, who in a matter of seconds provides a multitude of projections and outcomes in each (while doing so, it reflects on multiple chess matches it played and the lessons it learned with Finch in 2003). In one simulation, Finch and Root go to install the software while Reese and Fusco secure their escape route. However, both teams are quickly surrounded by Samaritan operatives, who kill Finch, Reese, and Fusco, forcing The Machine to reset the simulation. In the second, the two teams switch places (Reese and Fusco install the software while Finch and Root secure the route). Here, Reese and Fusco are once again trapped, and Reese sacrifices himself by setting off a grenade after installing the software. Likewise, Root is killed by Martine and her group of operatives while trying to disable an elevator lock. In a final simulation, all four of The Machine's assets move together, securing the software and the extraction. They are once again intercepted before they can escape, with The Machine projecting a roughly 2% chance of survival. Out of time, The Machine selects this as the most preferable and instructs the team to follow it. Meanwhile, Shaw is stuck on a subway train with a stock market exchange manager with a security code to the exchange's server room. However, she is interrupted by a would-be suicide bomber who she kills in the first two simulations (and thus gets herself arrested) but talks down in the final and ultimate outcome. After sending the code to Root, she arrives as the two teams clash, opting to hold the Samaritan operatives off as Finch, Reese, Fusco, and Root escape. She kisses Root and traps them in the elevator, but as the team watches on in horror, Martine shoots Shaw multiple times before approaching her with her gun aimed at her head as the elevator doors slam to a close.\n\nJanuary 6, 2015"}