{"title": "LOKI: Every Plot Hole and Unanswered Question--EXPLAINED | Marvel Breakdown", "url": "https://www.youtube.com/watch?v=u3Kabz0YTMM", "image": "https://i.ytimg.com/vi/u3Kabz0YTMM/maxresdefault.jpg", "author": "ScreenCrush", "viewCount": "195310", "datePublished": "2021-07-22", "likes": "6,646", "dislikes": "174", "comment": ["Play World of Tanks here: https://tanks.ly/3hMpkZD and use the code GIJOE21 to activate an in-game mission to receive free GI Joe emblems to decorate your tanks and also get:\n● 7 Days Premium Account\n● 500k credits", "Prediction for Season 2 - Mobius finally... FINALLY gives us a \"Wow\".", "I think the Avengers' time heist was \"supposed to happen\" because that's how Tony began the development of the technology that would eventually allow Kang to become Kang.", "Concerned executive: It's going to be hard to solve all these plot holes\n\nKevin Feigi: No, it's super easy barely an inconvenience", "For those asking why the Avengers weren't arrested for any time crimes: the Sacred Timeline isn't sacred because it's objectively better than other timelines. It's just the chain of events that He Who Remains chose to allow to happen. Time criminals aren't people who commit crimes in the legal sense, but rather people who make choices that divert the history from the preset path (which they don't know about). There is no justice in this, and the trial and choosing the words 'crime' and 'criminals' are just ways to make the TVA employees feel more invested in their work."], "authorLink": "https://www.youtube.com/channel/UCgMJGv4cQl8-q71AyFeFmtg", "description": "Play World of Tanks here: https://tanks.ly/3hMpkZD and use the code GIJOE21 to activate an in-game mission to receive free GI Joe emblems to decorate your tanks and also get:\n● 7 Days Premium Account\n● 500k credits\n● Premium Tank T14 (Tier 5)\nThank you World of Tanks for sponsoring this video.\n\nLoki has ended, but the show still left many lingering questions about Kang, the TVA, Variants, Sylvie--and the greater connections to the Marvel Cinematic Universe. \n\nIf you're new, Subscribe! → "}