{"title": "American Horror Story: The Best of Frances Conroy", "url": "https://www.youtube.com/watch?v=u7FmQSvraFE", "image": "https://i.ytimg.com/vi/u7FmQSvraFE/maxresdefault.jpg", "author": "GameSpot Universe", "viewCount": "254879", "datePublished": "2019-11-12", "likes": "6,060", "dislikes": "78", "comment": ["people say Sarah is the most underrated actress out there but it's almost criminal the way Frances is not taken seriously enough and don't get the recognition she deserves, it really makes me mad cuz she is one of the most talented actresses jn the show", "I cried SO HARD when Moira was reunited with her mother. Then cried again when I realized that because of the reset, she was stuck in the house again.", "Frances Conroy and Lily Rabe need to lead the next season of AHS", "Myrtle Snow has the best lines ever", "Myrtle saved the world on Apocalypse season. Every play came by her. She presented the Tempus Infinitus to the witches . She is the best witch ever. She’s got 5 of the 7 wonders and plus, LITERALLY EVERYTHING SHE SAYS IS GOLD."], "authorLink": "https://www.youtube.com/channel/UCRgUg0jJUgGMadGPzzmu8cw", "description": "From Moira O'Hara to Myrtle Snow, Frances Conroy has been a staple on American Horror Story starring in seven seasons.  Ryan spotlights her entire career on the show which includes Murder House, Asylum, Coven, Freak Show, Roanoke, Cult and Apocalypse.\n\nThis week we are putting the spotlight on Emmy-nominated and Golden Globe-winning actress Frances Conroy. In Season 1 - Murder House, we first met her as Moira O'Hara, the housekeeper and maid at the Murder House. In season 2 - Asylum, Conroy played Shachath, the Angel of Death. Her most iconic AHS character is Myrtle Snow, from Season 3 - Coven, and Season 8 - Apocalypse. \n\nIn AHS Freak Show (Season 4), Conroy played Gloria Mott, the wealthy and widowed mother of Dandy Mott. After taking a season off of American Horror Story, Frances returned to the show for Roanoke’s reality-show reenactment of Mama Polk. Here she played an actress playing the part of the Polk family matriarch in “My Roanoke Nightmare.” For AHS Season 7 - Cult, Frances appeared as Bebe Babbitt in a pair of episodes.\n\nSubscribe to GameSpot Universe! "}