{"title": "Who Killed The Walking Dead?", "url": "https://www.youtube.com/watch?v=ujoRDTdXSyc", "image": "https://i.ytimg.com/vi/ujoRDTdXSyc/hqdefault.jpg", "author": "MaryGirl Moody", "viewCount": "303", "datePublished": "2018-01-04", "likes": "24", "dislikes": "0", "comment": ["Great Video Mary! I do blame AMC for the decline for the most part and ultimately, I bet Gimple will fall on his sword for AMC as the Patsy in the end and loose his job.  Many of the fans want blood for what happened in the decline of the drek storylines, in-cohesive plots, the up & down, unrealistic character development, and ultimately, Carl's \"bite\" was the straw that broke the camel's back.  AMC will be the proverbial Pontius Pilate and eventually wash their hands of Gimple before turning him over to the angry mob of fans for a Scourging & Crucifixion.", "The shade is strong 💪 iconic", "loved this video and i agree 💜", "I’m personally over the long-ass breaks. It’s still my favorite show...I think? Like I said,the months long breaks are actually making me lose interest. I’ve got a life to live dammit! If I can’t have sort of immediate gratification then after all these years I’m feeling less excited about the show. Sadly.🙁", "Loved this video format Mary! I have a friend that is head over heels for TWD to the point where he will talk about nothing else! It’s crazy to me. I liked the first season, it was cool. Who had put zombies in a tv show before right? Season 2, I lost interest. Season 3 rolled around and I watched for the hell of it. They took Andria and destroyed her and for that, they lost me for good. Now I’m hearing about Tigers and a Baseball bat named Lucy? Like, wtf? It’s all about the money, what a shame."], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "***SPOILERS!!!!*** IF YOU HAVEN'T WATCHED THE SHOW DON'T WATCH THIS VIDEO!\n\nDISCLAIMER: I DO NOT OWN THE SHOW IN THIS VIDEO. IT IS PROPERTY OF AMC NETWORK. LINK: "}