{"title": "The Walking Dead Universe Needs Momentum (RANT)", "url": "https://www.youtube.com/watch?v=UqNdgU8yKyY", "image": "https://i.ytimg.com/vi/UqNdgU8yKyY/maxresdefault.jpg", "author": "Reel Talk", "viewCount": "223", "datePublished": "2021-06-30", "likes": "22", "dislikes": "1", "comment": ["The Walking Dead should’ve started with an ending in sight, and built up to it from the beginning, like that of game of thrones or breaking bad. What’s sad is that Fear the Walking Dead actually had that in mind, especially with the end of season 3, setting up Madison as a villain, however that was thwarted by Scott Gimple and now the show will suffer the same aimless fate as the main show. Despite the fact that both these shows will probably soon end, the pay off will pale in comparison to a story that would’ve been set up from the beginning. Essentially instead of a story with characters who progress and crash down at the end, both shows are now suffering a rinse and repeat formula, until they rinse and repeat one last time and the show ends, as oppose to an ‘ozymandias’ or ‘the bells’ style episode where we see some proper dramatic payoff to a story that was built up to from the very beginning or early on in the show.", "Time to get my awesome flaming popcorn to watch even more of this potentially awesome discussion video!!!!!!!!🔥🔥🔥🔥🔥🔥🍿🍿🍿🍿🍿🍿", "I have watched this show (franchise) for a decade.  It’s loosing its “pop” tone to wrap it up.", "Hey look I understand the main show has been amazing ever since Season 9 even stronger then ever but the spin off shows haven’t been great if they really want the future shows to succeed I believe we have to have a massive crossover", "6A of Fear was good, unfortunately I feel like 6B faltered a bit at the end with underwhelming/weird stuff"], "authorLink": "https://www.youtube.com/channel/UC4GPRqEoZ4zpnTHIxcG5JyQ", "description": "The Walking Dead Universe Needs Momentum (RANT). With the ending of season six of Fear the Walking Dead, It has become pretty clear that the franchise is spinning it's wheels. The series needs to get a grip on itself sooner rather than later. Let's dicuss!\nTwitter: "}