{"title": "10 ‘American Horror Story’ Season 10 Theme Theories That Actually Make Sense", "url": "https://www.youtube.com/watch?v=uul6P6ARMbg", "image": "https://i.ytimg.com/vi/uul6P6ARMbg/maxresdefault.jpg", "author": "Alternative Press", "viewCount": "4701", "datePublished": "2020-04-08", "likes": "121", "dislikes": "7", "comment": ["What do YOU think the theme for AHS season 10 will be? Tell us! And don’t forget to subscribe to APTV and turn on all notifications so you never miss a video!", "Pirates/ghost ships please. Bring in some of the Caribbean \"voudo\" cameos.", "They could have at least say whats the title  maybe something like \nAHS: Pandemic \nAHS: Lost\nAHS: Bridgewater Triangle", "i think this season will involve the space theme/alien theme that was first presented in season 2 of AHS. With this, because we really don't know much about the ocean in general, the idea that alien-like creatures dwell in the deep sea could go hand and hand with the beach clues that Ryan Murphy has been dropping. Also, as Ryan said, a huge clue is revealed in episode 8 of AHS 1984. Right in the beginning of the episode, the reporter mentions both aliens and the Loch Ness Monster. Could the legend of the Loch Ness Monster be incorporated into the ideas of aliens? The hitchhiker in this episode also tells jingles about the feeling of being lonely like drifting in space forever. I'm definitely aware that i've been pressing the alien theme for every season following season 2 lol, but the beach hints to me suggest that the entire season won't be about the beach, but rather what lurks in the ocean or how aliens can use our oceans as sort of \"landing docks\" for their UFOs (whatever that means). Again, the Loch Ness Monster may be incorporated which could relate to aliens of some sort.", "I need to figure out what this season is"], "authorLink": "https://www.youtube.com/channel/UCH_TWswNlSRz9LtnpWOmA2Q", "description": "#AmericanHorrorStory #AHS #Horror\n\nThings are beginning to wash up on shore\n\nIt’s been four months since American Horror Story: 1984 ended and we’re thirsty for season 10. Thanks to some cryptic teasers released by the AHS camp in the last few weeks, fans have a vague idea of the next edition’s themes.\n\nWe don't know the title of the milestone season yet, but we know our cast list includes returning favourites Sarah Paulson and Evan Peters while introducing newcomer Macaulay Culkin to the gang. Sounds crazy already? The fan theories on what to expect this year are even more surreal.\n\nMake sure to Subscribe! And tap the bell so you NEVER miss a video: "}