{"title": "American Horror Story Cult Live Stream", "url": "https://www.youtube.com/watch?v=UxNIYGkuO3g", "image": "https://i.ytimg.com/vi/UxNIYGkuO3g/maxresdefault.jpg", "author": "MaryGirl Moody", "viewCount": "475", "datePublished": "2017-11-09", "likes": "49", "dislikes": "2", "comment": ["I love this AHS season.  It can be REAL.  That’s why I love it so much.  \n\nMary, you need to finish your book. Hugs.", "So sorry for your loss Mary...I can feel your grief.  Hugs to you 💓.  PS I just signed the petition.  I have been saying your theories are SO much better than what actually happens.  Fingers crossed for you!", "Oh Mary, honey, I completely understand your pain.  I lost one of my lifelong friends in January to fentanyl addiction.  I tried so hard to help her so many times, but toward the end, I basically turned my back on her and have felt like the worst friend in the world ever since!  I’m telling you this because I want you to know that you are not alone!  Keep doing what you do and get the book printed....what a wonderful way to remember your friend!  Sending lots of love ❤️ and light your way!  PS...when I start feeling down about my LeAnn, I listen to Lady Gaga’s song Joanne....”honestly I know where you’re going...and baby you’re just moving on...”", "Hey Mary, sorry i missed the notification... i have all the empathy in the world for you, been soooo buried in grief it’s hard to breathe. Sending big mommy hugs xoxo \nOK, back to Cult\n1.) About reimagining the stories... remember that they are all Kai’s fuckballs crazy interpretations of reality, he was telling them what he wanted them to think really happened, even Ozzy challenged the validity of one. Also “writers privilege” it’s not a documentary, right? Side note: Roman Polanski allows all of the Harvey Weinstein’s of the world to exist, disgusting puke bags.", "Signed the petition! Rooting for you!"], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "Let's talk about American Horror Story Cult. \n\nPetition Link to MAKE MARY AN AMERICAN HORROR STORY WRITER: "}