{"title": "What Spiral Says About the SAW Franchise's Longevity", "url": "https://www.youtube.com/watch?v=UyaxqDFvCGg", "image": "https://i.ytimg.com/vi/UyaxqDFvCGg/maxresdefault.jpg", "author": "Reel Talk", "viewCount": "1873", "datePublished": "2021-05-04", "likes": "107", "dislikes": "5", "comment": ["Tbh this franchise should have done this new killer angle after 4 I always thought it was weird they kept using tobin bells voice after 4.", "Somehow I never thought about the \"pig\" thing. This was very interesting. Esp pointing put the \"marionette'. This is why we need your channel and channels like yours. Sometimes we miss things. I'm still waiting for Chris Rock to say something hilarious. I wonder if it was hard for him not to make jokes lol", "According to Chris Rock, the origins of Spiral came from a chance meeting with the head of Lionsgate at a friend's wedding, and he felt doing something in the horror genre would be a new avenue to take in his career, though he planned to include some comedic elements in the film.[12] Rock approached Lionsgate with his ideas of extending the franchise, who became very interested in the concept.[13] Lionsgate's CEO Joe Drake said that Rock's idea was \"completely reverential to the legacy of the material while reinvigorating the brand with his wit, creative vision and passion for this classic horror franchise\".[14] By January 2018, industry rumors had said that Lionsgate had begun discussions of a ninth Saw film, for which The Spierig Brothers would not be returning.[15] The directors confirmed in an interview with Screen Rant that their film laid the ground work for future sequels.[16] Tobin Bell stated that he would be willing to return as John Kramer / Jigsaw for a ninth Saw film as long the script is good and expressed interest in delving into the origins of Billy the Puppet.[17] By April 2018, Twisted Pictures was developing a sequel with Jigsaw writers Josh Stolberg and Peter Goldfinger.[18] An early iteration of the script had Rock's character related to Danny Glover's David Tapp from the first film. Stolberg and Goldfinger opted not to go in this direction as it \"didn't pass the smell test.\"[19]", "God damn you being consistent with them vids loving it", "Congratulation to 11000 subscribers. ❤"], "authorLink": "https://www.youtube.com/channel/UC4GPRqEoZ4zpnTHIxcG5JyQ", "description": "What Spiral Says About the SAW Franchises Longevity.\nTwitter: https://twitter.com/ReelToRealPro"}