{"title": "POI S3E20 Death Benefit, p1 [Shaw, Root x Shaw]", "url": "https://www.youtube.com/watch?v=V-Z31wEwgFA", "image": "https://i.ytimg.com/vi/V-Z31wEwgFA/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "110591", "datePublished": "2016-07-15", "likes": "541", "dislikes": "13", "comment": ["I looked on Google to look up why person of interest was cancelled, like I thought it wasn't the ratings. It was the battle over profits between WB and CBS.", "It was always amazing fun to watch Shaw eat.  I suppose she was eating for three?   ;   )", "Shame, that this was cancelled. Over greed. It will take us all down.", "I would not have left the briefcase of money behind. The drugs were enough to deal with those guys.", "when is Person of Interest with Shaw going to be on primetime!! and NOT 3:00am!! SERIOUSLY!!"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Shaw enjoys pancakes with abandon.\nRoot and Shaw ride a motorcycle.\n\nEpisode summary:\nThe new number is Congressman Roger McCourt (John Heard), a self-described dealmaker; the team is initially baffled, since he has no enemies and there seems to be no danger to his life at all. They eventually discover a connection to Decima: McCourt admits agreeing to help Decima with favorable legislation in the Congress (granting Decima access to government surveillance feeds), while Decima gives him insider stock trading tips. Reese concludes that they are meant to be the danger, as the Machine wants them to kill McCourt in order to prevent Decima killing many more people. Harold is disturbed at this conclusion, and leaves the team, not wishing to participate in an assassination. McCourt is secretly left alive, and proceeds with Decima's plan. Greer also approaches a reluctant Senator Garrison, offering him a 24-hour beta test of their machine. Garrison agrees, and Greer immediately uses Samaritan to start to track down Finch. Meanwhile, Root is travelling across the country, dealing with various relevant threats.\n\nApril 15, 2014"}