{"title": "American Horror Story Cult Episode 6 To Be Edited  - Thoughts and RANT", "url": "https://www.youtube.com/watch?v=vFhlK5_BD_I", "image": "https://i.ytimg.com/vi/vFhlK5_BD_I/hqdefault.jpg", "author": "MaryGirl Moody", "viewCount": "980", "datePublished": "2017-10-09", "likes": "83", "dislikes": "8", "comment": ["What FX is doing is called “common gratitude” big up FX", "I think the desensitization of our society is actually a big theme this season. If you remember, people are not paying much attention to the murders committed by the cult. I think it's brilliant commentary by Ryan! I agree with your opinion and loved the video! ❤️", "I respect the decision I'm glad it wasn't post pone or even cancelled .at least we can watch the unediting version in other platforms", "Howdy Mary. Well, to be honest, I am not really sure how I feel about the edited episode. I respect their decision to do so. Marvel did something somewhat similar for New York Comic Con this past weekend. They cancelled the Punisher screening and panel on Saturday due to the shooting. We were all disappointed, but it is just a cancelled panel. All these companies and creators have the right to conduct their properties and businesses in the manner they see fit. We as viewers and consumers just need to put on our big boy pants and accept their decisions and move on. I don't personally agree with the censorship, but I am an adult man, and there is real shit going on in the world to worry about, and an edited episode or a cancelled event does not compare to these real tragedies. Just like you said, we will most likely see the uncut version someday, or if not, will it really be that much of a loss? Stay safe and cool! Much love from NJ!", "Well said , Mary! Im so glad this was said 😀 💚 couldn't agree more!"], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "This time, I don't give a fuck what anyone thinks and I'm ranting.\n\nlink for source video: https://www.youtube.com/watch?v=2ZmM-..."}