{"title": "A Tribute To Mission Impossible (25th anniversary)", "url": "https://www.youtube.com/watch?v=vJRuwkun7Gw", "image": "https://i.ytimg.com/vi/vJRuwkun7Gw/maxresdefault.jpg", "author": "Real Scorsese", "viewCount": "9110", "datePublished": "2020-09-13", "likes": "249", "dislikes": "4", "comment": ["This was great! I definitely need to re-watch these movies now!!!", "Thank you for showing all that Mission Impossible 2 action, It’s my favorite Mission brings back so many memory’s! Plus it has a kickass soundtrack, I’ve love a modern twist to the next films with a little MI-2", "encore un travail remarquable de ta part GG", "What ever unexpected surprise they will bring us in the next Mission Impossible-7 and 8 , I just hope Rebecca's Ilsa character not be killed off", "12 minutes de tuerie ! Un bon défouraillage sec, de l'épique, de l'action, de la comédie, de l'émotion.... sérieux tu as fait honneur à la saga avec ce tribute, la quantité de travail devait être énorme mais on sent bien la passion et l'amour que tu as pour cette lisence ! Allez mec je vais me DL tous les MI maintenant ^^"], "authorLink": "https://www.youtube.com/channel/UCi8K1-uC3NazkioWBnDk_5w", "description": "Your mission, should you decide to accept it...\nThank you @Poulpette for the french subtile!\n\nSongs:\nDanny Elfman - Arrival In Langley\nReally Slow Motion & Giant Apes - String Slaughter\nLimp Bizkit - Take A Look Around\nLimp Bizkit - Take A Look Around (Instrumental)\n2WEI feat. Ali Christenhusz - Run Baby Run (EMERGENCE)\nEpic and Emotional Orchestral Soundtrack Music - Awakening\nMission: Impossible (Epic Orchestral Fan-Made Soundtrack) - Compass Pictures - Composer\nJack Trammell - Mission Impossible Theme (Official Audio)\nSister Sledge - We Are Family\nThe Last Resort - Lorne Balfe\nFallout - Lorne Balfe\n\n**\"Copyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"**"}