{"title": "American Horror Stories Episode 6 Review \"Feral\"", "url": "https://www.youtube.com/watch?v=vlSEcqhuils", "image": "https://i.ytimg.com/vi/vlSEcqhuils/maxresdefault.jpg", "author": "Reel Talk", "viewCount": "4873", "datePublished": "2021-08-11", "likes": "170", "dislikes": "6", "comment": ["i agree this episode was truly terrifying. i personally hate cannibal movies/concepts but the way it was tackled in this episode was aaaamazing, i genuinely was scared😅 cody fern was incredible. i love him so much & i really thought the twist with Birch was done so well also & is it weird that i expected jacob to be alive?.. but i didn’t expect him to sacrifice his parents the way he did😭", "This episode gave me roanoke and wrong turn the original and the reboot vibes with the tribe and cannibals and the creatures were like the raspers from asylum this was my 2 favorite episode the first is ba al", "This episode was awesome in my opinion! The feral humans reminded me of the hills have eyes! Great episode!", "This episode was the only one in my opinion that was just well acted, well written straight horror. Loving the focus on urban legends and actually sympathetic characters. The ending was super shocking and I loved that. The effects and cinematography felt fresh and while I love some campy gory nonsense, it was nice for american horror story to go back to its more traditional horror roots. Sensational time watching this week. Hope they can keep it going for episode 7 :)", "The actor who played the father played Danny in Grease Live and started in the Les Mis movie. I really enjoyed this episode. I thought I saw Naomi Grossman (Pepper) as one of the monsters....."], "authorLink": "https://www.youtube.com/channel/UC4GPRqEoZ4zpnTHIxcG5JyQ", "description": "Wow, that was the best episode by far. Is it me or is this AHS spinoff finally coming into its own? Well, we might have to wait a little bit to answer that one. The next episode is the last for a while, and it sounds like we are headed back to familiar territory. Let's discuss!\nTwitter: "}