{"title": "Reaction To DEFRA Decision To Kill Geronimo The Alpaca — Chris Packham", "url": "https://www.youtube.com/watch?v=vmQWyNwCjsA", "image": "https://i.ytimg.com/vi/vmQWyNwCjsA/maxresdefault.jpg", "author": "Chris Packham", "viewCount": "5982", "datePublished": "2021-09-01", "likes": "495", "dislikes": "7", "comment": ["Totally agree Chris : like you, the events of Defra’s assault on the poor animal and total lack of empathy, affected me greatly and leave me feeling so depressed. My overriding feeling is , these Defra people acted in anger , determined to show that no one can push them around. I hate to think of how they treated him away from the cameras in his last moments.", "In total agreement Chris. I totally feel your depression. So difficult to remain positive at the moment. I want to believe that things will get better. Hard to see when you're in a \"low\". We just have to stay strong and keep on \"being kind\". Thank you for your hard work, and wise words. Dont lose your spirit.❤🕊", "I've already commented on FB about this appalling decision and the way it was carried out but just want to send you some care as well as although it IS horribly depressing YOU are making a difference and people are waking up and we have to remain as positive as we can to the last breath. Love what you do.", "100% Chris. Shocked and disgusted about the entire story. Is this really our Great Britain today? Shame on DEFRA", "Sorry to hear your feeling low Chris, surely by not allowing an independent vet be present at autopsy  will make it look like they are trying to hide things.\nKEEP YOUR CHIN UP CHRIS THINKING OF YOU CYBER HUGS."], "authorLink": "https://www.youtube.com/channel/UCSdDTUWSBvn5qp6yvKCmsNg", "description": "DEFRA are out of control, arrogant and unaccountable – beyond the reach of science and public opinion and beholden to the powerful lobbyists who have insidiously infiltrated and crippled their duty to the UK taxpayers and presided over the greatest animal welfare PR disaster in living memory.\n\nFollow Chris online\n➤ "}