{"title": "American horror story murder house - billie dean howard in the murder house first time", "url": "https://www.youtube.com/watch?v=vONi5Z2xxHU", "image": "https://i.ytimg.com/vi/vONi5Z2xxHU/hqdefault.jpg", "author": "ONCEUPON a HORRORSTORY", "viewCount": "81040", "datePublished": "2016-08-18", "likes": "779", "dislikes": "9", "comment": ["Billie is by far one of the most underrated characters in AHS history", "Billie dean was my favorite character. Whoever Sarah plays is my fave automatically 😂 \n(Or whoever Jessica plays)", "00:41 gave me goosebumps when I first saw that on TV ... wish we had seen more of Billie in the first season", "When Constance explained about the 'powerful effect' when a medium meets a spirit directly; It was Violet who affected her, but Constance didn't know that Violet is dead so she thought it was Tate.", "For those who don’t understand why Billie flip out on Tate I’m going to explain. Whit the new AHS Apocalypse and it being murder house and coven crossover I have a theory that makes some sense. See in murder house Billie explains to Constance about the antichrist and how he will bring the end of the world.  In AHS apocalypse I’m almost 100% this will be the plot. Now Billie also explains that the antichrist is born from a spirit and human which is Tate’s baby in the end of AHS 1 from rapping violets mother but the reason Billie flips out on Tate is because Billie states that the “DEVIL” is the one to impregnate the human. Although Tate isn’t the Devil he is Evil incarnated, he’s perverted and Malicious and has no remorse he’s nothing but pure negative hate except for his love for Violet but he will kill for her so that’s not Pure innocent love. He’s like a Devil himself so his presence must be that Strong and Negative for her to flip out and not want him there notice how slow and Afraid she is to turn and look at him because it would be like looking at the Devil himself."], "authorLink": "https://www.youtube.com/channel/UCGIQHvkZPzrna7UHtmlgoXw", "description": "American horror story murder house - billie dean howard enters the murder house for the first time\nBillie dean Howard meets Tate"}