{"title": "POI S3E05 Razgovor [Разговор], p6 [Shaw, Root x Shaw]", "url": "https://www.youtube.com/watch?v=vOp9XBbU7aw", "image": "https://i.ytimg.com/vi/vOp9XBbU7aw/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "108155", "datePublished": "2016-07-03", "likes": "569", "dislikes": "12", "comment": ["I feel sorry for the boy or girl that eventually hurts that young girls feelings and has Shaw come a knocking.", "Great acting on the part of the kid , and we see the first glimpse of Shaw's emotions that as the kid put it \"are turned way down'\".", "\"Enough.\" That smile on his face was truly terrifying. LOL.", "I am amazed,  did I detect a tear in Shaw's eye when the girl gave her The Order of Lenin metal?", "What an amazing actor that kid is"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Shaw takes Genrika to school.\nFlashback: Shaw backstory.\nRoot kidnaps Shaw.\n\nEpisode summary:\nIn a series of flashbacks to Shaw's childhood it is revealed she was in a car with her father when he was killed in a wreck, but that she showed a shocking lack of emotion over it. In the present, after Shaw saves another number, Finch begins expressing concern about Shaw's callous treatment of them. Their next number turns out to be a little Russian immigrant girl named Genrika Zhirova (Danielle Kotch), Gen for short, who is deeply interested in espionage and is living with an older cousin in a run-down apartment. Shaw ends up watching after Gen when men come to attack her, and the two start to bond. Shaw explains that she never feels emotions the way most people do. The team learns that Gen had been bugging the phones in her apartment building and overheard information she should not. Some of the mobsters she recorded manage to abduct Gen. Meanwhile, Carter is continuing her investigation of HR and is following Terney when she runs into Reese, who was unwittingly tracking Terney's phone to find out who was going after Gen. Elsewhere, Carter has been asked to meet her partner Laskey at a bar, where he confronts her about her work with Reese. The episode ends with Root arriving at Shaw's loft and abducting her.\n\nOctober 22, 2013"}