{"title": "POI S4E13 M.I.A., p4 [Root x Shaw]", "url": "https://www.youtube.com/watch?v=VrWvjABOIxM", "image": "https://i.ytimg.com/vi/VrWvjABOIxM/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "36999", "datePublished": "2016-08-16", "likes": "142", "dislikes": "1", "comment": ["Don’t ya love Root! A touch of crazy enough to spice up your life"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Episode summary:\nRoot and Reese travel to the remote (and fictional) upstate town of Maple in search of Shaw, with Finch theorizing that she may be in a truck he traced earlier. The two find a truck with a stretcher and medical equipment inside, leading them to a doctor. The doctor says that he was anonymously consulted for the job, but did not call the police since Maple has a history of job losses for those who ask too many questions. He himself was fired from his former workplace, which is run by Maple's mayor Leslie Thompson. Root and Reese realize that Samaritan is experimenting with Maple as an \"ant farm\" used to study human nature, and is manipulating events by giving people false identities. After kidnapping and interrogating Thompson, they learn that she too is one of these people. Thompson leads them to the factory where Shaw was last seen, but Reese and Root instead find a secretary from the stock exchange—she is one of many innocent people who Samaritan operatives are experimenting on with neural implants. Fusco and Dani Silva (from \"Point of Origin\") investigate The Machine's next number, one Arthur Weiss, a seemingly unsuspecting citizen revealed as a freelance assassin. They lure him into Silva's home and engage in a fight, with Silva shooting him to save Fusco, thus making her first kill. Meanwhile, Root and Reese return to New York and The Machine sends them a coded message telling them to stop looking for Shaw. Elsewhere, Shaw is revealed to be alive and in Greer's captivity.\n\nFebruary 3, 2015"}