{"title": "American horror story freakshow - Elsa mars full death (heros)", "url": "https://www.youtube.com/watch?v=vuCXCdZVu7o", "image": "https://i.ytimg.com/vi/vuCXCdZVu7o/hqdefault.jpg", "author": "ONCEUPON a HORRORSTORY", "viewCount": "149684", "datePublished": "2016-09-07", "likes": "1,432", "dislikes": "22", "comment": ["Honestly the fact that this whole thing was a massive suicide by Elsa and the fact that she fully knew she was going to die makes my heart cry like what a woman", "this season was so unbelievably tragic", "—Im the biggest freak of all\n\nLast words of Elsa Mars.", "I love this sequence, this song while we get to see Désirée, Jimmy and the twins being happy", "This ending is beautiful. First when you watch the show, you think \"poor woman, she dreams of being a Hollywood star, but that's not possible. She's too old, and too old fashioned. She's the last thing Hollywood needs. It's never gonna happen for her.\" Then, surprise, it happens! She get's the fame, the Hollywood glory, against all odds... Except it sucks. It's pathetic, she gets exactly what she dreamed of and what we never thought was possible, but it is just shit. Her biggest dream comes true but it just turns to ashes in her mouth. Then, beautiful idea, they have her perform on halloween and we're thinking \"there's no way Edward mordrake is gonna come and take her in thee middle of freaking Hollywood...\" But he does, he just comes, as a completely weird presence in the middle of the streets and the studio of LA, and he's invisible too everybody except her. The line \"no! The fog doesn't come until the goblins\" is classic American horror story humor, hilarious. And he takes her in this beautiful tragic ending. The morality is a mix of \"be careful what you wish for\", \"your sins stain your sowl\" and \"there's no place like home\". Beautiful, original writing, wich knows how to take old ides and mechanism and make them brand new and fresh..."], "authorLink": "https://www.youtube.com/channel/UCGIQHvkZPzrna7UHtmlgoXw", "description": "American horror story freak show - Elsa mars gives her soul to Edward mordake as a suicide act by preforming on Halloween \n4x13 curtain call"}