{"title": "POI S4E05 Prophets, p4 [Root, Root x Shaw, Root, Root, Root]", "url": "https://www.youtube.com/watch?v=vUMyMbg_QlQ", "image": "https://i.ytimg.com/vi/vUMyMbg_QlQ/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "47093", "datePublished": "2016-08-07", "likes": "250", "dislikes": "3", "comment": ["I think when they wrote this scene between Root and Harold they knew exactly how Root's story was going to end. Their conversation is so spot on for how it happened", "Very complex show, I was working night shift when it was on TV, never saw it then. been watching all of these clips now.", "You have to wonder his Heralds computer is so smart why doesn't it realize It needs more people to help defend itself and why can't you just recruit more people?]"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Episode summary:\nThe Machine produces the number of Simon Lee (Jason Ritter), a brilliant political pollster and member of New York Governor James Murray's reelection campaign. Despite Lee's prediction that Murray will be reelected, Murray loses, leaving Lee suspicious of the election result. Lee is proven right as the team discovers that the election upset is the result of vote rigging by Samaritan and that it wants Lee dead to tidy up loose ends. As Finch, Shaw, and Root try to determine Samaritan's endgame, Reese is scheduled to attend therapy sessions with a counselor because of his tendency to shoot people on the job. Initially, he tries to smooth-talk the therapist, who is not fooled. Elsewhere, Root reveals to Finch that since Samaritan's activation, The Machine ceased talking, leaving her without guidance and afraid. Following this revelation, Finch and Root debate the true nature of The Machine. They are interrupted when Samaritan operatives led by Martine find the hotel where Lee is hiding. Root offers to help Finch by protecting Simon as he escapes the hotel. Despite being shot several times by Martine in the process, Root manages to divert Samaritan's focus from the target. The next day, Finch and Shaw produce fake data to convince Lee that his prediction about the election was incorrect, causing Samaritan to disregard him. Reese tells his therapist why he feels compelled to save people, referring to his failure to save Carter. In the end, Greer and Martine discuss Samaritan's plans to gain political control, Samaritan instructs them to \"Find the machine\", and Finch indicates to The Machine his desire to communicate with it. Meanwhile, a series of flashbacks show the process Finch and Ingram went through to create The Machine. As they attempt to give it a moral code, The Machine is repeatedly destroyed and its code rewritten as it begins to preserve itself and aggressively fight back against any attempt to constrain it. When one version attempts to asphyxiate Finch in an attempt to enter the real world, he tries one last time the following day to rework The Machine, ultimately creating the current version of The Machine.\n\nOctober 21, 2014"}