{"title": "THE MANDALORIAN Season 2 Episode 7 Breakdown, Theories, Review, and More!", "url": "https://www.youtube.com/watch?v=VV201_LMsKc", "image": "https://i.ytimg.com/vi/VV201_LMsKc/maxresdefault.jpg", "author": "Think Story", "viewCount": "14159", "datePublished": "2020-12-11", "likes": "953", "dislikes": "7", "comment": ["Sorry again for the lack of Mando vids! But I'm hoping to cover the finale next week!", "Fett looked like a Twilak Pimp in that new matte paint job. And I was thoroughly impressed with Bill Burr’s dramatic acting. The way his facial expressions changed while reliving the events on Burnin Kohn until he finally snapped and killed Hess is a testament to his acting chops. I’ve always loved his viper like in your face style of stand-up, and I hope he parlays this into more dramatic stuff. Also, his line after shooting the refinery “Some of us need to sleep at night!” Was the best line in the episode and spoke so much about his character without not having to actually say much. Damn good storytelling. My only gripe is these episodes are too damn Short! If we can’t binge watch these all at once the day the season starts they need to be longer. Thanks for the video, TS. Looking forward to the next one.", "Given how everything is tying together, I think the Jedi that shows up for Grogu will be Ezra Bridger.", "I'm glad you still taken the time for us ...😄☝🏾☝🏾☝🏾 you still one of the best breaking shit down....", "When did Bill Burr turn into Marlon fkin Brando? Dude's got some serious acting chops. Kudos."], "authorLink": "https://www.youtube.com/channel/UC34Qdd5Z5KN30A8aJ2eIMPA", "description": "THE MANDALORIAN Season 2 Episode 7 Breakdown, Theories, Review, and More! We review the latest episode of The Mandalorian Chapter 15 \"The Believer\" starring Bill Burr as Mayfeld on a quest to uncover Grogu's whereabouts from Moff Gideon.\n\nCheck out my other Mandalorian videos: "}