{"title": "Somebody to Love [Good Omens]", "url": "https://www.youtube.com/watch?v=w9yDm0Xr1Pg", "image": "https://i.ytimg.com/vi/w9yDm0Xr1Pg/maxresdefault.jpg", "author": "shork", "viewCount": "189304", "datePublished": "2020-01-30", "likes": "19,952", "dislikes": "55", "comment": ["Aziraphale: \"You go too fast for me, Crowley.\"\n\n5 minutes later, in Crowley's flat...", "I like to think that if Freddie Mercury were alive to see his music used like this, he’d laugh and click Like", "So, how drunk was Crowley when he went to karaoke and how did the staff feel about the impressive rat choir?", "Is this what crowley did the entire time he got home after he was told he “went too fast” ?", "alternative title: sad gay demon and rat buddies sing queen whilst he pines over his angel crush"], "authorLink": "https://www.youtube.com/channel/UChdZamTLtD6jU0mZPAkcBsQ", "description": "after a grand total of 4 months we finally return with another video. i have scrapped at least 3 videos on the road to making this one and im not too sure if i want to post those... we'll see how i feel about it later. this is a culmination of nearly 18 years of pure yearning yall, pour one out for me once i achieve the romance of my dreams. what do i do when i feel sad i project my feelings onto fictional characters. (raises fist at aziraphale and crowley) i love u both but I NEED SUMMA THAT IN MY LIFE PLEASE? \n\ni got into doctor who! my bestie (and also full time twin, shoutout to my best gal) introduced it to me so there will be a whole barrage of that coming up. this maaaay be the end of the good omens period on this channel, so thank you all SO MUCH for sticking around for it. i dont think that ill stop making videos about these two idiots forever, i have an immense MOUNTAIN of ideas to do. buuuuuuuuuut i do wanna make some of my own stuff from now on like baaaasically everybody else on this platform. may the algorithm forgive me.\n\nart school kicks ass! its fun! i really love it but also im dying hehehe\n\naw well. we'll see how it goes. \n\nlove yall seeya around,\nmiles"}