{"title": "A Person Of Interest Tribute", "url": "https://www.youtube.com/watch?v=w_hOUQk9Gco", "image": "https://i.ytimg.com/vi/w_hOUQk9Gco/maxresdefault.jpg", "author": "Real Scorsese", "viewCount": "42097", "datePublished": "2019-06-21", "likes": "1,077", "dislikes": "13", "comment": ["Wow! This is the best tribute for this an amazing show! You've done such a beautiful work here. Thank you so much for this masterpiece!", "I always knew that John was not going to have a happily ever after. The very thing that made him a primary asset was the same thing that disqualified him from a normal life. He went into the forge and came out a weapon. A weapon's only purpose is to fight, or break under use not rust away somewhere. To have lived at all is the miracle. To have helped others is a gift to the future. To be remembered at all is the highest praise. To have a meaningful, useful death is the greatest reward. That is the way of things when one is a weapon.", "Currently rewatching the entirety of POI for the first time since Season 5 ended, currently on episode 1 of Season 3. \n\n7 years since it started and I still believe POI is one of, if not the greatest show ever made. Amazing storylines, acting and characters (who were superbly cast) this show had it all, even a great ending which I think is rare for most shows. ", "It s been 3 years... \n3 years After the final...\nCan't believe it \nRoot 😭❤️", "In my opinion this was  and still is one of the finest  television series ever made . I thank its creators for all the gut wrenching moments , the highs and the lows , I am just sad it had to end...Good Bye"], "authorLink": "https://www.youtube.com/channel/UCi8K1-uC3NazkioWBnDk_5w", "description": "Thanks to the regulars, thank you to you!\n\nThis is my last video of the series. I worked very long on it, but i was worth it.\n\nI will never forget your messages of love for my work, and your shares. Take your time to view it ! Thank you so much to all!\n\n3 years of videos for this series, there is an end to everything. Thanks to all who watched the videos, appreciated and shared. Especially the actors from the series who watched and took their time. It has been a magical moment for me, as for you\n\nSee you soon for new adventures with new projects!"}