{"title": "POI S4E09 The Devil You Know, p1 [Root x Shaw]", "url": "https://www.youtube.com/watch?v=wD5vR7Wh3Zg", "image": "https://i.ytimg.com/vi/wD5vR7Wh3Zg/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "48353", "datePublished": "2016-08-15", "likes": "290", "dislikes": "5", "comment": ["I love it how Root enjoys to be near Shaw 🤣", "4:11 fusco helping his cocoapuffs 😊", "I wish I was a girl to a romance like that 😅😅", "Wow, I want to be Shaw O_o", "Martine was my favorite"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Episode summary:\nFollowing the cliffhanger ending of the previous episode, Martine engages in a gunfight with Shaw, who ultimately escapes. Root immediately picks her up on a motorcycle and they race away from the scene. Taking temporary refuge in a moving van, Shaw resists the fact she will have to go into hiding now that her cover is blown—eventually, Root injects her with a sedative and takes her to the team's hideout. Martine, attempting to trace Root and Shaw, learns that Fusco had stopped the truck, officially on suspicion of narcotics possession. Pretending to be a DEA agent, Martine goes to the precinct station to question Fusco about it. Fusco sees through the ruse and gives her a false lead. Reese and Finch deal with their latest number alone—Elias. Elias and Dominic are playing a dangerous and deadly cat-and-mouse game for gang territory control. Elias, his right-hand man Anthony, and his accountant Bruce, turn out to have been devoted friends since their youth in an orphanage. Dominic gets many of Elias's people to turn on him in exchange for promises of expanded territory and power under The Brotherhood. Reese steps in to defend Elias and, during the process of evading Dominic, Anthony is captured and later killed in a suicide bombing, but not before putting some thoughts into the head of Link, Dominic's own right-hand man, about loyalty versus expendability. Before Anthony dies he says morior invictus (\"I die undefeated\"). Greer and Martine deduce that The Machine's team is still alive and that Samaritan has a \"blind spot\" somehow caused by The Machine. He reiterates that it is time for \"human intelligence\" to fill that blind spot—Martine is given command of a group of Decima agents to hunt down Shaw. Meanwhile, Dominic has deduced that there is an extra-legal team helping Elias—he has two of the players figured out (Shaw and Reese), with the bankroller's place (Harold) still a large question mark. Elias vows revenge for the death of Anthony, and warns Reese to stay out of the way once that day comes. Elias declares Invictus maneo (\"I remain undefeated\").\n\nNovember 25, 2014"}