{"title": "Why Jesus Matters Today More Than Ever: A Conversation with Detective J. Warner Wallace", "url": "https://www.youtube.com/watch?v=WgnvrENuDWQ", "image": "https://i.ytimg.com/vi/WgnvrENuDWQ/maxresdefault.jpg", "author": "Dr. Sean McDowell", "viewCount": "12135", "datePublished": "2021-09-01", "likes": "576", "dislikes": "22", "comment": ["I'm a full-on atheist who's got a solid 0.00001% chance of being converted, but I just wanna say I'm happy that YOU'RE one of the big Christian apologists. You have a very kind/approachable demeanor and although I think it's safe to call you a gnostic Christian (forgive me if I'm wrong), you're respectable about it, which is rare for any gnostic person of any belief system. I always find it weird when I give out advice on how to convert atheists, but if I had to give advice, I'd tell someone to model after you. Despite what your live chat looks like, I feel sorta welcomed by you and I get to hear your POVs, which is interesting to me.", "People who manifest the Grace of Christ, like I see here, are what have given me the opening to consider— and accept!! Jesus as my Savior. There are very serious, considerate, and integrity driven believers in Christ, and I feel so blessed to find y’all!!!!", "Wow!!! I love hearing new and fresh apologetics. The kingdom of God is amazing", "Jim is such a GOAT what a unique and inspiring approach, thank you gentlemen.\nPreordered my copy already! 👍<><", "I love listening this interview and the approach that J. Warner Wallace takes...hope to hear him more and have his book \" Person of interest\""], "authorLink": "https://www.youtube.com/channel/UCC321oNTD2yrszfYoz3-X1w", "description": "What does the historical record show about the significance of Jesus without relying on the New Testament? We discuss the latest book, PERSON OF INTEREST, in which Detective J. Warner Wallace reveals how Jesus has transformed art, music, history, science, and other disciplines. And we consider the biggest objections to the historical Jesus.\n\nREAD: Person of Interest, by J. Warner Wallace: "}