{"title": "POI S2E02 Bad Code, p5 [Root]", "url": "https://www.youtube.com/watch?v=WkODfFVR_PU", "image": "https://i.ytimg.com/vi/WkODfFVR_PU/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "15024", "datePublished": "2016-06-21", "likes": "96", "dislikes": "0", "comment": ["The only problem to me is that the two girls should have been the opposite, the tall brunette should've been Samantha Groves, after all, Root is pretty tall and a brunette, while the blonde girl should've been Hanna Frey.", "There's nothing a loopy as a loopy female."], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Carter and Reese discover Root's identity.\nRoot prepares Harold for a journey to find The Machine.\n\nEpisode summary: \nRoot brutally interrogates Denton Weeks over the location of the Machine, accusing him of having what she calls \"bad code\". To prove that Denton is \"bad code\", she allows Finch to help Denton temporarily escape and pretends to be subdued. Once Denton realizes that Finch was involved with the creation of the Machine, he tries to kill Finch, but Root kills Denton instead after he reveals the Machine's location to be somewhere in Salt Lake City. Meanwhile, Reese continues to follow the trail of the missing girl supplied by the Machine in \"The Contingency\". Her name was Hanna Frey, a girl abducted outside a library. The one witness to the crime was Hanna's friend Samantha Groves, who informed the librarian (Margo Martindale) what she saw, only for the librarian to accuse Sam of lying, because she was in love with the man that Sam had accused. The experience started Sam down a path that would ultimately lead to her becoming Root. Now knowing Root's real name, Reese is able to track her movements through bank accounts, to triangulate Weeks' location. He arrives in time to find Weeks dead and Root gone, having taken Finch with her to Union Station. Finch leaves a clue to where he is being taken by using a tap code on a telephone handset. Reese decodes the clue in order to follow and save Finch, but Root is able to escape before Reese can apprehend her.\n\nOctober 4, 2012\n\n+235"}