{"title": "Good Omens [Ineffable Husbands] CMV | Wait For Me", "url": "https://www.youtube.com/watch?v=wmS07YqK--Y", "image": "https://i.ytimg.com/vi/wmS07YqK--Y/hqdefault.jpg", "author": "HedleyKow Cosplay", "viewCount": "10031", "datePublished": "2019-08-16", "likes": "819", "dislikes": "5", "comment": ["things i love about your cosplays in particular: when the show came out your crowley adapted their cosplay a bit to match up with the show's design, while your aziraphale, in true aziraphale fashion, said \"actually i'm good\" and just kept it the same. i'm VERY into that.", "I should have seen it coming, but man the ending got me. Please, consider doing another part.\nYou all have done an absolutely amazing job. ❤️", "All of your acting is bloody phenomenal (I never use that word I don’t know why I don’t because it sounds cool) I need a part two!", "sees the rescue YES. \nsees the ending wait nO-\nangrily screeches", "Ahhh two of my favorite things!!! I love seeing GO/Hadestown crossovers!!! :)"], "authorLink": "https://www.youtube.com/channel/UCTjQjIlz0Y4iqrYIgTVtnxQ", "description": "Crowley and Aziraphale just want to forget about this whole Armageddon nonsense and live out the rest of their existence in peace and quiet in a cottage in the South Downs.\nUnfortunately, the forces of heaven and hell are determined to break them apart for good (or bad, as it were), and have captured Crowley! They think they've taken him somewhere Aziraphale couldn't possibly find him.... could he?\nLuckily for both of them, Crowley had already let slip where to find the back route to hell...\n\nAziraphale: PeggyCosplays\nAnthony J Crowley: Halusional\nMichael: Billiegoatscosplay\nBeelzebub: Billiegoatscosplay\n\nMusic is 'Wait For Me' from the musical Hades Town.\n\nGood Omens is written by Sir Terry Pratchett and Neil Gaiman, and this is our adaption of their spectacular creations.\n\nFind our group, HedleyKowCosplay, and our individual profiles on Instagram, Twitter, Facebook and Tumblr for more content like this as well as behind the scenes pictures and footage!"}