{"title": "POI S3E23 Deus Ex Machina, p2 [Root x Shaw]", "url": "https://www.youtube.com/watch?v=WPnkpaFABrQ", "image": "https://i.ytimg.com/vi/WPnkpaFABrQ/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "56362", "datePublished": "2016-07-15", "likes": "237", "dislikes": "8", "comment": ["I love your descriptions haha"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root and Shaw break in to the Samaritan facility. Are adorable while doing so.\n\nEpisode summary:\nCollier continues the trial. Flashbacks show he was recruited by Vigilance. Reese and Hersh search for the trial venue. Root and Shaw smuggle servers into the Samaritan array. Fusco deals with a diversion. The presidential assistant is put on the stand and becomes defiant; Collier kills him. The Senator refuses to name his superior, but inadvertently reveals that he reports to Control; he is spared. Control refuses to confirm or deny anything. Collier is about to kill her when Finch confesses he is the author of The Machine. With a Vigilance command post now compromised, Collier takes Finch, Greer, Control and the senator to a nearby rooftop. Collier is wounded in a gunfight. Greer tells Collier that he and his Decima team created Vigilance as a \"devil\" for Samaritan to justify itself, and that he himself recruited Collier. Meanwhile, Hersh has been wounded in a gunfight in the trial building. He finds a booby-trapped bomb but cannot disengage it before it explodes, killing him, several police officers and anyone left inside the building. Greer's lieutenant kills Collier, and is about to kill Finch when Reese arrives and wounds the gunman. In this gunfight, Harold gets a shoulder wound but takes cover. Greer and his gunman flee. Finch and Reese leave once the carnage is over. The principals regroup, but Samaritan is being brought online. Root advises the team to abandon their library home and assume new identities. The code in the servers she and Shaw installed will report the team dead and hide information about their new identities. As Shaw, Root, Reese and Finch head off in different directions and the remaining Vigilance team members are killed on the streets, the now fully operational Samaritan asks Greer for commands. Greer instead asks Samaritan what commands it has for his team. The episode ends with the Samaritan screen displaying, \"Calculating response.\"\n\nMay 13, 2014"}