{"title": "JU-ON: ORIGINS - Netflix's INSANE TV Show Based Off THE GRUDGE Is Worse Than We Imagined!", "url": "https://www.youtube.com/watch?v=WRYQSc9W4ws", "image": "https://i.ytimg.com/vi/WRYQSc9W4ws/maxresdefault.jpg", "author": "Think Story", "viewCount": "58451", "datePublished": "2020-07-06", "likes": "2,225", "dislikes": "540", "comment": ["10 minutes of someone who does not know what they're talking about. \nit was pretty good.", "I think you really under-analyzed a lot of points here. Kiyomi doesn’t just come out and make out with the guy that just raped her, but rather comes out with a new sense of vengeance, holding that boy accountable for his actions. \nThe part involving the first couple with a pregnant woman, the husband didn’t just chug the wine and say ‘it’s okay, we’ll all die together’, he chugged the wine of shame and insisted that his pregnant wife also take part in it because they were all about to die anyway and then he attempts to murder her but once he slips up and starts puking up the wine (which shows that it was poisoned), the pregnant wife gets up, emotionlessly, with a knife, revealing her own hidden murderous intent and making her attempt on the husband’s wife. And the other couple doesn’t just up and murder-then-suicide each other it was the house’s negative energy behind the husband’s affair, thus causing the murders at the height of his affair and his own suicide as well. ", "I am a big Grudge fan, it is one of my favorite horror movies. I saw the show. I liked it. Its old school J horror, just like Ju On(2000). It is not like these horror movies that you see these days. It is an old-school Japanese horror movie. It's subtly smart because the show is set in the 80's and 90's Japan when there was a wave of abuse against women and children in Japan. This show was showing the cycle of oppression that takes place, once a person is abused ( got its history from Japanese Chatrooms). I hope they come out with the second season. I don't know about the hate. I had no idea about the show.  I was going to watch 1 episode, I ended up watching all of them in one sitting.", "I loved it, it wasn't that scary, but it was disturbing as hell, I cared for the characters, and I loved every bit of it.", "One thing I like about this series is that it shows real-life tragic news in the background on almost every episode (no on #5.) so it makes an audience relate to the real-world timeline and also because of these news, the news about the house were never got much attention. \nAbout the news."], "authorLink": "https://www.youtube.com/channel/UC34Qdd5Z5KN30A8aJ2eIMPA", "description": "In this video we take a look at Netflix Japan's newest horror original JU-ON: ORIGINS, a terrible tv show that does not live up to the original Grudge or the the hype.\n\nFollow me on twitter: "}