{"title": "Storytime: I was POISONED!", "url": "https://www.youtube.com/watch?v=wSdXjiEmVpc", "image": "https://i.ytimg.com/vi/wSdXjiEmVpc/hqdefault.jpg", "author": "MaryGirl Moody", "viewCount": "1173", "datePublished": "2019-08-03", "likes": "116", "dislikes": "6", "comment": ["i remember you being super sick during the AHS season. i am in shock. i am so glad you are okay now! so glad you are okay. holy shit.", "omg mother supreme this explains so much about what was going on last year, I’m so glad you’re feeling better and are getting the help you need. I don’t know what we would do without you, you are the best I’ve been watching you since 2016 !! We love you mother supreme and hope you make a full recovery ❤️❤️❤️❤️❤️", "Holy shitskies! I remember how awful you felt. I hope you locate the source. So happy you’re feeling better & recovering!! (As best u can) \nStay strong sister & much 💜💜💜", "That's very AHS SEASON X-written by the one and only best writer for AHS-MaryGirlMoody😂👑", "The Doctors are the crazy ones they told me I had the flu and I had Leukemia half of doctors don't know up from down they just happen to pass their classes and get their license to practice actually come to find out to become a pcp is not as hard as you may think plus alot of them think they know everything but don't know up from down and we all know a person that thinks they know everything and isn't willing to     continue to learn and grow is pretty much useless and I have found a lot of doctors to be like that I'm so glad you're doing better  and that you have determination and didn't give up your in my prayers lot's of love to you and your family"], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "Many of my viewers have been concerned about my lack of videos and asked where I've been. Sadly, this video is the answer. It's tremendously difficult for me to put such a personal video on the internet, but I'm a jump in the water type of gal.\n\nMusic from Purple Planet."}