{"title": "POI S4E04 Brotherhood, p1 [Shaw]", "url": "https://www.youtube.com/watch?v=x5tOkk1Zru8", "image": "https://i.ytimg.com/vi/x5tOkk1Zru8/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "216821", "datePublished": "2016-08-04", "likes": "810", "dislikes": "46", "comment": ["at 3:13 where Shaw perfectly parallel parked that car, which looks like it would be difficult to do considering limited visibility, that's the moment i fell in love with her", "I love how Shaw looks completely uncomfortable walking down the street in that little black dress. \nEspecially considering Sarah Shahi is a former cheerleader, which requires a lot of physical grace.", "It never ceases to amaze me how those airbags never deploy in any of these shows", "Okay okay... there’s no way anyone could parallel park in that space...", "3:17 How'd she get into that space?"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Episode summary:\nReese is assigned to the case of a drug deal gone bad between a gang of Armenians and \"The Brotherhood\", who were introduced in \"Panopticon\". The team's latest numbers belong to siblings Malcolm and Tracie Booker, who stole the drug money from the scene to bail their imprisoned mother out of jail. While Reese works with a DEA agent to protect the kids, Finch consults Elias about the Brotherhood's elusive leader Dominic; Shaw abducts an injured Brotherhood soldier, nicknamed \"Mini\" (Winston Duke), from the scene of the drug deal. The DEA agent is later revealed to be a mole working for Dominic within law enforcement and leaves Reese and the kids to face a Brotherhood assault, and while Fusco is able to save Reese, Malcolm tries making a deal with Dominic's right-hand man, Link (Jamie Hector), to protect his sister. Reese is able to save Malcolm, while Shaw forces Link to free Reese under the threat of burning the gang's heroin stash that Mini led her to. Shaw agrees to let Mini go, and he is picked up by Link the following day, who has also located the DEA agent (who was attempting to steal the drug money for herself). Mini reveals himself to in fact be Dominic and kills the agent, ordering The Brotherhood to release the kids' mother as part of a campaign to induce gratitude.\n\nOctober 14, 2014"}