{"title": "AHS Weekly Wednesday Live Stream", "url": "https://www.youtube.com/watch?v=xE6QSKKTmmQ", "image": "https://i.ytimg.com/vi/xE6QSKKTmmQ/maxresdefault.jpg", "author": "MaryGirl Moody", "viewCount": "437", "datePublished": "2021-01-27", "likes": "38", "dislikes": "1", "comment": ["You have such a lovely voice that you need to go into radio", "omg haven’t visited this channel in a while 😭. Glad to be back!", "Mary!!! Guess what? So I live two hours away from Provincetown and this weekend we went down to spy on the production. Finn was there filming and taking pictures with people. Lily Rabe, Adina Porter, and Frances! We went to eat at the restaurant across the street from The Mews \"The Muse\" when Frances was filming but I didn't get to see her. We had no clue we were that close! The next day they actually filmed at the hotel we stayed at The Lands End Inn. I believe they were only filming the location and then they filmed Matt Bomer walking down the stairs. We had an outdoor patio/terrace in front of our room and The directors were standing right in front of it the entire time. I think it was to make sure we didn't run out n scream lol. Later that night we drove by a huge parking lot with all the production trucks and trailers. There was an ambulance and someone wheeling a gurney with a body bag! Then a guy was walking up towards the area with what looked to be a hospital gown costume with some latex skin peeling off his face! We saw the huge stage lighting so we went to our room, changed and then walked down to take a look. There was a small crowd. I didn't see anyone with cameras so I wasn't sure if I could take any pics but I did lol. At this point all I saw was a white car pretty high up on some sort of crane or something that was holding it up high and it was tilted. Sort of like they were filming a crash of some sort. Then the lights went out n one of the team members said they were wrapping for the night so we left. All in all very exciting but we never actually saw any actors. I know they were there cuz people are posting photos of them on commercial street. Like Adina Porter who is playing a cop. Lily Rabe was pregnant and walking in a house with Finn. Frances was at the restaurant but that's all I know about her. Noone had any pics of her walking around just mostly Finn. Word is they rented a private home and they were all staying there. I have a few pics of like the directors and the car on the lift but that's all. Oh and a few quick videos of the black vans that were driving the cast around. If u have an email u want me to send them to I will. Nothing too juicy but I figured I would let you know the 411. Hope you're doing well!", "I hope everything is going ok with all the trouble happening, I'm chomping at the BIT to hear from you ! LOVE YOU GURL !!!!!!!!!!!!!", "Hey MaryGirl !. I’m sorry i was a bit late for The party yesterday 😒. Keep up The Great work. You’re doing a Great job. And if you ever need an extra guest for future AHS discussions i Will gladly volunteer 😉 !"], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "► ► SUBSCRIBE https://www.youtube.com/channel/UCc5r...\n\nFacebook: https://www.facebook.com/groups/TheFr..."}