{"title": "Person of Interest Season 5 - What To Expect", "url": "https://www.youtube.com/watch?v=xfYD2dW2L_s", "image": "https://i.ytimg.com/vi/xfYD2dW2L_s/hqdefault.jpg", "author": "TV Equals", "viewCount": "22042", "datePublished": "2015-07-20", "likes": "68", "dislikes": "0", "comment": ["Dear \"Harold,\" Please program the Machine so that there will be five times infinity seasons of POI. We love it and want it to continue.....", "Elias and Dominic were great villians. They'd be hard to replace.", "Have the Machine take over Samaritan without Greer knowing!! #RootandShaw #TeamMachine", "I love this show, too bad it  will be the last and 13 is not enough", "Bring back \nPerson of Interest\n           [🔺️]"], "authorLink": "https://www.youtube.com/channel/UCSRmKnnQuwOFAS09qDAeUsQ", "description": "Person of Interest season 5 spoilers and news straight from executive producer Greg Plageman &  Kevin Chapman     (Detective Lionel Fusco).\n\nPERSON OF INTEREST is a crime thriller about an ex-CIA agent and a mysterious billionaire who prevent violent crimes by utilizing an all-seeing machine that can predict the events before they happen. Although John Reese and Harold Finch have successfully prevented numerous crimes thanks to The Machine’s omniscience, the team was unable to stop the malevolent artificial intelligence known as Samaritan from coming online. Brought to life by Greer, head of the private technology corporation Decima, Samaritan has the full power of the U.S. government behind it and is using those resources to hunt Finch, Reese and the hacker, known as Root. The trio, along with Det. Lionel Fusco, suffered a major loss when Samaritan’s operatives wounded and captured Sameen Shaw, their comrade-in-arms.  Upon gaining full autonomy, Samaritan set its sights on destroying The Machine, which now exists only as a few lines of source code in a briefcase held by the team.  On the run and without access to The Machine’s intel, the team must find a way to continue saving lives as they attempt to reboot The Machine and fight back against impossible odds.       \n\nIf you like this video, please make sure to click the like button and share this with all your friends.\n\nSubscribe Here (it's free!) - "}