{"title": "POI S5E04 6,741, p11 [Shaw, Root x Shaw, S!Root]", "url": "https://www.youtube.com/watch?v=xGrU5to9Gbg", "image": "https://i.ytimg.com/vi/xGrU5to9Gbg/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "61977", "datePublished": "2016-06-21", "likes": "407", "dislikes": "1", "comment": ["INCREDIBLE EPISODE!! EMMY AWARD WINNING PERFORMANCE BY SARAH  AS SHAW!!!!", "Saddest thing I never seen. A torture that breaks a persons reality.", "This is the type of episode that leaves u staring at the screen for long minutes after the credits roll. She shot herself 6741 times.", "I wish there was a happy ending for them.... not like this😥", "What a psychopath writer we waited all this long for Shaw to get out then it turned that it was just a simulation"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "But Shaw won't kill Root. \n:(\n\nEpisode summary:\nShaw is seen undergoing surgery by Samaritan operatives, to have an electronic microchip implanted between her ear and her brain stem. After enduring a mind-bending reeducation sequence and being taunted by Jeremy Lambert, she is able to turn the tables on him; she takes the opportunity to break out of confinement, and finds the team. Together they trick Samaritan's operatives and capture Greer. With Greer in captivity, Shaw removes a USB drive embedded inside his arm, which Finch is able to analyze, discovering it to be a kill-switch for Samaritan. Shaw had revealed to Root that she was subjected to extreme psychological torture while captive; once Greer starts to taunt her about the kill-switch and her mental state, she hallucinates heavily, loses control of reality and kills him. Shaw continues into a neurological downward spiral, causing her to kill Reese. She is about to kill Root when she confesses that Root was her only mental safe-place, and turns the gun on herself. The narrative returns to the operating room, and it's revealed that these events happened only in Shaw's mind. She has been subjected to thousands of electrochemical mind-control simulations by Samaritan, so its operatives can see if she would lead them to the Machine and its assets. This particular simulation was number 6,741.\n\nMay 16, 2016"}