{"title": "SAW (Spiral) News: TV Show In Discussion and Sequel in Development!", "url": "https://www.youtube.com/watch?v=xK8zXQWEhvk", "image": "https://i.ytimg.com/vi/xK8zXQWEhvk/maxresdefault.jpg", "author": "Reel Talk", "viewCount": "1233", "datePublished": "2021-04-24", "likes": "83", "dislikes": "1", "comment": ["I've been the biggest opponent of this and I'm sorry but I won't support it. I'll rephrase my point when I say I won't support it.... Yes I'd watch it... But I wouldn't be excited about it because of the route they'd be taking. I'd rather watch it in the movie theater than see something on the TV. And when I say watered down, I mean the story, they can do whatever they want with the story, but it in my opinion would just be a mistake.... I want a continuation... I don't want a prequel or a flashback story, we've already gotten that. I get there'd be a continuation as well for the TV show, but all it's going to do is go in many different directions and it would simply become a mess. My hope for when Spiral comes out is that it's a continuation (which it is) that it references certain aspects as whole (which it will) and that it can build off of that going forward rather than having to go backwards. It's John Kramer said in Jigsaw... You have to understand that you're doing it backwards.... And I don't want to go backwards, I want to go forward with Spiral and see what it can accomplish... I'm more excited than ever for this to come out in a few weeks, and I'm hoping for a tenth movie going forward.", "For me, I do feel that a show would be great for the series. Sometimes, the films seem rushed which offer many plot holes. A show would give the chance to let the film’s main ideas be fleshed out so much more... maybe not in a such violent manner, but good for the entire storyline.", "I'll say this, I'd rather have another trilogy then have a TV series", "I really hope spiral does well in the box office!!", "Thanks for the upload I have been needing some SAW related content after rewatching all the spiral trailers 5 times"], "authorLink": "https://www.youtube.com/channel/UC4GPRqEoZ4zpnTHIxcG5JyQ", "description": "SAW (Spiral) News: TV Show In Discussion and Sequel in Development! Okay, what do we think of this news? I'm a little late to the sequel talk, but I'm not really buying that they are fast tracking a sequel. I think the TV show discussions are a bit more real. Why? Let's discuss!\n\nTwitter: "}