{"title": "POI S4E22 YHWH, p5 [Root]", "url": "https://www.youtube.com/watch?v=Xmke5Wh2RIw", "image": "https://i.ytimg.com/vi/Xmke5Wh2RIw/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "11084", "datePublished": "2016-08-18", "likes": "64", "dislikes": "0", "comment": ["Troppo belloooo", "After watching POI 5 times I came to a couple of conclusions: 1- Finch wanted his AI to fail. 2 - He did not care is his Agents were killed as long as he could feel real good about it."], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Success! The Machine is on the move!\nRoot and Reese shoot stuff.\n\nEpisode summary:\nSamaritan, having received the location of The Machine, begins a series of power outages throughout the United States, beginning in the West Coast and moving eastward toward New York. Dominic tries forcing Reese and Finch to help him in the same way as they helped Elias. Harper releases Fusco, but is caught by Dominic. The Machine, now in distress because of Samaritan's actions, allows Root and Reese access to its God Mode (from \"Zero Day\" and \"God Mode\"), and assists Reese to escape Dominic. Dominic flees, but Fusco, along with the NYPD, arrests him and Elias. Control, along with Agent Grice, tries to find out what exactly \"the Correction\" is. Control is duped into believing that Greer is attempting a power-play through a terrorist attack on the Supreme Court, but Greer reveals that \"the Correction\" is actually a list of people created by Samaritan who need to be eliminated for the betterment of society, who will be killed quietly. During this confrontation, Dominic, Elias and Agent Grice are killed by Samaritan snipers, but Fusco is allowed to live because Samaritan does not know about his involvement with The Machine. Control's actions prove she is not loyal to Samaritan, and she is captured and sent to be killed. Root, in God Mode, with Finch, starts collecting things at the request of The Machine. In the process, they infiltrate Caleb Phipps' (from \"2πR\" and \"Blunt\") company to steal his compression algorithm and some high capacity RAM chips, but Caleb willingly gives them to Finch because Finch had previously saved his life. Reese regroups with Finch and Root at an electrical substation hidden in residential Brooklyn. There they discover that the machine spread itself over the power grid in boxes attached to electrical poles after the events of two years prior, and that Samaritan has been causing the power surges to destroy the boxes. Finch and Root handle the downloading of The Machine's core code to a briefcase contained with the compression algorithm and RAM chips while Reese, assisted by The Machine, takes out all of the Samaritan operatives who have reached the substation. The Machine, now severely weakened by the power surge and near death, talks to Finch: \"Father, I am sorry. I failed you. I didn't know how to win. I had to invent new rules. I thought you would want me to stay alive. Now, you are not sure. If you think I have lost my way, then maybe I should die.\" Finch replies \"You are my creation; I can't let you die.\" The Machine thanks Finch for creating it before the final power surge enters the substation. Finch manages to save the briefcase, and the team walk out to face more Samaritan operatives.\n\nMay 5, 2015"}