{"title": "POI S3E09 The Crossing, p3 [Root, Shaw]", "url": "https://www.youtube.com/watch?v=XN8GKkotiUQ", "image": "https://i.ytimg.com/vi/XN8GKkotiUQ/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "24613", "datePublished": "2016-07-04", "likes": "124", "dislikes": "6", "comment": ["what a beatiful scene..", "Rosineide  dos   Santos Souza 100💘💘💘💘💘🌹😍😘👄👌🔥"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root and Finch continue their chat and Root again offers to help.\nShaw saves Fusco's son.\n\nEpisode summary:\nAfter capturing HR head leader Alonzo Quinn, Reese and Carter are trekking across town to deliver him to the FBI. Officer Simmons alerts both HR and several criminal groups of Reese's identity, so his means of moving across the city become limited. After fighting several thugs and corrupt cops working for HR, the trio breaks into the city morgue. Meanwhile, Fusco is captured by HR while relaying information to Carter; he is subsequently tortured by Simmons and an accomplice, Detective William Petersen (Lee Tergesen), who now have the key to Carter's safe deposit box, but do not know the location. After refusing to give the location of the safe deposit box containing damning evidence against HR, Simmons sends one of his men Lin (Khalil Kain) to kill Fusco's son Lee (Sean McCarthy). Shaw, anticipating that move, breaks into Fusco's house and kills Lin, saving Lee. Eventually, Fusco frees himself by breaking his own thumb to get free of the handcuffs and kills Petersen. Holed up in the morgue, Reese and Carter bond and he surprisingly shows his true feelings for her by kissing her. Suddenly, a group of HR cops infiltrates the morgue and shut off the power. Reese tries to distract HR while Carter flees to the FBI with Quinn. Reese manages to kill or disable all but one of the HR cops, and leads the final one out onto the street. Finch organizes for two honest policemen to arrest Reese as a means of escape from HR. During this time, Carter manages to bring Quinn to FBI Headquarters in Lower Manhattan. The episode skips forward to a news report revealing that Quinn was charged with multiple offenses and HR was disbanded with the exception of a few rogue officers, one of those being the now-fugitive Simmons. Carter is promoted back to being a detective, who goes to release Reese from police custody. Finch is parked down the street and is waiting for Reese. Suddenly, Simmons appears from down the street and opens fire on Reese and Carter. Reese is injured while Carter is killed. Simmons is shot by Carter but he is merely wounded and escapes. Both severely injured from the attack, Reese holds Carter in his arms as she begins to lose consciousness.\n\nNovember 19, 2013"}