{"title": "Person of Interest Guide - S1E2 - Ghosts", "url": "https://www.youtube.com/watch?v=xPO2NbbGteo", "image": "https://i.ytimg.com/vi/xPO2NbbGteo/maxresdefault.jpg", "author": "Five by Five Takes", "viewCount": "1646", "datePublished": "2021-04-05", "likes": "176", "dislikes": "0", "comment": ["I feel like \"Ghosts\" is mostly notable for the flashback bits, yes, but also for establishing the cornerstone of John and Harold's relationship for the upcoming mumble-mumble episodes: Continual boundary-pushing, mostly on John's part. Now that he has purpose again, he has energy, and thus enough give-a-damn to start wanting to do his job properly... and that spills over into wanting to know more about the guy behind the curtain.", "The perception many people have of the first season is that it’s meh, but it’s far from average. It’s problem, as the series progresses, the show gets better, making the first season seem inconsequential. But the first season does a great job of building the foundations that makes the later seasons soar. It’s worth watching, and I enjoyed it more during my second watch of the series. One of the treats of the first season is seeing, John, Finch, Carter, and Lionel’s relationships grow.", "Yeah, the perp's plot is pretty meh, although Evil Bank shenanigans is certainly on par with POI's calling out of institutions of power. Also, Ghosts sets the tone for what to actually expect from each episode, with the world-building flashbacks and John's cat-&-mouse games with Harold and Fusco. The pilot does a great job selling the premise, but somethings (Harold's bodyguards, the pin board) are never seen again and would be wildly out of character with the rest of the season.", "I am not even kidding, I've watched this series 10+ times all the way through, and I have NEVER noticed the memorial for Nathan. Wow.", "I'm soo glad that you continue this guide series. \nGreat job!!!"], "authorLink": "https://www.youtube.com/channel/UCC2Bw649-AJJWJDX74f85qg", "description": "ain't no hollaback giiiiiiirl\n\nintro by altjessie on twitter\nall music by david wohl\n\nchannel twitter: twitter.com/5x5takes"}