{"title": "Top 9 Best SAW Characters #3 | SAW-Tober 2020", "url": "https://www.youtube.com/watch?v=XPPOXgf0kRI", "image": "https://i.ytimg.com/vi/XPPOXgf0kRI/maxresdefault.jpg", "author": "Reel Talk", "viewCount": "749", "datePublished": "2020-10-29", "likes": "55", "dislikes": "4", "comment": ["Detective Mark Hoffman was one of the most important characters in the whole series, his character is for the most part. It is a pity that his fate has not been definitively explained so far I have a lot of insufficiency about this character so important and we do not know what happened to her. the newest part was a flashback that Hoffamn had a key to the chain hidden in that bathroom or he got free in some surprising way I'd love to know", "Awesome video! Hoffman is actually my number one favorite character. While Jigsaw is self-righteous and not a true villain, Hoffman knows who he is and uses his position to do evil things. \n\nHe frames Jigsaw and kills his sister’s killer, he beats Straum in 5, he convinces Amanda to kill Lyn knowing that would result in everyone’s deaths and he would be free of her and John, he escapes a supposedly unwinnable bear trap in 6. ", "My favorite character in Saw Franchise was Mark Hoffman, his character need to be back in Spiral.\nHe continues John's legacy he built new traps that John never use.", "Hoffman would be my number 1. He's arguably the main character in Saw considering he was the most present character in the Saw time line (pre Saw - Saw VII). I think his character development over the series is fantastic. From hardworking cop, to depressed lonely cop, to reluctant apprentice, to loyal apprentice, then he lost his ability to empathise before becoming the primary Jigsaw killer. Without John's guidance, his mind started to become demented before his identity being exposed and face becoming mutilated sent him off the deep end and he became a straight up lunatic. He's unpredictable and we never know what's truly going on in his mind. His actor, Costas Mandylor summed him up well. He said 'Hoffman is torn between becoming a guy that's more composed, from a pure place like Jigsaw, or becoming a madman. That's my characters dilemma. Will he go fucking crazy? Or follow the rules of the boss'.", "He's my #1 and it makes me so happy that Costas is so passionate about the movies and his character :)"], "authorLink": "https://www.youtube.com/channel/UC4GPRqEoZ4zpnTHIxcG5JyQ", "description": "Top 9 Best SAW Characters #3 | SAW-Tober 2020\n\nJigsawRules:"}