{"title": "American Horror Story Brasil Vlog 18 // Hotel: \"Flicker\" (Ep. 7) e Lady Gaga Atua Bem?", "url": "https://www.youtube.com/watch?v=XTzW9qhBChQ", "image": "https://i.ytimg.com/vi/XTzW9qhBChQ/maxresdefault.jpg", "author": "American Horror Story Brasil", "viewCount": "7508", "datePublished": "2015-11-21", "likes": "651", "dislikes": "3", "comment": ["Até o final da temporada a Condessa vai dar pra todo mundo 😂😂😂", "Lady gaga realmente me surpreendeu com a atuação nesse ep ( q, pra mim, foi o melhor até agr) e to achando q essa temporada ta quase chegando a lv: Asylum, agr é esperar q ela se mantenha assim", "Cara, eu preciso tatuar sua cara na minha coxa pra te agradecer. Se não fosse você ia ter que ficar pesquisando tudo de american horror story, e sinceramente eu to muito sem tempo. eu amei esse EP realmente eu esqueci que era a lady GaGa, deu pra sentir o personagem as emoções dele e tudo mais, fucking amei a atuação dela nesse EP, roubou a cena. e outra coisa que eu amei nesse EP foi a trilha sonora, meu pai, eu estou tão viciado naquela do Depeche mode e a candy walls, baixei elas e fiz uma playlist só das duas e deixei só elas tocando sem parar no meu celular durante 3 fucking dias. amei mesmo", "Achei a atuação da Gaga fodaaaastica, me comoveu, me fez sentir pena de uma mulher tão cruel como a condessa. Você esqueceu de comentar/mencionar o jantar da Elizabeth com o March, que para mim tambem,ela me fez arrepiar quando soube que o March que prendeu seus dois amores (Valentino e Natasha), o grito de ódio e incrédulo que ela deu. Se puder me responder pleaseeee,alias adoro seu canal :*", "Cara, de boa, acho que vou te pedir em casamento!  \nPq quando eu perco um episódio, eu fico roendo as unhas pra poder ver seus vídeos e ficar por dentro da série. Vc é 10! Amo seus vídeos!"], "authorLink": "https://www.youtube.com/channel/UC3csl_yNKV--YULIQOL13rA", "description": "A Condessa, personagem de Lady Gaga, ganhou o tão esperado episódio sobre sua história, onde a cantora teve a chance de  mostrar de fato ser ou não uma boa atriz. Sempre fui questionado sobre o que acho sobre a atuação da Gaga então, ta aí o vídeo!\n\nPágina do Facebook: "}