{"title": "POI S4E10 The Cold War, p1 [Root x Shaw]", "url": "https://www.youtube.com/watch?v=xyQyi3H4RWY", "image": "https://i.ytimg.com/vi/xyQyi3H4RWY/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "144630", "datePublished": "2016-08-15", "likes": "892", "dislikes": "22", "comment": ["Re-watching this and Root trying to see how shaw got out of the cuffs in the back is so funny and adorkable", "xD I love that Root's tease heavily implies that she and Sameen have had plenty of situations in which Shaw WAS a willing 'captive'. I love how their relationship was written so well that they don't have to SHOW anything, because the flirting tells all", "I love how awkward Finch looks when he walks into the room. He is like: Good Lord, what kind of foreplay are these two up to?😖", "My mum would say how shaw eats her burger its disgusting, but i think its cute, i dont know why but i love it when sam eats something xD", "Shaw is extra cute here I am dying"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Episode summary:\nSamaritan decides to bring an end to the hide-and-seek game that it has so far played with The Machine. To bring The Machine out of hiding, Samaritan showcases its strength by eliminating crime in New York City for a whole day. Elsewhere, John finds out that Samaritan has learned how to deal with irrelevant numbers and has managed to prevent a series of crimes which would otherwise be taken care of by The Machine. Samaritan's actions leave Harold and his team with a difficult choice, whether to let Samaritan do their job or play along with Samaritan's new plan. When The Machine decides not to communicate with Samaritan, Samaritan changes course, bringing New York City to a halt as it allows crime to dramatically increase. Ultimately, The Machine agrees to talk with Samaritan, and Samaritan indicates the time and place of the conversation. There, Root (acting as The Machine's voice) meets with Samaritan's representative, a young boy. After a tense exchange between the two AIs, it becomes clear that The Machine will not back down, while Samaritan is set on destroying The Machine. The episode ends with Shaw leaving the Subway to help Root and the others while Samaritan engineers a stock market crash on Wall Street. Meanwhile, a series of flashbacks show Greer's past as an MI6 agent. When Greer is assigned to kill a KGB agent, he discovers that the KGB agent is in fact also an MI6 agent and that his deputy director, Blackwood, is in fact a double agent. Overcome with anger, Greer kills Blackwood and severs his ties with MI6.\n\nDecember 16, 2014"}