{"title": "Elon Musk Just Turned Everything in Favor of Tesla", "url": "https://www.youtube.com/watch?v=yVMsIEC2JWY&list=PLtrq8hQ-s4KK_V-BoqZzAeY2yx8sJzCwu", "image": "https://i.ytimg.com/vi/yVMsIEC2JWY/maxresdefault.jpg", "author": "Tesla Vision", "viewCount": "109084", "datePublished": "2021-08-29", "likes": "2,502", "dislikes": "117", "comment": ["WATCH THIS NEXT👇👇👇\n🎥 Tesla Just Set an INSANE Bar for Chinese Electric Cars\n➡️ https://youtu.be/gTUo0CzZYYc", "Good vid♥️ I realized that the secret to making a million is saving for a better investment. I always tell myself you don't need that new Aston Martin or vacation in Hawaii just yet and that mindset helps me make more money investing. For example last year I invested 100 grand in blue chip stocks (with the help of my advisor of course) and made 450k, but guess what?  I reinvested with him again and now I'm rounding up close to a million. Hoping to get to 2mil in 6 months time..", "The \"Energewende\" movement in Germany is ripe with contradictions like this. For example, they are decommissioning perfectly good reactors and must burn lignite coal (the dirtiest kind) to make up the nuclear capacity....kinda like driving your petrol car to the Tesla protest.  Can't see the forest OR the trees.", "This seems more about protectionism than anything else.", "Other leading German manufacturers consume over 16 Million…Yes, 16 MILLION gallons per annum. This is a joke."], "authorLink": "https://www.youtube.com/channel/UCJlC6ya8gchJA5vCcFgyKVA", "description": "The world’s number one leading electric car manufacturer Tesla has faced many push-backs from environmental groups in Berlin who have raised various concerns about its plant’s impact. One of Giga Berlin’s critics, early on in the facility’s construction project, purported that the plant would consume more water than expected. There were also concerns that the plant could lead to contamination of the groundwater. Initially, it was estimated that the car production facility would consume about 3.3 million cubic meters of water for Model Y assembly alone. According to a new application submitted to the Brandenburg State Environment Agency in June, however, Giga Berlin’s maximum annual water consumption was decreased to 1.423 million cubic meters for both Model Y and battery cell production. The automaker also indicated in its new application that it would be making 4680 cells through a dry-electrode coating process – a move that would significantly reduce the water usage at the plant. Additionally, the automaker confirmed that the first 4680 battery cells that are supposed to be utilized in the Giga Berlin-manufactured EVs, would be shipped from the United States. However, environmental groups in Germany such as the NABU and Gruene Liga have pushed back against Gigafactory Berlin’s approval. In July, Tesla was approved to conduct limited tests of its production equipment at the plant – something that two organizations strongly opposed, citing safety concerns. However, earlier this month, NABU decided to drop its lawsuit against the Berlin-Brandenburg Higher Administrative Court for granting the automaker an early approval. Now, the automaker is reportedly receiving support from Green Party politicians over concerns about the Tesla Giga Berlin’s expected water usage. Earlier this week, Green leader Anton Hof_reiter and the party’s General Manager Michael Kellner, visited the facility and inquired about its estimated water consumption. Hofreiter was optimistic about the facility and saw no problems in the approval process. “Tesla turns up the drive and drives at an impressive pace. Anyone who breaks when switching to electromobility is doing a disservice to the German auto industry,” the Green Party leader noted. The party’s General Manager seemed to agree with Hofreiter’s statement. He was confident that the Court (OVG) and other authorities were following procedure. Like top-Chancellor candidate Armin Laschet (CDU), Michael Kellner noted that the upcoming facility would create employment opportunities in the country and generate revenue for the government. The electric automaker is “providing important impetus and creating many future-proof jobs in Brandenburg,” Kellner said. Recently, Armin Laschet, the frontrunner to succeed Angela Merkel as Germany’s Chancellor, visited Giga Berlin and met with Tesla CEO Elon Musk at the factory’s construction site. Laschet seemed to think highly of the project. “Climate neutrality can only be achieved with greater speed. Our regulations are out of time. We have to accelerate planning and approval procedures” he tweeted after meeting the CEO. NABU dropping the lawsuit and the recent backing from Green Party politicians seem to support the idea that opposition against Tesla’s Gigafactory Berlin is declining. Most recently, we reported about Brandenburg’s Environment Committee receiving a smaller number of objections against the automaker’s latest plans for its facility. Out of a total of 373 objections that Tesla initially received last year, the Brandenburg State Office for the Environment (LfU) has so far gathered about 44 objections against the latest plans for the automaker’s plant. The sharp decline in objections gives a clear indication that communities around the Giga Berlin are starting to warm up to Tesla. Despite still lacking a final approval, CEO Elon Musk is hopeful that the Model Y production will kick off at the facility, as early as October 2021. The company is currently focused on meeting its EV demand in the European market. It has already started Model Y deliveries with exports from its Gigafactory Shanghai, in China.\n\nWATCH THIS NEXT👇👇👇\n🎥 Tesla Just Set an INSANE Bar for Chinese Electric Cars\n➡️ "}