{"title": "SHANG CHI POST CREDITS SCENE EXPLAINED | Eternals Connection BREAKDOWN | Marvel", "url": "https://www.youtube.com/watch?v=y91KQaHnARk", "image": "https://i.ytimg.com/vi/y91KQaHnARk/maxresdefault.jpg", "author": "ScreenCrush", "viewCount": "145234", "datePublished": "2021-09-02", "likes": "4,315", "dislikes": "160", "comment": ["Thanks to CuriosityStream for sponsoring this video!  Click the link  https://curiositystream.com/ScreenCrush and use the code ScreenCrush to sign up for just $14.99 for the whole YEAR.", "Holy buckets this movie was really, really good.  I’m going to have to eventually watch it again to fairly compare it to the other marvel movies, but my first reaction puts it way up there right off the bat.  It’s a really darn good one.", "My theory: Eternals showed up 7,000 years ago, never interfered with humanity. Therefore, any weapon of theirs couldn’t show up on the codex. We only know that the Mandarin had them for around a thousand. Maybe it’s Eternals tech", "Wong said they felt the energy in Karma Taj. Shang was in a whole other universe and they felt it across the multiverse", "Wow I was blown away how good this movie was! Shang Chi  in my opinion is the best origin movie to date in the MCU and it was so refreshing to see. I saw it for a second time tonight and it was just as incredible the second time. The fight scenes and cinematography are top tier.   The entire cast is spectacular and I can’t wait to watch it again!"], "authorLink": "https://www.youtube.com/channel/UCgMJGv4cQl8-q71AyFeFmtg", "description": "Thanks to Curiosity Stream for sponsoring this video!  Click the link  https://curiositystream.com/ScreenCrush and use the code ScreenCrush to sign up for just $14.99 for the whole YEAR.\n\nShang Chi and the Legend of the Ten Rings ends with a MAJOR mystery about the origins and purpose of the ten rings. In a post credits secen featuring Wong, Captain Marvel and a (human!) Bruce Banner, they determine that the rings are not chitauri, vibranium, or any other alien substance that Carol Danvers has seen. But they did activate a beacon which alerted Wong and the other sorcerers of Karmar Taj. So who are the rings calling?\n\nWe run the gamut of theories, including Galactus, the Phoenix force, the celestials, and many more. \n\nIf you're new, Subscribe! → "}