{"title": "American Horror Story Brasil Vlog 13 // Lady Gaga Vs. Jessica Lange", "url": "https://www.youtube.com/watch?v=ygP3f3pl7wI", "image": "https://i.ytimg.com/vi/ygP3f3pl7wI/maxresdefault.jpg", "author": "American Horror Story Brasil", "viewCount": "11467", "datePublished": "2015-10-16", "likes": "752", "dislikes": "16", "comment": ["E a série é tão bizarra quanto a Lady Gaga . A série é a cara dela .", "Jessica é Jessica, Lady Gaga é Lady Gaga, n misturem as coisas, particularmente, acho que a Lady Gaga é perfeita para o papel da Condessa. E nao é menosprezando Lange, mas pensem só, Lange fez  expetacularmente Irma Jude, tipo nao tem comparaçao, Gaga nunca faria Jude tao bem quanto Lange, e Lange nao faria a Condessa como Gaga faz, só aceitem que mundanças acontecem e parem de descutir por motivos futeis porque nada vai mudar, ela continuara a fazer a serie.", "lady gaga foi uma ótima escolha, n vejo problema, mas a gessica realmente faz falta", "Concordo com vc...Sou fã da Lady Gaga e tenho certeza que ela não está tentando roubar o papel da Jessica, ela pediu pro Ryan pra participar da série e ele escreveu esse papel pra ela...Jessica é uma atriz sensacional e acho que atriz ou cantora nenhuma a substituiria,Gaga só está ali pq entrou de cabeça no papel e pq Ryan acreditou que ela se encaixaria na série....Em relação aos personagens tbm acho que o Sr March vai ter cenas fodas, particularmente não gostei da Condessa trocar o Donovan pelo Tristan mais vamos ver o que vai dar agora neh e tbm percebi o demônio do vício no quarto com o John mais não sei o que vai rolar de fato e agora to louco pra ver a Ramona pra completar esse elenco incrível...Adorei seu vídeo....", "Eu amo a Jessica Lange ♥♥"], "authorLink": "https://www.youtube.com/channel/UC3csl_yNKV--YULIQOL13rA", "description": "O episódio 2 de Hotel surpreendeu todo mundo trazendo vários personagens novos. Ficamos sabendo um pouco mais da história da Condessa e do Hotel Cortez. Está surgindo uma briga Jessica Lange vs Lady Gaga completamente sem sentido entre os fãs. Vem saber o que eu acho sobre tudo isso!\n\nPágina do Facebook: "}