{"title": "POI S3E12 Aletheia, p1 [Root x Shaw, Shaw]", "url": "https://www.youtube.com/watch?v=YlNrEF2Arlk", "image": "https://i.ytimg.com/vi/YlNrEF2Arlk/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "50374", "datePublished": "2016-07-07", "likes": "218", "dislikes": "4", "comment": ["\" stealing a car, almost dying. Reminds me of the old days at MIT\"\nSounds like a need for a prequel.", "Root is hot even when she's knocked out.", "Finch!! You have certainly to have gravitational pull with the female population!", "we all know phones don't just break by being stepped on, it's only the glass. nice try writers 1:56", "1:12 admittedly that shot is pretty cool, but jumping out of cover like that during a gun fight is really dumb lol\n\nThe only rationale I could think of is the writers and/or director were simply making a statement that these two work well together."], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "ROOT SAVES THE DAY!\nSORRY ABOUT THE BLOOD SPRAY!!\n\nEpisode summary:\nThis continues from the previous episode where Harold, Shaw and Arthur are held captive by Control for information. Shaw is deemed to be not useful and is about to be killed, when Root comes guns blazing and gets them out of there. But Root is shot and captured by Control. Meanwhile it is revealed that Arthur had made a copy of Samaritan before it was destroyed. He stored it in a bank locker. But as they go to get it, Vigilance comes and Harold locks himself, Arthur and the bank manager in the vault. Shaw gets a bomb ready to get everyone out. Inside the vault Harold reveals to Arthur that The Machine exists and convinces him to destroy Samaritan so that it will not fall into wrong hands. Vigilance breaks through the vault and captures everyone including Shaw, but they are saved by Reese and Lionel. The Machine guides Root to escape from Control after having been tortured. She is later shown in a South East Asian restaurant. Root also calls Harold to tell him that the Samaritan drives are not destroyed because the bank manager had been murdered and replaced, and the impostor had swapped the drives. Later, the impostor is shown handing over the drives to Greer from Decima Technologies, who in turn shoots her through the heart to cover his tracks. The episode ends with Greer saying that he has great plans for Samaritan.\n\nJanuary 7, 2014"}