{"title": "POI S2E01 The Contingency, p2 [Root]", "url": "https://www.youtube.com/watch?v=YOBvVedDjeo", "image": "https://i.ytimg.com/vi/YOBvVedDjeo/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "14709", "datePublished": "2016-06-21", "likes": "95", "dislikes": "3", "comment": ["I think Denise The wrote this episode, she definitely wrote some great ones with amazing scenes and lines not to be forgotten, the end of Cura te Ipsum was amazing for example; I wonder if she came up with the idea/line of \"bad code\" on her own, it's genius.", "coooooool"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root just wants to set it free!\n\nEpisode Synopsis: \nReese receives a series of seemingly random words from the Machine via the pay phone. After assigning Carter to look deeper into Alicia Corwin's death, he eventually realizes that the words identify three different books in Finch's library, the Dewey decimal numbers of which make up the Social Security number of accountant Leon Tao (Ken Leung). Paying Tao a visit, Reese confirms that Tao is the next POI, having extorted money from white supremacists. As a government operative sabotages the Corwin investigation to prevent Carter from learning about the Machine, Reese leaves Tao in the care of Fusco while he concentrates on gathering clues to Finch's location. Fusco soon runs afoul of the white supremacists and is taken hostage along with Tao. Reese rescues them, and in doing so acquires an attack dog, which he later names Bear. Meanwhile, Root takes Finch with her as she kidnaps Denton Weeks, one of the government officials overseeing the Machine, and the NSA agent who met with Nathan Ingram and attempted to seize control of the Machine (in \"Super\"). Root thus reveals her curiosity as to how he and Reese thwarted her operation (in \"Root Cause\") so efficiently. She tells Finch that she sees the Machine as a \"perfect intelligence\" and wishes to set it free from the corrupt people it was entrusted to. Throughout the episode, flashbacks show Finch training the Machine to recognize the faces it sees via surveillance cameras, as well as testing its capabilities by having it help him to play Blackjack. When, during one flashback, the Machine saves Finch from an out-of-control car, he rebukes it, stating that it should endeavor to protect everyone else, not him. Frustrated that the Machine has been programmed in this way, Reese threatens to quit if it does not help him find Finch, and is given his first clue to Finch's location: the Social Security number of a girl living in Texas, who has been missing since the age of 14.\n\nSeptember 27, 2012\n\n+144"}