{"title": "Chilling Adventures of Sabrina Episode 7 \"Feast of Feasts\" Breakdown!", "url": "https://www.youtube.com/watch?v=Yqm19o9rOOU", "image": "https://i.ytimg.com/vi/Yqm19o9rOOU/maxresdefault.jpg", "author": "Think Story", "viewCount": "25793", "datePublished": "2018-11-07", "likes": "639", "dislikes": "9", "comment": ["The dry sarcasm in your recaps is so refreshing. Love it.", "i think susie's character is actually nonbinary, hence why throughout the show they respond to both male and female pronouns with seemingly almost no issue (save for encounters w the football team and uncle jesse). the actor who plays susie is also nonbinary.", "It is AMAZING you connect everything, how brilliantly you interweave from past to present episodes, in such a way, where you're not going episode by episode as one might think, you're taking this from a far bigger picture and looking at it as such, it completely blows my mind how you're able to do this time and time again!!!  Plus you do it, I believe, so we are further reminded of things we may have either not seen or forgotten and yet how it's one beautiful told story, but again, you give us a sense of bigger picture here than you might think and not in a condescending way, at all, not in the least, but so full of wonder and your breaking down all the complexities of everything, whether it's a mystery or not!!!  You actually make us think!!! (no pun intended, lol)  You are a FABULOUS storyteller, I can't tell you how much I look forward to your updates on this show and others, Thank You Think Story, you are truly and genuinely brilliant!!!  Bisous, Bisous <3", "The Pizza Boy is the minor character of Ben from Riverdale. Anyone who’s caught up on Riverdale knows what strange things are going on with Ben this season", "My favorite part of the episode: When Prudence asked Sabrina: \"Why is your faith more valid than mine?\" That scene and line got to me."], "authorLink": "https://www.youtube.com/channel/UC34Qdd5Z5KN30A8aJ2eIMPA", "description": "Get ready to cast some spells because it's my new breakdown series for \"Chilling Adventures of Sabrina.\" This is for season one episode 7, \"Feasts of Feasts.\"\n\nFollow me on twitter: www.twitter.com/ThinkStoryYT\n\nHelp me translate this video: "}