{"title": "5 Real Serial Killers Who Inspired 'American Horror Story' Characters", "url": "https://www.youtube.com/watch?v=YWPFnqcN3gk", "image": "https://i.ytimg.com/vi/YWPFnqcN3gk/maxresdefault.jpg", "author": "Top5s", "viewCount": "2910975", "datePublished": "2016-03-19", "likes": "40,962", "dislikes": "789", "comment": ["Evan Peters did a  absolute phenomenal job of play Mr. March", "This is so irrelevant but Evan Peters could get it", "Parents: \"Why do you watch youtube?! You don't learn anything from it!\"\n\nMe: \"..........I can name plenty of serial killers......and their life story.....\"", "that moment when you already know all the mentioned serial killers.😐", "All of these murders were definitely evil but (I feel bad even for saying this) Aileen was definitely traumatized by all she had gone through with men. I think something snapped. She's the only one on here that only shot and killed them. No weird obsession with their bodies or anything. It's definitely a shame for all the victims no matter the circumstance."], "authorLink": "https://www.youtube.com/channel/UCX51Dixddr5HuwLVBH9ykeQ", "description": "Subscribe for a new video every week! ►► http://goo.gl/lYWszy\nCheck out the NEW Top5s website! ►► http://www.Top5s.co.uk \n____________________________________________________________________\n\nAmerican Horror Story is one of the most watched programs on TV right now, and one thing the show likes to do is base characters in the show on real life people. So here are five notorious serial killers who have inspired characters in the show, from Jefferey Dahmer, the deranged serial killer who injected acid into some of his victims brains, to Aileen Wuornos, the lady who had a traumatic childhood and went on to kill seven men. She was executed in October 2002, the tenth woman in the US to be executed since 1976.\n____________________________________________________________________\n\nDon't forget to follow TOP5s on Social Media to keep up with upcoming videos and information! :) \n\nTwitter - "}