{"title": "POI S5E07 QSO, p8 [Root, Root x Shaw]", "url": "https://www.youtube.com/watch?v=yYkcZ4VthWE", "image": "https://i.ytimg.com/vi/yYkcZ4VthWE/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "65778", "datePublished": "2016-07-01", "likes": "306", "dislikes": "11", "comment": ["I think Samaritan actually made a mistake by killing the radio host. I mean, he already got his message out, so after his death(and thus him no longer being on the air) people would become suspicious and wonder if there was any truth to what he said.  Samaritan needed to kill him before he got his message about the hidden code out, after he had done so it was too late, and at that point Samaritan should have just let him go on with people thinking he was a nut, just like those who called in, it would have likely blown over pretty quickly with little interest or evidence, now curious people would want to look deeper into what he said and start to investigate for themselves if it was true.", "I actually think Harold was afraid to find Shaw. He was perinoide about the machine. if it would have been Reese, I think he would have moved heaven and earth. Luckily Shaw is so good. She escaped on her own. With Root giving her hope with that message. MISS POI!!", "Root has so strong will to find Shaw back.\nAnd she doesn't care much about other people actually.", "This one of the episodes where I think Finch is a total hypocrite. I really can't stand him when he's like that.", "If they weren't 6 episodes from the end, there was a potential new character and thread and direction for the show to go in here instead of killing this guy off. Might have started getting a bit too X-filesey, though."], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "Root and Harold disagree on the merits of free will.\nShaw is making plans.\n\nEpisode summary:\nWhile Fusco and Bear recover in a hospital from their near-demolition, Root visits him and hands him an exit strategy consisting of ID's and documents made by the Machine. Root is then sent on a series of whimsical, ominously productive tertiary missions by the Machine after it had discovered that Samaritan has been using the radiowave frequencies of station AM 520 to communicate with its operatives via a sophisticated code, which most people believe to be feedback noise from the radio waves. Upon realizing that this is why the Machine sent her there, Root uses Samaritan's own equipment to send a message to Shaw to give her hope. Reese is as helpful as he can possibly be without stepping into the AI-based argument between Finch and Root. Finch does not necessarily agree with the Machine not forcing the radio host to quit to save his life from Samaritan, but Root believes the Machine maintains its belief that humans have free will and it protects them from Samaritan so that they do not lose that free will. After Fusco finishes his recovery in the hospital, he is visited by Finch, who refuses to waver from his stance that keeping Fusco in the dark keeps him safe. Fusco points out that it is not working since he ended up in the ER, hands his encrypted-from-Samaritan phone back to Finch, fed up with being in the dark, and says he's done. Shaw is escorted by Lambert on a field trip outside and told to kill an innocent woman; believing that she is actually just in another simulation, Shaw does so and is later shocked when told that it wasn't a simulation. Unwilling to remain a guinea pig, Shaw is about to kill herself when she receives the message from Root, regains hope and allows herself to be disarmed. Later, Shaw stealthily makes preparations to escape.\n\nMay 24, 2016"}