{"title": "INCEST MURDERS: The Most HORRIFIC Story You've EVER Heard • EWU Story Time & Crime Documentary", "url": "https://www.youtube.com/watch?v=Yz0ft0YhNHU", "image": "https://i.ytimg.com/vi/Yz0ft0YhNHU/maxresdefault.jpg", "author": "EXPLORE WITH US", "viewCount": "1814803", "datePublished": "2021-04-23", "likes": "33,041", "dislikes": "1,179", "comment": ["I’ve heard of this story before, and I will fully agree that it is one of the most messed up stories I’ve ever heard and I watch ALOT of true crime so that says a lot.", "“How could you? You’re sick. She’s a child.”\n\nAND SHE IS HIS D A U G H T E R 😳", "Can we talk about how his mother describes her as his WIFE and not daughter during the 911 call, absolutely abhorrent", "All of these deaths are on the hands of Katie’s adoptive parents as well as Steven’s mother. What kind of sick people allow open incest and child abuse like this? Seriously, an 11 year old understood how disgusting this was but all the adults (aside from the ex-wife) were just like, “well sure it’s weird but it’s cool, they’re in love.”", "How could this mother give this man three children"], "authorLink": "https://www.youtube.com/channel/UCJWKjrrUh2KL1d3zXQW79cQ", "description": "In today's true crime and murder documentary, we're covering the extremely twisted case of Steven and Katie Pladl: the most HORRIFIC true story you've EVER heard. In the 1990s, Steven met a girl online named Alyssa, and the pair soon met up. Alyssa was unaware of the nightmare that would unfold after this meeting. Just two years later, the couple had a baby girl named Denise. After witnessing Steven's disturbing behavior toward the baby girl, Denise was given up for adoption and renamed Katie by her adoptive parents. Years later, Katie sought out her biological parents, unaware that meeting them would quickly spiral out of control into something she never could have possibly imagined. This is one of the most horrific true crime cases we've EVER covered. Join us for a true crime storytime covering the disturbing case of Steven and Katie Pladl."}