{"title": "POI S5E12 .exe, p1 [TM!Root, Shaw]", "url": "https://www.youtube.com/watch?v=Z145n7zkgbs", "image": "https://i.ytimg.com/vi/Z145n7zkgbs/maxresdefault.jpg", "author": "Root & Shaw", "viewCount": "10246", "datePublished": "2016-06-21", "likes": "60", "dislikes": "0", "comment": ["It's really good to see Sarah animated again and with some color back in her face.  I don't know what it is(maybe it's her personal life, or the production schedule, or whatever) but she hasn't really been the same since she returned a few episodes back.", "Was Shaw just sitting in Root’s room in the subway?"], "authorLink": "https://www.youtube.com/channel/UCiCcLjTAZWGj5dh3QzNTxPA", "description": "TM!Root as a self-driving car!\nShaw and Reese search out Finch.\nWhat if The Machine had never existed?\n\nEpisode summary:\nFusco discovers that all the people killed in the Correction have turned up as corpses and is kidnapped by Agent LeRoux who reveals himself to be the killer. Fusco overpowers LeRoux and is left wondering whether or not to kill the man to protect himself and his family. As Finch prepares to deploy his stolen computer virus, he experiences doubts due to the fact that it will also destroy the Machine, so the Machine shows him a series of simulations of what would have occurred to each of the team members if the Machine never existed. At the same time, Reese and Shaw are given a new number: John Greer and coordinates to Fort Meade where Finch infiltrates the NSA and uploads his virus onto the NSA's Intranet but is captured before he can activate it. Finch is brought before Greer who takes him to a secure room and reveals that Samaritan wants to rule the world with the Machine. When Finch refuses to join, Greer sacrifices himself in an attempt to kill Finch by having all the oxygen removed from the room. However, Reese and Shaw are able to infiltrate the building and use a wireless modem to give the Machine access within, allowing it to save Finch's life. The two then rescue Reese and Shaw in return and help them get outside to safety. When Finch continues to hesitate, the Machine shows him a final simulation revealing that Samaritan would've come into existence regardless but unchecked without the Machine to fight it. Finch confronts Samaritan and with the Machine's encouragement, activates the virus that will kill them both before leaving.\n\nJune 14, 2016\n\n+386"}