{"title": "RICK AND MORTY 5x08: Evil Morty Origin + Every EASTER EGG Explained | Full Breakdown", "url": "https://www.youtube.com/watch?v=zKwnMTf1R3k", "image": "https://i.ytimg.com/vi/zKwnMTf1R3k/maxresdefault.jpg", "author": "ScreenCrush", "viewCount": "681033", "datePublished": "2021-08-09", "likes": "16,656", "dislikes": "815", "comment": ["What did you think of the episode?", "Evil morty can’t be his og beths kid since Rick said to his past self that morty is their hypothetical grandson meaning that their Beth didn’t have morty. Beth must’ve died very young like the “fake” memory he showed when in prison.", "This ep dropped so many canon bombs", "For anyone that's still confused, in \"The Rickshank Redemption\" episode, alternate Rick says: \"Excuse me? Bro, Rick's don't pass on this. Who do you think you are?\" - To which our Rick replies: \"A different kind of Rick I guess\". So from what I understand, most Rick's took the offer, and left their families, and our Rick is probably one of the few (if not the only one) that didn't take the offer. The reason why I say one of few, is because memory Rick asks something along the lines of: \"Are you one of those perverts that go to abandoned Beths.\" - Which implies that he's not the only one. \nThis would also explain why he hates the citadel, and why he was so quick to abandon the Beth from the Cronenburg reality - Because it wasn't his original Beth, none of them are.", "How could evil Morty be C130s Morty if his Beth was just a child herself when she was killed? If that scene when he was in the brainalizer was not a completely fabricated origin story, then his Beth would have only been 3 or 4 when she died, no way she could have had Morty."], "authorLink": "https://www.youtube.com/channel/UCgMJGv4cQl8-q71AyFeFmtg", "description": "Rick and Morty's penultimate episode of season 5 had the resurrection of Bird Person, the Battle fo Blood Ridge, and the shocking revelation that Rick's Beth died, and he has been Iiving a lie. WHAT!? This has major ramifications for the entire show. We go back through the show's history to find connections, and evidence of this shocking twist. It's absolutely crazy.\n\nI did make a mistake in the video though. I said Beth was Cronenberged, when it was actually the planet was Cronenberged. My bad. \n\nIf you're new, Subscribe! → "}