{"title": "Person of Interest: Trailer Italiano Ufficiale | HD", "url": "https://www.youtube.com/watch?v=zlsry-ZPC5s", "image": "https://i.ytimg.com/vi/zlsry-ZPC5s/maxresdefault.jpg", "author": "Tony Cooper", "viewCount": "42227", "datePublished": "2015-07-31", "likes": "235", "dislikes": "10", "comment": ["Il mio programma televisivo preferito", "Guardata tutta,103 episodi in 2 settimane.mi è piaciuta molto,anche se mi aspettavo un finale diverso..o sarà stato solo uno dei finali della MACCHINA?", "Per essere un vero driver nucleare cioè luce della fisica nucleare 30 minuti sopra a C^2 relatività ristretta,  deve essere video questurato nucleare, la carta d'identità, perché scegli il bene dal male come legge.\nIl driver è come si accende la luce al Sole nostra stella.", "Nice video sweetie!", "uguale a watch dogs"], "authorLink": "https://www.youtube.com/channel/UCiuNMSGw9rDEIp6f-DUw30Q", "description": "Trailer interamente in italiano di Person of interest.\n\nIn seguito agli attentati che colpirono gli Stati Uniti nel 2001, Harold Finch (un misterioso genio dell'informatica residente a New York) ha costruito La Macchina, un'intelligenza artificiale (IA), per un progetto segreto antiterroristico dell'amministrazione americana (operativo dal 2005) chiamato Northern Lights. La creazione di Finch, inoltre, può predire i reati più comuni, i quali però sono catalogati come \"irrilevanti\" e ritenuti.  A tale scopo, egli incontra nel 2011 John Reese, un ex ufficiale delle forze speciali dell'esercito statunitense, nonché ex agente del Central Intelligence Agency (CIA), in procinto di suicidarsi per via della morte della sua amante di gioventù Jessica Arndt (la quale egli aveva lasciato a malincuore a causa del proprio lavoro). L'uomo, infatti, si sente colpevole per la tragedia, in quanto è stato il successivo compagno della donna, Peter Arndt, a ucciderla. Finch rivela a Reese la sussistenza della Macchina e affida a costui il compito di impedire che si verifichino gli atti di violenza \"irrilevanti\", dando così a Reese un nuovo motivo per cui vivere. In tutto questo, il ruolo dell'IA è di mandare periodicamente a Harold e a John (classificati dal sistema rispettivamente come Amministratore e Risorsa Primaria) il numero di previdenza sociale di uomini e donne che saranno coinvolti in un crimine aggressivo premeditato. La Macchina, tuttavia, non può precisare se i soggetti saranno vittime o carnefici, né quale sarà il misfatto a essi collegato e quando avverrà (solitamente entro quarantotto ore dall'invio del numero medesimo). Il motivo di ciò è che il suo ideatore l'ha concepita in maniera che essa violasse la privacy dei cittadini il meno possibile, fornendo ai due vigilanti e ai responsabili governativi soltanto gli elementi anagrafici delle \"persone d'interesse\" e nulla di più. Tale precauzione, oltretutto, minimizza il rischio che la backdoor Contingenza venga scoperta da altri individui."}