{"title": "AMERICAN HORROR STORIES: Episode 1 & 2 Breakdown, Easter Eggs & Ending Explained!", "url": "https://www.youtube.com/watch?v=Zmf3Q6NCCCc", "image": "https://i.ytimg.com/vi/Zmf3Q6NCCCc/maxresdefault.jpg", "author": "Think Story", "viewCount": "135624", "datePublished": "2021-07-15", "likes": "3,918", "dislikes": "63", "comment": ["Remember, always wear a rubber!\n\nCheck out my other AHS videos:\nAPOCALYPSE: https://youtube.com/playlist?list=PLY9KJ1cFVs7h4q3U74wE5fHRPGSb1gcxY", "That house is sure getting crowded", "Honestly what is Ryan Murphy’s kink about gay men cheating on each other? That seems to be the only storyline he gives to his gay male characters. It’s ridiculous", "The biggest problem I had with these first two episodes was there was no real sense of horror or tension. Whenever some one was killed in the very next scene they seem to be totally over it and accepting of the situation. Which took away any and all feelings of there being consequences or stakes. Also in the time span of a mere couple days, 5 people go missing, all of their last known locations was at the murder house and there's a 2 minute scene with police detectives and then they are never brought up or mentioned again. Even though months go by with the time jumps. And lastly I will just say that the character of Ruby felt like she came out of no where. Anyways yeah can't say I was super impressed but I am optimistic about future episodes. Thanks for taking the time to make your vid. Much appreciated.", "I think anticlimactic is the best way to describe these first two episodes. I was so excited to watch it but I was left feeling disappointed when I finally did. I don’t know if it was the plot or the underdeveloped characters or what..."], "authorLink": "https://www.youtube.com/channel/UC34Qdd5Z5KN30A8aJ2eIMPA", "description": "FX and Hulu's AHS spinoff series AMERICAN HORROR STORIES has just released with episodes 1 & 2. In this video I break it all down including easter eggs from past seasons and the AHS universe.\n\nAH: Stories Playlist: "}