{"title": "American Horror Story Season 7: EXCLUSIVE Winter Anderson Preview, Cult Opening and Trailer", "url": "https://www.youtube.com/watch?v=ZtNgMfyRBHw", "image": "https://i.ytimg.com/vi/ZtNgMfyRBHw/hqdefault.jpg", "author": "MaryGirl Moody", "viewCount": "6893", "datePublished": "2017-08-22", "likes": "231", "dislikes": "9", "comment": ["I definetly think this will be the best season. It looks very different than a lot of the other seasons and I was expecting it to be on a very large scale, but it actually seems to be on a smaller scale. Wouldn't an interesting twist be that ivy (alison pill's character) is actually apart of the cult.", "I love how they made the connection with Freakshow in this season and this season is political. It is a good comparison to how the president wants to allow states to decide their laws, such as giving them the option to get rid of gay marriage. Basically inferring that with Trump as president, the States can choose to have a closed minded life like how the citizens of Jupiter Florida were.", "I am so blown away on how exited I actually am for this season. I wasn't expecting to be this hyped lol. Good job Ryan!", "Im so fricken excited for this season. Two weeks everybody! We got this, its going to feel like forever but we are the some of the most patient people in this world 😁😂😂😂", "I was so glad you liked it too!! The trumpets make the song sound American!!"], "authorLink": "https://www.youtube.com/channel/UCc5rwO1EcnOo6ydOmGItlGQ", "description": "I DO NOT OWN THE PREVIEWS IN THIS VIDEO. ALL ARE PROPERTY OF FX AND AMERICAN HORROR STORY. NO COPYRIGHT INFRINGEMENT INTENDED. FAN USE ONLY.\n\nAmerican Horror Story Season 7: EXCLUSIVE Winter Anderson Preview, Cult Opening and Trailer\n\nSpecial Thanks to @aRMaN_uppal and @ahsleak on Twitter for providing the information. Please follow them on Twitter!!\n\nEnjoy, subscribe, and don't forget to comment!\n\nLINKS:\nMARY'S BOOKS & THANGS:\n--website: maryannmoody.us\n--Patreon: "}